[
 {
   "no": 1,
   "doa": "Al-Ismu Al-Adhom",
   "arab": " اللّهُمَّ إِنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ.,",
   "latin": "",
   "arti": "Ya Alloh, sesungguhnya aku mohon kepadaMu, karena sesungguhnya aku bersaksi bahwa sesungguhnya Engkau adalah Alloh, tiada tuhan selain Engkau, yang Maha Esa, Dzat tempat meminta segala sesuatu, Dzat yang tidak beranak dan tidak dilahirkan dan tidak ada seorangpun yang menyamaiNya. ,",
   "cara": "",
   "utama": "",
   "sumber": "HR Tirmidzi,"
 },
 {
   "no": 2,
   "doa": "Al-Ismu Al-Adhom",
   "arab": " اللّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ، لَا إِلَهَ إِلَّا أَنْتَ الْمَنَّانُ، بَدِيعُ السَّمَاوَاتِ وَالْأَرْضِ، يَا ذَا الْجَلَالِ وَالْإِكْرَامِ، يَا حَيُّ يَا قَيُّومُ.,",
   "latin": "",
   "arti": "Ya Alloh, sesungguhnya aku mohon kepadaMu, karena sesungguhnya segala puji bagiMu, tiada tuhan selainMu, Dzat yang memberi anugrah Pencipta langit dan bumi, wahai Dzat yang memiliki keagungan dan kemuliaan, wahai Dzat yang hidup, wahai Dzat yang mengatur.,",
   "cara": "",
   "utama": "",
   "sumber": "HR Abu Dawud,"
 },
 {
   "no": 3,
   "doa": "Al-Ismu Al-Adhom",
   "arab": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الطَّاهِرِ الطَّيِّبِ الْمُبَارَكِ الْأَحَبِّ إِلَيْكَ، الَّذِي إِذَا دُعِيتَ بِهِ أَجَبْتَ، وَإِذَا سُئِلْتَ بِهِ أَعْطَيْتَ، وَإِذَا اسْتُرْحِمْتَ بِهِ رَحِمْتَ، وَإِذَا اسْتُفْرِجْتَ بِهِ فَرَّجْتَ.  ْ,",
   "latin": "",
   "arti": "Ya Alloh, sesungguhnya aku mohon kepadaMu dengan namaMu yang suci, yang baik, yang diberkahi dan paling Engkau senangi, yang jika Engkau dipanggil dengan nama itu maka Engkau mengabulkan dan ketika Engkau diminta dengan nama itu, maka Engkau memberi dan ketika Engkau dimintai kasih sayang dengan nama itu, maka Engkau menyayangi dan ketika Engkau dimintai jalan keluar maka Engkau memberi jalan keluar.,",
   "cara": "",
   "utama": "",
   "sumber": "HR Ibnu Majah,"
 },
 {
   "no": 4,
   "doa": "Al-Ismu Al-Adhom",
   "arab": "اللَّهُمَّ إِنِّي أَدْعُوكَ اللَّهَ وَأَدْعُوكَ الرَّحْمَنَ وَأَدْعُوكَ الْبَرَّ الرَّحِيمَ، وَأَدْعُوكَ بِأَسْمَائِكَ الْحُسْنَى كُلِّهَا، مَا عَلِمْتُ مِنْهَا، وَمَا لَمْ أَعْلَمْ، أَنْ تَغْفِرَ لِي وَتَرْحَمَنِي. ,",
   "latin": "",
   "arti": "Ya Alloh, sesungguhnya aku memanggilMu Alloh, aku memanggilMu Maha Pengasih, aku memanggilMu Maha Baik lagi Maha Penyayang, aku memanggilMu dengan semua nama-namaMu yang baik, yang aku tahu dan yang belum aku ketahui, agar Engkau mengampuniku dan menyayangiku. ,",
   "cara": "",
   "utama": "",
   "sumber": "HR Ibnu Majah,"
 },
 {
   "no": 5,
   "doa": "Al-Ismu Al-Adhom",
   "arab": "وَإِلَـٰهُكُمْ إِلَـٰهٌ وَٰحِدٌ لَّآ إِلَـٰهَ إِلَّا هُوَ ٱلرَّحْمَـٰنُ ٱلرَّحِيمُ. ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ,",
   "latin": "",
   "arti": " Dan Tuhan kalian adalah Tuhan yang Satu, tiada Tuhan selainNya yang Maha Pengasih lagi Maha Penyayang. Alloh tiada Tuhan selainNya, yang Maha Hidup lagi Maha Mengatur.,",
   "cara": "",
   "utama": "",
   "sumber": "HR Abu Dawud,"
 },
 {
   "no": 6,
   "doa": "Shalawat Nabi Muhammad SAW",
   "arab": " اللّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ فِي الْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ,",
   "latin": "",
   "arti": "Ya Alloh berikanlah rohmat kepada Nabi Muhammad dan keluarga Nabi Muhammad, sebagaimana Engkau telah memberi rohmat kepada keluarga Nabi Ibrohim. Dan berikanlah kebarokahan kepada Nabi Muhammad dan keluarga Nabi Muhammad, sebagaimana Engkau telah memberi kebarokahan kepada keluarga Nabi Ibrohim di dalam alam semesta, sesungguhnya Engkau Maha Terpuji lagi Maha Agung. ,",
   "cara": "",
   "utama": "",
   "sumber": "HR Muslim,"
 },
 {
   "no": 7,
   "doa": "Shalawat Nabi Muhammad SAW",
   "arab": " اللّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَبَارِكْ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ,",
   "latin": "",
   "arti": "Ya Alloh berikanlah rohmat kepada Nabi Muhammad dan istrinya serta anak turunnya, sebagaimana Engkau telah memberi rohmat kepada keluarga Nabi Ibrohim. Dan berikanlah kebarokahan kepada Nabi Muhammad dan istrinya serta anak turunnya, sebagaimana Engkau telah memberi kebarokahan kepada keluarga Nabi Ibrohim, sesungguhnya Engkau Maha Terpuji lagi Maha Agung. ,",
   "cara": "",
   "utama": "",
   "sumber": "HR Bukhari,"
 },
 {
   "no": 8,
   "doa": "Shalawat Nabi Muhammad SAW",
   "arab": "اللّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ,",
   "latin": "",
   "arti": "Ya Alloh berikanlah rohmat kepada Nabi Muhammad dan keluarga Nabi Muhammad. ,",
   "cara": "",
   "utama": "",
   "sumber": "HR Nasai,"
 },
 {
   "no": 9,
   "doa": "Doa Nabi Yunus",
   "arab": "۔... لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ,",
   "latin": "",
   "arti": "tidak ada Tuhan selain Engkau. Maha Suci Engkau, sesungguhnya aku adalah tergolong orang-orang yang berbuat dhalim/aniaya,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "",
   "sumber": "Al Anbiya' 87,"
 },
 {
   "no": 10,
   "doa": "Doa Mohon Ampunan",
   "arab": " رَبَّنَا ٱغۡفِرۡ لَنَا ذُنُوبَنَا وَإِسۡرَافَنَا فِىٓ أَمۡرِنَا وَثَبِّتۡ أَقۡدَامَنَا وَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡڪَـٰفِرِينَ,",
   "latin": ",",
   "arti": "Ya Tuhan kami, ampunilah dosa-dosa kami yang melampaui batas dalam urusan kami dan tetapkanlah telapak kaki kami (di dalam agama), dan tolonglah kami atas orang-orang kafir,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Ali Imron 147,"
 },
 {
   "no": 11,
   "doa": "Doa Mohon Ampunan",
   "arab": "رَّبَّنَآ إِنَّنَا سَمِعْنَا مُنَادِيًۭا يُنَادِى لِلْإِيمَـٰنِ أَنْ ءَامِنُوا۟ بِرَبِّكُمْ فَـَٔامَنَّا ۚ رَبَّنَا فَٱغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّـَٔاتِنَا وَتَوَفَّنَا مَعَ ٱلْأَبْرَارِ,<br>\nرَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ ۖ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ,",
   "latin": "",
   "arti": "Wahai Tuhan kami, sesungguhnya kami mendengar orang yang menyeru kepada iman, (yaitu), Berimanlah kalian kepada Tuhan kalian, maka kami pun beriman. Wahai Tuhan kami, ampunilah dosa-dosa kami dan hapuskanlah kesalahan-kesalahan kami, dan matikanlah kami beserta orang-orang yang baik. Wahai Tuhan kami, berilah kami apa yang telah Engkau janjikan kepada kami melalui utusan-utusanMu. Dan janganlah Engkau hinakan kami di hari Kiamat. Sesungguhnya Engkau tidak pernah mengingkari janji. ,",
   "cara": "",
   "utama": "",
   "sumber": "Ali Imron 193-194,"
 },
 {
   "no": 12,
   "doa": "Doa Mohon Ampunan",
   "arab": "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ,",
   "latin": "",
   "arti": "Wahai Tuhan kami, kami telah berbuat kedzaliman kepada diri kami, jika Engkau tidak mengampuni kami dan tidak menyayangi kami, niscaya kami tergolong orang-orang yang merugi. ,",
   "cara": "",
   "utama": "",
   "sumber": "Al A'raf 23,"
 },
 {
   "no": 13,
   "doa": "Doa Mohon Ampunan",
   "arab": "رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ ,",
   "latin": "",
   "arti": "Wahai Tuhan kami, kami telah beriman, maka ampunilah kami dan sayangilah kami, Engkau adalah Pemberi rohmat yang terbaik.,",
   "cara": "",
   "utama": "",
   "sumber": "Al Mu'minun 109,"
 },
 {
   "no": 14,
   "doa": "Doa Mohon Ampunan",
   "arab": "رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ,",
   "latin": "",
   "arti": "Wahai Tuhan kami, sempurnakan untuk kami cahaya kami, ampunilah kami, sesungguhnya Engkau Maha Kuasa atas segala sesuatu.,",
   "cara": "",
   "utama": "",
   "sumber": "At Tahrim 8,"
 },
 {
   "no": 15,
   "doa": "Doa Mohon Ampunan",
   "arab": "رَبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ,",
   "latin": "",
   "arti": "Wahai Tuhanku, ampunilah (aku) dan sayangilah (aku), Engkau adalah Pemberi rohmat yang terbaik.,",
   "cara": "",
   "utama": "",
   "sumber": "Al Mukminun 118,"
 },
 {
   "no": 16,
   "doa": "Doa Mohon Ampunan",
   "arab": "رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي,",
   "latin": "",
   "arti": "Wahai Tuhanku, sesungguhnya aku telah berbuat aniaya pada diriku maka ampunilah aku.,",
   "cara": "",
   "utama": "",
   "sumber": "Al Qosos 16,"
 },
 {
   "no": 17,
   "doa": "Doa Mohon Kebaikan Dunia Akhirat,",
   "arab": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ,",
   "latin": "",
   "arti": "Wahai Tuhan kami, berilah kami kebaikan di dunia dan di akhirat dan jagalah kami dari siksa neraka.,",
   "cara": "",
   "utama": "",
   "sumber": "Al Baqarah 201,"
 },
 {
   "no": 18,
   "doa": "Doa Mohon Segala Kebaikan,",
   "arab": "رَبِّ إِنِّي لِمَا أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ ,",
   "latin": "",
   "arti": "Wahai Tuhanku, sesungguhnya aku orang yang sangat membutuhkan kebaikan yang telah Engkau turunkan kepadaku.,",
   "cara": "",
   "utama": "",
   "sumber": "Al Qosos 24,"
 },
 {
   "no": 19,
   "doa": "Doa Mohon Tetap Dalam Hidayah,",
   "arab": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ ,",
   "latin": "",
   "arti": "Wahai Tuhan kami, janganlah Engkau menyimpangkan hati kami setelah Engkau berikan petunjuk kepada kami, dan karuniakanlah kepada kami rahmat dari sisiMu, sesungguhnya Engkau Maha Pemberi. ,",
   "cara": "",
   "utama": "",
   "sumber": "Ali Imron 8-9,"
 },
 {
   "no": 20,
   "doa": "Doa Mohon Dibangunkan Rumah di Surga,",
   "arab": "رَبِّ ابْنِ لِي عِندَكَ بَيْتًا فِي الْجَنَّةِ  ,",
   "latin": "",
   "arti": "Wahai Tuhanku, bangunkan untukku rumah di sisiMu di dalam surga. ,",
   "cara": "",
   "utama": "",
   "sumber": "At Tahrim 11,"
 },
 {
   "no": 21,
   "doa": "Doa Mohon Diselamatkan dari Neraka,",
   "arab": "رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا إِنَّهَا سَاءَتْ مُسْتَقَرًّا وَمُقَامًا ,",
   "latin": "",
   "arti": "Wahai Tuhan kami, palingkanlah siksa Jahanam dari kami, karena sesungguhnya siksanya itu merusak. Sesungguhnya neraka Jahanam itu seburuk-buruk tempat menetap dan tempat kediaman. ,",
   "cara": "",
   "utama": "",
   "sumber": "Al Furqon 65-66,"
 },
 {
   "no": 22,
   "doa": "Doa Mohon Dijadikan Orang Sholih, Dikenang kebaikannya dan pewaris Surga,",
   "arab": "رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ وَاجْعَلْ لِي لِسَانَ صِدْقٍ فِي الْآخِرِينَ , وَاجْعَلْنِي مِنْ وَرَثَةِ جَنَّةِ النَّعِيمِ , ",
   "latin": "",
   "arti": "Wahai Tuhanku, berikanlah kepadaku hikmah dan masukkanlah aku ke dalam golongan orang-orang yang shalih, dan jadikanlah untukku tutur kata yang baik bagi orang-orang yang akhir (generasi setelahku), dan jadikanlah aku termasuk orang yang mewarisi surga yang penuh kenikmatan. ,",
   "cara": "",
   "utama": "",
   "sumber": "As Su'aro 83-85,"
 },
 {
   "no": 23,
   "doa": "Doa mohon agar digolongkan orang-orang yang menyaksikan kebenaran ,",
   "arab": "رَبَّنَا آمَنَّا بِمَا أَنْزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ  ,",
   "latin": "",
   "arti": "Wahai Tuhan kami, kami telah beriman kepada apa (Al-Qur'an) yang Engkau turunkan dan kami telah mengikuti Rosul, maka catatlah kami bersama golongan orang yang menyaksikan (atas kebenaran Al-Qur'an dan kenabian Muhammad). ,",
   "cara": "",
   "utama": "",
   "sumber": "Ali Imron 53,"
 },
 {
   "no": 24,
   "doa": "Doa mohon agar digolongkan orang-orang yang menyaksikan kebenaran ,",
   "arab": "رَبَّنَا آمَنَّا فَاكْتُبْنَا مَعَ الشَّاهِدِينَ  ,",
   "latin": "",
   "arti": "Wahai Tuhan kami, kami telah beriman, maka catatlah kami bersama orang-orang yang menyaksikan (atas kebenaran Al-Qur'an dan kenabian Muhammad). ,",
   "cara": "",
   "utama": "",
   "sumber": "Al Maidah 83,"
 },
 {
   "no": 25,
   "doa": "Do'a mohon menjadi ahli syukur,",
   "arab": "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ,",
   "latin": "",
   "arti": "Wahai Tuhanku, berikan aku ilham untuk tetap mensyukuri nikmatMu yang telah Engkau anugerahkan kepadaku dan kepada kedua orang tuaku dan agar aku mengerjakan kebaikan yang Engkau ridlai dan masukkanlah aku dengan rohmahMu ke dalam golongan hamba-hambaMu yang shalih. ,",
   "cara": "",
   "utama": "",
   "sumber": "An Naml 19,"
 },
 {
   "no": 26,
   "doa": "Do'a mohon menjadi ahli syukur,",
   "arab": "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ,",
   "latin": "",
   "arti": "Wahai Tuhanku, berilah aku ilham agar aku dapat mensyukuri nikmatMu yang telah Engkau anugerahkan kepadaku dan kepada kedua orang tuaku, dan agar aku dapat berbuat kebaikan yang Engkau ridlai dan jadikan anak turunku orang-orang yang shalih. Sesungguhnya aku bertaubat kepadaMu, dan sesungguhnya aku termasuk orang muslim. ,",
   "cara": "",
   "utama": "",
   "sumber": "Al Ahqof 15,"
 },
 {
   "no": 27,
   "doa": "Do'a mohon dimasukkan golongan orang-orang yang sholih,",
   "arab": "فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ,",
   "latin": "",
   "arti": "(Wahai Tuhan) pencipta langit dan bumi, Engkaulah kekasihku di dunia dan di akhirat, wafatkanlah aku dalam keadaan muslim dan masukkanlah aku ke dalam golongan orang-orang yang shalih.  ,",
   "cara": "",
   "utama": "",
   "sumber": "Yusuf 101,"
 },
 {
   "no": 28,
   "doa": "Do'a mohon tidak diberi beban yang berat sehingga tidak mampu menanggungnya,",
   "arab": "رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ,",
   "latin": "",
   "arti": "Wahai Tuhan kami, janganlah Engkau menyiksa kami jika kami lupa atau kami melakukan kesalahan dengan tidak sengaja. Wahai Tuhan kami, janganlah Engkau bebani kami dengan beban yang berat sebagaimana Engkau bebankan kepada orang-orang sebelum kami. Wahai Tuhan kami, janganlah Engkau bebankan kepada kami apa yang tidak sanggup kami menanggungnya. Maafkanlah kami, ampunilah kami, dan sayangilah kami. Engkaulah kekasih kami, maka tolonglah kami mengatasi orang-orang kafir. ,",
   "cara": "",
   "utama": "",
   "sumber": "Al Baqarah 286,"
 },
 {
   "no": 29,
   "doa": "Do'a mohon kesabaran ,",
   "arab": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ,",
   "latin": "",
   "arti": "Wahai Tuhan kami, limpahkanlah kesabaran kepada kami dan matikanlah kami dalam keadaan muslim. ,",
   "cara": "",
   "utama": "",
   "sumber": "Al A'rof 126,"
 },
 {
   "no": 30,
   "doa": "Do'a mohon kesabaran ,",
   "arab": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ,",
   "latin": "",
   "arti": "Wahai Tuhan kami, limpahkanlah kesabaran kepada kami, dan tetapkanlah telapak kaki kami dan tolonglah kami mengatasi orang-orang kafir.,",
   "cara": "",
   "utama": "",
   "sumber": "Al Baqarah 25,"
 },
 {
   "no": 31,
   "doa": "Do'a mohon ditunjukkan perkara yang benar,",
   "arab": "رَبَّنَا آتِنَا مِنْ لَدُنْكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا,",
   "latin": "",
   "arti": "Wahai Tuhan kami, berikanlah rohmat kepada kami dari sisiMu dan sediakanlah kebenaran bagi kami dalam urusan kami.,",
   "cara": "",
   "utama": "",
   "sumber": "Al Kahfi 10,"
 },
 {
   "no": 32,
   "doa": "Do'a mohon agar bisa tetap dalam kebenaran dalam kondisi apapun,",
   "arab": "رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا,",
   "latin": "",
   "arti": "Wahai Tuhanku, masukkan aku ke tempat masuk yang benar dan keluarkan (pula) aku ke tempat keluar yang benar dan berikanlah kepadaku dari sisiMu kekuasaan yang dapat menolong(ku). ,",
   "cara": "",
   "utama": "",
   "sumber": "Al Baqarah 250,"
 },
 {
   "no": 33,
   "doa": "Do'a mohon agar tidak meminta sesuatu yang tidak pantas/tidak boleh diminta ,",
   "arab": "رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلَّا تَغْفِرْ لِي وَتَرْحَمْنِي أَكُنْ مِنَ الْخَاسِرِينَ,",
   "latin": "",
   "arti": "Wahai Tuhanku, sesungguhnya aku berlindung kepadaMu dari memohon kepadaMu sesuatu yang aku tidak mengetahui (hakikatnya). Dan jika Engkau tidak mengampuniku, dan (tidak) menyayangiku, maka aku termasuk orang-orang yang rugi ,",
   "cara": "",
   "utama": "",
   "sumber": "Hud 47,"
 },
 {
   "no": 34,
   "doa": "Mendo'akan kedua orang tua,",
   "arab": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ,",
   "latin": "",
   "arti": "Wahai Tuhan kami, ampunilah aku dan kedua orang tuaku serta orang-orang iman pada hari hisab. ,",
   "cara": "",
   "utama": "",
   "sumber": "Ibrahim 41,"
 },
 {
   "no": 35,
   "doa": "Mendo'akan kedua orang tua,",
   "arab": "رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا.,",
   "latin": "",
   "arti": "Wahai Tuhanku, ampunilah aku, kedua orang tuaku, dan siapa pun yang memasuki rumahku dengan beriman dan (ampunilah) orang-orang iman laki-laki dan perempuan. Dan janganlah Engkau menambah bagi orang-orang yang dhalim selain kehancuran.,",
   "cara": "",
   "utama": "",
   "sumber": "Nuh 28,"
 },
 {
   "no": 36,
   "doa": "Mendo'akan kedua orang tua,",
   "arab": "رَبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا,",
   "latin": "",
   "arti": "Wahai Tuhanku, sayangilah keduanya (kedua orang tuaku) sebagaimana mereka berdua telah mendidik aku pada waktu kecil.,",
   "cara": "",
   "utama": "",
   "sumber": "Al Isra' 24,"
 },
 {
   "no": 37,
   "doa": "Do'a mohon agar istri dan keturunannya baik/beriman serta bisa menjadi teladan,",
   "arab": "رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا,",
   "latin": "",
   "arti": "Wahai Tuhan kami, anugerahkanlah kepada kami pasangan kami dan keturunan kami sebagai orang yang menyenangkan pandangan (penyejuk hati kami), dan jadikanlah kami teladan bagi orang-orang yang bertakwa. ,",
   "cara": "",
   "utama": "",
   "sumber": "Al Fuqon 74,"
 },
 {
   "no": 38,
   "doa": "Do'a mohon agar istri dan keturunannya baik/beriman serta bisa menjadi teladan,",
   "arab": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِنْ ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاءَ ,",
   "latin": "",
   "arti": "Wahai Tuhanku, jadikanlah aku dan anak turunku orang-orang yang menegakkan sholat. Wahai Tuhan kami terimalah doa kami. ,",
   "cara": "",
   "utama": "",
   "sumber": "Ibrohim 40,"
 },
 {
   "no": 39,
   "doa": "Doa mohon keturunan yang sholih,",
   "arab": "رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ,",
   "latin": "",
   "arti": "Wahai Tuhanku, anugerahkan aku keturunan yang shalih. ,",
   "cara": "",
   "utama": "",
   "sumber": "As Shaffat 100,"
 },
 {
   "no": 40,
   "doa": "Doa mohon keturunan yang sholih,",
   "arab": "رَبِّ هَبْ لِي مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاءِ,",
   "latin": "",
   "arti": "Wahai Tuhanku, anugerahkan kepadaku dari sisiMu keturunan yang baik, sesungguhnya Engkau maha mendengar doa. ,",
   "cara": "",
   "utama": "",
   "sumber": "Al Imron 38,"
 },
 {
   "no": 41,
   "doa": "Doa mohon keturunan yang sholih,",
   "arab": "رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ,",
   "latin": "",
   "arti": "Wahai Tuhanku, janganlah Engkau membiarkan aku sendiri (tidak memiliki keturunan) dan Engkau sebaik-baiknya pewaris.,",
   "cara": "",
   "utama": "",
   "sumber": "Anbiya' 89,"
 },
 {
   "no": 42,
   "doa": "Do'a mohon tempat yang barokah,",
   "arab": "رَبِّ أَنزِلْنِي مُنزَلًا مُّبَارَكًا وَأَنتَ خَيْرُ الْمُنزِلِينَ,",
   "latin": "",
   "arti": "Wahai Tuhanku, tempatkanlah aku di tempat yang diberkahi dan Engkau sebaik-baiknya Dzat yang menempatkan.,",
   "cara": "",
   "utama": "",
   "sumber": "Al Mukminun 29,"
 },
 {
   "no": 43,
   "doa": "Do'a mohon diberi hati lapang, dimudahkan perkaranya dan dapat berbicara yang jelas,",
   "arab": "رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي يَفْقَهُوا قَوْلِي,",
   "latin": "",
   "arti": "Wahai Tuhanku, lapangkanlah dadaku (hatiku), mudahkanlah perkaraku dan lepaskanlah ikatan lisanku agar mereka bisa memahami ucapanku.,",
   "cara": "",
   "utama": "",
   "sumber": "Toha 25-28,"
 },
 {
   "no": 44,
   "doa": "Do'a perlindungan dari kejahatan dan godaan setan",
   "arab": "قُلْ هُوَ ٱللَّهُ أَحَدٌ ﴿١﴾<br> ٱللَّهُ ٱلصَّمَدُ ﴿٢﴾<br> لَمْ يَلِدْ وَلَمْ يُولَدْ ﴿٣﴾<Br> وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ ﴿٤﴾",
   "latin": "",
   "arti": "Katakan (wahai Muhammad): Dia adalah Alloh yang Maha Esa. Alloh tempat meminta segala sesuatu. Dia tidak beranak dan tidak diperanakkan. Dan tidak ada seorangpun yang menyamaiNya.",
   "cara": "",
   "utama": "",
   "sumber": "Al Ikhlas 1-4"
 },
 {
   "no": 45,
   "doa": "Do'a perlindungan dari kejahatan dan godaan setan",
   "arab": "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ  ﴿١﴾<br>  مِن شَرِّ مَا خَلَقَ  ﴿٢﴾<br>  وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ  ﴿٣﴾<br>  وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ  ﴿٤﴾<br>  وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ﴿٥﴾",
   "latin": "",
   "arti": "Katakan (wahai Muhammad): aku berlindung kepada Tuhan waktu subuh. Dari kejahatan setiap apa-apa yang Dia ciptakan. Dan dari kejahatan malam ketika telah gelap gulita, dan dari kejahatan (perempuan-perempuan) penyihir yang meniup pada buhul-buhul (talinya), dan dari kejahatan orang yang dengki ketika dia dengki.",
   "cara": "",
   "utama": "",
   "sumber": "Al Falq 1-5"
 },
 {
   "no": 46,
   "doa": "Do'a perlindungan dari kejahatan dan godaan setan",
   "arab": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ ﴿١﴾<br>  مَلِكِ النَّاسِ ﴿٢﴾<br>  إِلَٰهِ النَّاسِ مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ﴿٣﴾<br>  الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ﴿٤﴾<br>  مِنَ الْجِنَّةِ وَالنَّاسِ",
   "latin": "",
   "arti": "Katakan (wahai Muhammad): Aku berlindung kepada Tuhannya manusia, Raja manusia, Tuhannya manusia, dari kejahatan bisikan setan yang bersembunyi, setan yang membisikkan kejelekan di dalam dada (hati) manusia, dari jin dan manusia.",
   "cara": "",
   "utama": "",
   "sumber": "An Nas 1-6"
 },
 {
   "no": 47,
   "doa": "Do'a perlindungan dari kejahatan dan godaan setan",
   "arab": "\n\nرَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ . وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ",
   "latin": "",
   "arti": "Wahai Tuhanku, Aku berlindung kepadaMu dari bisikan setan-setan. Aku berlindung kepadaMu wahai Tuhanku agar mereka tidak datang padaku.",
   "cara": "",
   "utama": "",
   "sumber": "Al Mukminun 97-98"
 },
 {
   "no": 48,
   "doa": "Do'a perlindungan dari kehinaan pada hari kiamat",
   "arab": "وَلَا تُخْزِنِي يَوْمَ يُبْعَثُونَ يَوْمَ لَا يَنْفَعُ مَالٌ وَلَا بَنُونَ إِلَّا مَنْ أَتَى اللَّهَ بِقَلْبٍ سَلِيمٍ",
   "latin": "",
   "arti": "Dan jangan Engkau hinakan aku pada hari mereka dibangkitkan, pada hari ketika harta dan anak tidak bermanfaat (hari kiamat) kecuali orang yang datang kepada Allah dengan hati yang selamat. ",
   "cara": "",
   "utama": "",
   "sumber": "As Su'aro 87-89"
 },
 {
   "no": 49,
   "doa": "Do'a perlindungan dari kedengkian",
   "arab": "رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَحِيمٌ ",
   "latin": "",
   "arti": "Wahai Tuhan kami, ampunilah kami dan saudara-saudara kami yang telah beriman lebih dahulu dari kami, dan janganlah Engkau tanamkan kedengkian dalam hati kami terhadap orang-orang yang beriman. Wahai Tuhan kami, sesungguhnya Engkau Maha belas kasih lagi Maha Penyayang. ",
   "cara": "",
   "utama": "",
   "sumber": "Al Hasr 10"
 },
 {
   "no": 50,
   "doa": "Do'a perlindungan dari kedhaliman",
   "arab": "رَبِّ فَلَا تَجْعَلْنِي فِي الْقَوْمِ الظَّالِمِينَ",
   "latin": "",
   "arti": "Wahai Tuhanku, janganlah jadikan aku tergolong kaum yang berbuat kedhaliman.",
   "cara": "",
   "utama": "",
   "sumber": "Al Mukminun 94"
 },
 {
   "no": 51,
   "doa": "Do'a perlindungan dari kedhaliman",
   "arab": "رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ",
   "latin": "",
   "arti": "Wahai Tuhan kami, janganlah Engkau menjadikan kami bersama kaum yang dhalim.",
   "cara": "",
   "utama": "",
   "sumber": "Al A'raf 47"
 },
 {
   "no": 52,
   "doa": "Do'a perlindungan dari kedhaliman",
   "arab": "رَبِّ نَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ",
   "latin": "",
   "arti": "Wahai Tuhanku, selamatkanlah aku dari kaum yang dhalim.",
   "cara": "",
   "utama": "",
   "sumber": "Al Qosos 21"
 },
 {
   "no": 53,
   "doa": "Do'a perlindungan dari kedhaliman",
   "arab": "عَلَى اللَّهِ تَوَكَّلْنَا رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ. وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ",
   "latin": "",
   "arti": "Hanya kepada Alloh kami berserah diri. Wahai Tuhan kami, jangan jadikan kami sebagai fitnah bagi kaum yang dhalim. Dan dengan rohmatMu, selamatkanlah kami dari kaum kafir. ",
   "cara": "",
   "utama": "",
   "sumber": "Yunus 85-86"
 },
 {
   "no": 54,
   "doa": "Do’a mohon kekuasaan dan kemuliaan",
   "arab": "ٱللَّهُمَّ مَـٰلِكَ ٱلْمُلْكِ تُؤْتِى ٱلْمُلْكَ مَن تَشَآءُ وَتَنزِعُ ٱلْمُلْكَ مِمَّن تَشَآءُ وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُ ۖ بِيَدِكَ ٱلْخَيْرُ ۖ إِنَّكَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
   "latin": "",
   "arti": "Katakanlah (Muhammad), \"Wahai Tuhan pemilik kekuasaan, Engkau berikan kekuasaan kepada siapa pun yang Engkau kehendaki, dan Engkau cabut kekuasaan dari siapa pun yang Engkau kehendaki. Engkau memuliakan siapa pun yang Engkau kehendaki dan Engkau hinakan siapa pun yang Engkau kehendaki. Di tangan Engkaulah segala kebaikan. Sesungguhnya Engkau Maha kuasa atas segala sesuatu.",
   "cara": "",
   "utama": "",
   "sumber": " Ali Imran: 26"
 },
 {
   "no": 55,
   "doa": "Do’a mohon ilmu",
   "arab": "رَّبِّ زِدْنِى عِلْمًۭا ",
   "latin": "",
   "arti": "Wahai Tuhanku, tambahkan ilmu untukku.",
   "cara": "",
   "utama": "",
   "sumber": "Taha: 114"
 },
 {
   "no": 47,
   "doa": "Doa Bangun Tidur 1",
   "arab": "ٱلْحَمْدُ لِلَّهِ ٱلَّذِيٓ أَحْيَانَا بَعْدَ مَآ أَمَاتَنَا، وَإِلَيْهِ ٱلنُّشُورُ,",
   "latin": "Alhamdulillahilladzi ahyana bada ma amatana, wa ilaihin nushur.,",
   "arti": "Segala puji bagi Allah yang telah menghidupkan kami setelah kami mati, dan hanya kepada-Nya tempat kembali.,",
   "cara": "",
   "utama": "",
   "sumber": "HR Bukhari,"
 },
 {
   "no": 48,
   "doa": "Doa Bangun Tidur 2",
   "arab": "لَا إِلَٰهَ إِلَّا ٱللَّٰهُ، وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ ٱلْمُلْكُ، وَلَهُ ٱلْحَمْدُ، وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ، سُبْحَانَ اللهِ، وَالْحَمْدُ للهِ، وَلَا إِلَهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ، رَبِّ اغْفِرْ لِي,",
   "latin": "Laa ilaaha illallaahu, wahdahu laa syariikalahu, lahul mulku, walahul hamdu, wahuwa ‘ala kulli syaiin qodiir. Subhaanallaahi, walhamdulillaahi, wa laa ilaaha illallaahu, wallaahu akbar, wa laa hawla wa laa quwwata illaa billaahil ‘aliyyil ‘azhiim. Robbighfir lii.,",
   "arti": "Tiada Tuhan selain Allah, Yang Maha Esa, tiada sekutu bagi-Nya. Milik-Nya kerajaan, milik-Nya segala pujian, dan Dia Maha Kuasa atas segala sesuatu. Mahasuci Allah, segala puji bagi Allah, tiada Tuhan selain Allah, Allah Maha Besar. Tiada daya dan upaya kecuali dengan pertolongan Allah Yang Mahatinggi lagi Mahaagung. Ya Rabb, ampunilah aku.,",
   "cara": "",
   "utama": "Diampuni dosanya, <br> \njika berdoa dikabulkan, <br> \njika berwudhu kemudian shalat maka shalatnya diterima,",
   "sumber": "HR Bukhari,"
 },
 {
   "no": 49,
   "doa": "Doa Bangun Tidur 3",
   "arab": "اَلْحَمْدُ لِلّٰهِ الَّذِي عَافَانِي فِي جَسَدِي، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لِي بِذِكْرِهٖ.,",
   "latin": "Alhamdulillahil ladzi ‘aafani fii jasadi, wa radda ‘alayya ruuhi, wa adzina lii bi dzikrih.,",
   "arti": "",
   "cara": "Segala puji bagi Allah yang telah memberikan kesehatan pada tubuhku, mengembalikan ruhku kepadaku, dan mengizinkanku untuk mengingat-Nya.,",
   "utama": "",
   "sumber": "HR Tirmidzi,"
 },
 {
   "no": 50,
   "doa": "Doa Bangun Tidur 4",
   "arab": "إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ لَآيَاتٍ لِأُولِي الْأَلْبَابِ <br>\nالَّذِينَ يَذْكُرُونَ اللَّهَ قِيَامًا وَقُعُودًا وَعَلَى جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ َبَّنَا مَا خَلَقْتَ هَذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ رَبَّنَا<br>\nر إِنَّكَ مَنْ تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنْصَارٍ <br>\nرَبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا <br>\n فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ<br>\nرَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَى رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ<br>\nفَاسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّي لَا أُضِيعُ عَمَلَ عَامِلٍ مِنْكُمْ مِنْ ذَكَرٍ أَوْ أُنْثَى بَعْضُكُمْ مِنْ بَعْضٍ<br>\nفَالَّذِينَ هَاجَرُوا وَأُخْرِجُوا مِنْ دِيَارِهِمْ وَأُوذُوا فِي سَبِيلِي وَقَاتَلُوا وَقُتِلُوا لَأُكَفِّرَنَّ عَنْهُمْ سَيِّئَاتِهِمْ وَلَأُدْخِلَنَّهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ثَوَابًا مِنْ عِنْدِ اللَّهِ وَاللَّهُ عِنْدَهُ حُسْنُ الثَّوَابِ<br>\nلَا يَغُرَّنَّكَ تَقَلُّبُ الَّذِينَ كَفَرُوا فِي الْبِلَادِ<br>\nمَتَاعٌ قَلِيلٌ ثُمَّ مَأْوَاهُمْ جَهَنَّمُ وَبِئْسَ الْمِهَادُ<br>\nلَكِنِ الَّذِينَ اتَّقَوْا رَبَّهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا نُزُلًا مِنْ عِنْدِ اللَّهِ وَمَا عِنْدَ اللَّهِ خَيْرٌ لِلْأَبْرَارِ<br>\nوَإِنَّ مِنْ أَهْلِ الْكِتَابِ لَمَنْ يُؤْمِنُ بِاللَّهِ وَمَا أُنْزِلَ إِلَيْكُمْ وَمَا أُنْزِلَ إِلَيْهِمْ خَاشِعِينَ لِلَّهِ لَا يَشْتَرُونَ بِآيَاتِ اللَّهِ ثَمَنًا قَلِيلًا أُولَئِكَ لَهُمْ أَجْرُهُمْ عِنْدَ رَبِّهِمْ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ<br>\nيَا أَيُّهَا الَّذِينَ آمَنُوا اصْبِرُوا وَصَابِرُوا وَرَابِطُوا وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ,",
   "latin": "Inna fii khalqis samaawaati wal ardhi wakhtilaafil layli wan nahaari la-aayaatil li-ulil albaab. Alladziina yadzkuruunalloha qiyaaman wa qu'uudan wa 'ala junuubihim wa yatafakkaruun fii khalqis samaawaati wal ardh, rabbanaa maa khalaqta hadzaa baathilan subhaanaka faqinaa 'adzaaban naar. Rabbanaa innaka man tudkhilin naara faqad akhzaitahu wa maa lizh zaalimiina min anshaar. Rabbanaa innanaa sami'naa munaadiyan yunaadii lil iimaani an aaminuu birabbikum fa aamannaa, faghfir lanaa dzunuubanaa wa kaffir 'annaa sayyi aatinaa wa tawaffanaa ma'al abraar. Rabbanaa wa aatinaa maa wa'adtanaa 'ala rusulika wa laa tukhzinaa yaumal qiyaamah innaka laa tukhliful mii'aad. Fastajaaba lahum rabbuhum anni laa udhi'u 'amala 'aamilin minkum min dzakarin aw untsaa ba'dhukum min ba'dh. Falladziina haajaruu wa ukhrijuu min diyaarihim wa uuudzuu fii sabiili wa qaataluu wa qutiluu la-ukaffiranna 'anhum sayyi aatihim wa la-udkhilannahum jannaatin tajrii min tahtihal anhaar tsawaaban min 'indillah wallahu 'indahu husnut tsawaab. Laa yaghurrannaka taqalluballadziina kafaruu fil bilaad. Mataa'un qaliilun tsumma ma'waahum jahannamu wa bisal mihaad. Laakinnalladziinat taqau rabbahum lahum jannaatun tajrii min tahtihal anhaar khaalidiina fiihaa nuzulan min 'indillah, wa maa 'indallahi khairul lil abraar. Wa inna min ahlil kitaabi lamay yuminu billaahi wa maa unzila ilaykum wa maa unzila ilayhim khaa syiiina lillaah, laa yasytaruuna bi-ayaati allaahi tsamanan qaliilaa ulaa ika lahum ajruhum 'inda rabbihim innallaha syari'ul hisaab. Yaa ayyuhalladziina aamanuu isbiruu wa shaabiruu wa raabithuu wattaqullaaha la'allakum tuflihuun.,",
   "arti": "Sesungguhnya pada penciptaan langit dan bumi, serta pergantian malam dan siang, terdapat tanda-tanda bagi orang-orang yang berakal. (Yaitu) orang-orang yang mengingat Allah sambil berdiri, duduk, atau berbaring, dan mereka memikirkan tentang penciptaan langit dan bumi (seraya berkata): 'Ya Tuhan kami, tiadalah Engkau menciptakan ini dengan sia-sia; Mahasuci Engkau, maka peliharalah kami dari azab neraka. Ya Tuhan kami, sesungguhnya siapa yang Engkau masukkan ke dalam neraka, maka sungguh Engkau telah menghinakannya, dan tidak ada bagi orang-orang yang zalim seorang penolong pun. Ya Tuhan kami, sesungguhnya kami mendengar seruan orang yang menyeru kepada iman, (yaitu): Berimanlah kamu kepada Tuhanmu'; maka kami pun beriman. Ya Tuhan kami, ampunilah dosa-dosa kami, hapuskanlah kesalahan-kesalahan kami, dan wafatkanlah kami beserta orang-orang yang saleh. Ya Tuhan kami, berikanlah kepada kami apa yang telah Engkau janjikan melalui rasul-rasul-Mu. Janganlah Engkau hinakan kami pada hari Kiamat. Sungguh, Engkau tidak menyalahi janji.' Maka Tuhan mereka memperkenankan permohonan mereka, (dengan berfirman): 'Sesungguhnya Aku tidak akan menyia-nyiakan amal orang yang beramal di antara kamu, baik laki-laki maupun perempuan, (karena) sebagian kamu adalah turunan dari sebagian yang lain. Maka orang-orang yang berhijrah, yang diusir dari kampung halamannya, yang disakiti pada jalan-Ku, yang berperang dan yang terbunuh, pasti akan Aku hapuskan kesalahan-kesalahan mereka, dan pasti akan Aku masukkan ke dalam surga-surga yang mengalir di bawahnya sungai-sungai, sebagai pahala dari Allah. Dan di sisi Allah ada pahala yang baik.' Janganlah sekali-kali kamu terpedaya oleh kebebasan orang-orang kafir bergerak di dalam negeri. Itu hanyalah kesenangan sementara, kemudian tempat tinggal mereka adalah neraka Jahanam; dan itu seburuk-buruk tempat tinggal. Tetapi orang-orang yang bertakwa kepada Tuhannya, mereka mendapat surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya sebagai tempat tinggal dari sisi Allah. Dan apa yang di sisi Allah lebih baik bagi orang-orang yang berbakti. Dan sungguh, di antara Ahli Kitab itu ada yang beriman kepada Allah dan kepada apa yang diturunkan kepadamu dan kepada apa yang diturunkan kepada mereka, sedang mereka berendah hati kepada Allah, mereka tidak menukarkan ayat-ayat Allah dengan harga yang sedikit. Mereka memperoleh pahala di sisi Tuhan mereka. Sungguh, Allah sangat cepat perhitungan-Nya. Wahai orang-orang yang beriman! Bersabarlah kamu dan kuatkanlah kesabaranmu, dan tetaplah bersiap siaga (di perbatasan negerimu), dan bertakwalah kepada Allah agar kamu beruntung.,",
   "cara": "",
   "utama": "",
   "sumber": "Ali Imron 190-200,"
 },
 {
   "no": 51,
   "doa": "Doa Bangun Tidur 4",
   "arab": "",
   "latin": "",
   "arti": ",",
   "cara": ",",
   "utama": ",",
   "sumber": ","
 },
 {
   "no": 52,
   "doa": "Doa dalam Alquran Al Baqoroh 1-5",
   "arab": "الٓمٓ 1) ذَٰلِكَ الْكِتَابُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًى لِلْمُتَّقِينَ2) الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ3) وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنْزِلَ إِلَيْكَ وَمَا أُنْزِلَ مِنْ قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ4) أُولَٰئِكَ عَلَىٰ هُدًى مِنْ رَبِّهِمْ ۖ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ 5)۔,",
   "latin": "Alif Lam Mim, dzalikal kitabu laa raiba fiihi hudan lilmuttaqiin, alladziina yuminuuna bilghaibi wa yuqimuunash shalaata wa mimmaa razaqnaahum yunfiquun, walladziina yuminuuna bimaa unzila ilaika wa maa unzila min qablika wa bil-aakhirati hum yuuqinuun, ulaaika ‘ala hudam mir rabbihim wa ulaaika humul muflihuun.,",
   "arti": "Alif Lam Mim. Kitab (Al-Quran) ini tidak ada keraguan padanya; petunjuk bagi orang-orang yang bertakwa (1). <br> Yaitu mereka yang beriman kepada yang gaib, melaksanakan salat, dan menginfakkan sebagian rezeki yang Kami berikan kepada mereka (2). <br> Dan mereka yang beriman kepada (Al-Qur'an) yang diturunkan kepadamu dan kitab-kitab yang diturunkan sebelum engkau, serta yakin akan adanya akhirat (3). <br> Mereka itulah yang tetap mendapat petunjuk dari Tuhan mereka, dan mereka itulah orang-orang yang beruntung (4).,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Baqoroh 1-5,"
 },
 {
   "no": 53,
   "doa": "Doa dalam Alquran  Al Baqoroh 255-257",
   "arab": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ 255) لَا إِكْرَاهَ فِي الدِّينِ ۖ قَدْ تَبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ ۚ فَمَنْ يَكْفُرْ بِالطَّاغُوتِ وَيُؤْمِنْ بِاللَّهِ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَىٰ لَا انْفِصَامَ لَهَا ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ 256) اللَّهُ وَلِيُّ الَّذِينَ آمَنُوا يُخْرِجُهُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ ۖ وَالَّذِينَ كَفَرُوا أَوْلِيَاؤُهُمُ الطَّاغُوتُ يُخْرِجُونَهُمْ مِنَ النُّورِ إِلَى الظُّلُمَاتِ ۗ أُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ 257)۔,",
   "latin": "Allahu laa ilaaha illa huwal hayyul qayyuum, laa takhudzuhu sinatuw wa laa nawm, lahu maa fis samaawaati wa maa fil ardh, man dzalladzii yashfau ‘indahu illa bi-idznih, yalamu maa baina aidiihim wa maa khalfahum, wa laa yuhiithuuna bisyaiim min ‘ilmihi illa bimaa shaa, wasia kursiyyuhus samaawaati wal ardh, wa laa yauduhu hifzuhumaa wa huwal ‘aliyyul ‘azhiim; laa ikraaha fid diin, qad tabayyanar rusydu minal ghayy, fa man yakfur bithaaghuuti wa yumin billaahi faqadis tamsaka bil ‘urwatil wutsqaa lanfishaama lahaa, wallahu samiiun ‘aliim; Allahu waliyyulladziina aamanuu, yukhrijuhum minazh zhulumati ilan nuur, walladziina kafaruu awliyaauhumuth thaaghuut, yukhrijuunahum minan nuuri ilazh zhulumaat, ulaaika ashaabun naari hum fiihaa khaaliduun.",
   "arti": "Allah, tidak ada Tuhan (yang berhak disembah) selain Dia Yang Mahahidup, Yang terus-menerus mengurus (makhluk-Nya). Dia tidak mengantuk dan tidak tidur. Milik-Nya apa yang ada di langit dan apa yang ada di bumi. Tidak ada yang dapat memberi syafaat di sisi-Nya tanpa izin-Nya. Dia mengetahui apa yang di hadapan mereka dan apa yang di belakang mereka, dan mereka tidak mengetahui apa pun dari ilmu-Nya selain apa yang Dia kehendaki. Kursi-Nya meliputi langit dan bumi. Dia tidak merasa berat memelihara keduanya. Dan Dia Maha Tinggi, Maha Besar (255). <br> Tidak ada paksaan dalam (menganut) agama. Sungguh, telah jelas jalan yang benar dari jalan yang sesat. Barang siapa ingkar kepada tagut dan beriman kepada Allah, maka sungguh, dia telah berpegang pada tali yang sangat kuat yang tidak akan putus. Allah Maha Mendengar, Maha Mengetahui (256). <br> Allah adalah Pelindung orang-orang yang beriman; Dia mengeluarkan mereka dari kegelapan menuju cahaya. Adapun orang-orang yang kafir, pelindung-pelindung mereka adalah tagut, yang mengeluarkan mereka dari cahaya menuju kegelapan. Mereka itu penghuni neraka; mereka kekal di dalamnya (257).,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Baqoroh 255-257,"
 },
 {
   "no": 54,
   "doa": "Doa dalam Alquran  Al Baqoroh 284-286",
   "arab": "لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَإِنْ تُبْدُوا مَا فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُمْ بِهِ اللَّهُ ۖ فَيَغْفِرُ لِمَنْ يَشَاءُ وَيُعَذِّبُ مَنْ يَشَاءُ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ 284) آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ 285) لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ 286)۔,",
   "latin": "Lillahi maa fis samaawaati wa maa fil ardh, wa in tubduu maa fii anfusikum aw tukhfuuhu yuhaasibkum bihillah, fayaghfiru liman yashaau wa yuadzibu man yashaa, wallahu ‘ala kulli shayin qadiir; aamanar rasuulu bimaa unzila ilaihi mir rabbihi wal muminuun, kullun aamana billaahi wa malaaikatihi wa kutubihi wa rusulih, laa nufarriqu baina ahadin mir rusulih, wa qaaluu saminaa wa athanaa, ghufraanaka rabbanaa wa ilaikal mashiir; laa yukallifullahu nafsan illa wusahaa, lahaa maa kasabat wa ‘alaihaa maaktasabat, rabbanaa laa tuaakhidznaa in nasiinaa aw akhthanaa, rabbanaa wa laa tahmil ‘alainaa isran kamaa hamaltahu ‘alal ladziina min qablinaa, rabbanaa wa laa tuhammilnaa maa laa thaaqata lanaa bih, wafu ‘annaa waghfir lanaa warhamnaa, anta maulaanaa fansurnaa ‘alal qawmil kaafiriin.,",
   "arti": "Milik Allah-lah segala apa yang ada di langit dan apa yang ada di bumi. Jika kamu memperlihatkan apa yang ada dalam hatimu atau menyembunyikannya, Allah akan memperhitungkannya. Lalu, Dia mengampuni siapa yang Dia kehendaki dan menyiksa siapa yang Dia kehendaki. Allah Mahakuasa atas segala sesuatu (284). <br> Rasul telah beriman kepada apa yang diturunkan kepadanya dari Tuhannya, begitu pula orang-orang yang beriman. Mereka semua beriman kepada Allah, malaikat-malaikat-Nya, kitab-kitab-Nya, dan rasul-rasul-Nya. (Mereka berkata,) \\Kami tidak membeda-bedakan seorang pun dari rasul-rasul-Nya.\\ Mereka berkata, \\Kami mendengar dan kami taat. Ampunilah kami, ya Tuhan kami. Kepada-Mu lah tempat kembali\\ (285). <br> Allah tidak membebani seseorang melainkan sesuai dengan kesanggupannya. Ia mendapat (pahala) dari kebajikan yang dikerjakannya, dan ia mendapat (siksa) dari kejahatan yang diperbuatnya. (Mereka berdoa,) \\Ya Tuhan kami, janganlah Engkau hukum kami jika kami lupa atau kami bersalah. Ya Tuhan kami, janganlah Engkau bebankan kepada kami beban yang berat sebagaimana Engkau bebankan kepada orang-orang sebelum kami. Ya Tuhan kami, janganlah Engkau pikulkan kepada kami apa yang tidak sanggup kami memikulnya. Maafkanlah kami, ampunilah kami, dan rahmatilah kami. Engkaulah pelindung kami, maka tolonglah kami menghadapi orang-orang kafir\\ (286).",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Baqoroh 284-286,"
 },
 {
   "no": 55,
   "doa": "Doa dalam Alquran  Al Baqoroh 127",
   "arab": "۔... رَبَّنَا تَقَبَّلۡ مِنَّآ‌ۖ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلۡعَلِيمُ,",
   "latin": "Rabbana taqabbal minna innaka anta as-sami'u al-‘alim.,",
   "arti": "Ya Tuhan kami terimalah daripada kami amalan kami), sesungguhnya Engkaulah Yang Maha Mendengar lagi Maha Mengetahui,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Baqoroh 127,"
 },
 {
   "no": 56,
   "doa": "Doa dalam Alquran  Al Baqoroh 201",
   "arab": "۔... رَبَّنَآ ءَاتِنَا فِى ٱلدُّنۡيَا حَسَنَةً۬ وَفِى ٱلۡأَخِرَةِ حَسَنَةً۬ وَقِنَا عَذَابَ ٱلنَّارِ,",
   "latin": "Rabbana atina fi ad-dunya hasanatan wa fi al-akhirati hasanatan wa qina adhab an-nar.,",
   "arti": "Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat dan peliharalah kami dari siksa neraka,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Baqoroh 201,"
 },
 {
   "no": 57,
   "doa": "Doa dalam Alquran  Ali Imron 16",
   "arab": "۔... رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ,",
   "latin": "Rabbana innana amanna faghfir lana dhunubana wa qina adhab an-nar.,",
   "arti": "... Ya Tuhan kami, sesungguhnya kami telah beriman, maka ampunilah segala dosa kami dan peliharalah kami dari siksa neraka,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Ali Imron 16,"
 },
 {
   "no": 58,
   "doa": "Doa dalam Alquran  Ali Imron 8-9",
   "arab": "رَبَّنَا لَا تُزِغۡ قُلُوبَنَا بَعۡدَ إِذۡ هَدَيۡتَنَا وَهَبۡ لَنَا مِن لَّدُنكَ رَحۡمَةً‌ۚ إِنَّكَ أَنتَ ٱلۡوَهَّابُ ٨) رَبَّنَآ إِنَّكَ جَامِعُ ٱلنَّاسِ لِيَوۡمٍ۬ لَّا رَيۡبَ فِيهِ‌ۚ إِنَّ ٱللَّهَ لَا يُخۡلِفُ ٱلۡمِيعَادَ ٩)۔,",
   "latin": "Rabbana la tuzig qulubana ba'da idh hadaytana wahab lana min ladunka rahmatan innaka anta al-wahhab. Rabbana innaka jami'u an-nasi liyawmin la rayba fihi, innallaha la yukhlifu al-mi'ad.,",
   "arti": "8) Ya Tuhan kami, janganlah Engkau jadikan hati kami condong kepada kesesatan sesudah Engkau beri petunjuk kepada kami, dan karuniakanlah kepada kami rahmat dari sisi Engkau; karena sesungguhnya Engkau-lah Maha Pemberi karunia) <br> 9) Ya Tuhan kami, sesungguhnya Engkau mengumpulkan manusia untuk menerima pembalasan pada) hari yang tak ada keraguan padanya. Sesungguhnya Allah tidak menyalahi janji,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Ali Imron 8-9,"
 },
 {
   "no": 59,
   "doa": "Doa dalam Alquran  Ali Imron 53",
   "arab": "رَبَّنَآ ءَامَنَّا بِمَآ أَنزَلۡتَ وَٱتَّبَعۡنَا ٱلرَّسُولَ فَٱڪۡتُبۡنَا مَعَ ٱلشَّـٰهِدِينَ,",
   "latin": "Rabbana amanna bima anzalta wa ittaba'na ar-rasula fuktubna ma'a ash-shahideen.,",
   "arti": "Ya Tuhan kami, kami telah beriman kepada apa yang telah Engkau turunkan dan telah kami ikuti rasul, karena itu masukanlah kami ke dalam golongan orang-orang yang menjadi saksi tentang keesaan Allah,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Ali Imron 53,"
 },
 {
   "no": 60,
   "doa": "Doa dalam Alquran  Ali Imron 191-194",
   "arab": "۔... رَبَّنَا مَا خَلَقۡتَ هَـٰذَا بَـٰطِلاً۬ سُبۡحَـٰنَكَ فَقِنَا عَذَابَ ٱلنَّارِ ١٩١) رَبَّنَآ إِنَّكَ مَن تُدۡخِلِ ٱلنَّارَ فَقَدۡ أَخۡزَيۡتَهُ ۥ‌ۖ وَمَا لِلظَّـٰلِمِينَ مِنۡ أَنصَارٍ۬ ١٩٢) رَّبَّنَآ إِنَّنَا سَمِعۡنَا مُنَادِيً۬ا يُنَادِى لِلۡإِيمَـٰنِ أَنۡ ءَامِنُواْ بِرَبِّكُمۡ فَـَٔامَنَّا‌ۚ رَبَّنَا فَٱغۡفِرۡ لَنَا ذُنُوبَنَا وَڪَفِّرۡ عَنَّا سَيِّـَٔاتِنَا وَتَوَفَّنَا مَعَ ٱلۡأَبۡرَارِ ١٩٣) رَبَّنَا وَءَاتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخۡزِنَا يَوۡمَ ٱلۡقِيَـٰمَةِ‌ۗ إِنَّكَ لَا تُخۡلِفُ ٱلۡمِيعَادَ ١٩٤)۔,",
   "latin": "Rabbana ma khalaqta haza batilan subhanaka faqina adhab an-nar. Rabbana innaka man tudkhil an-nara faqad akhzaytahu wama lil-zalimina min ansar. Rabbana innana sami'na munadiyan yunadi lil-imani an aminu birabbikum fa amanna. Rabbana faghfir lana dhunubana wakkafir 'anna sayyi'atina watawwafana ma'a al-abrar. Rabbana wa atina ma wa'adtana 'ala rusulika wa la tukhzina yawma al-qiyama innaka la tukhlifu al-mi'ad.,",
   "arti": "191) ... Ya Tuhan kami, tiadalah Engkau menciptakan ini dengan sia-sia, Maha Suci Engkau, maka peliharalah kami dari siksa neraka <br> 192) Ya Tuhan kami, sesungguhnya barangsiapa yang Engkau masukkan ke dalam neraka, maka sungguh telah Engkau hinakan ia, dan tidak ada bagi orang-orang yang zalim seorang penolongpun <br> 193) Ya Tuhan kami, sesungguhnya kami mendengar seruan) yang menyeru kepada iman, yaitu): Berimanlah kamu kepada Tuhanmu, maka kamipun beriman. Ya Tuhan kami, ampunilah bagi kami dosa-dosa kami dan hapuskanlah dari kami kesalahan-kesalahan kami, dan wafatkanlah kami beserta orang-orang yang banyak berbakti <br> 194) Ya Tuhan kami, berilah kami apa yang telah Engkau janjikan kepada kami dengan perantaraan rasul-rasul Engkau. Dan janganlah Engkau hinakan kami di hari kiamat. Sesungguhnya Engkau tidak menyalahi janji,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Ali Imron 191-194,"
 },
 {
   "no": 61,
   "doa": "Doa dalam Alquran  Al Maidah 83",
   "arab": "۔... رَبَّنَا آمَنَّا فَاكْتُبْنَا مَعَ الشَّاهِدِينَ,",
   "latin": "Rabbana amanna fakutubna ma'a ash-shahideen.,",
   "arti": "... Ya Tuhan kami, kami telah beriman, maka catatlah kami bersama orang-orang yang menjadi saksi atas kebenaran Al Quran dan kenabian Muhammad s.a.w.),",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Maidah 83,"
 },
 {
   "no": 62,
   "doa": "Doa dalam Alquran  Al A'rof 47",
   "arab": "۔... رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ,",
   "latin": "Rabbana la taj'alna ma'a al-qawmi az-zalimeen.,",
   "arti": "... Ya Tuhan kami, janganlah Engkau tempatkan kami bersama-sama orang-orang yang zalim itu,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al A'rof 47,"
 },
 {
   "no": 63,
   "doa": "Doa dalam Alquran  At Taubah 129",
   "arab": "۔... حَسۡبِىَ ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ‌ۖ عَلَيۡهِ تَوَڪَّلۡتُ‌ۖ وَهُوَ رَبُّ ٱلۡعَرۡشِ ٱلۡعَظِيمِ,",
   "latin": "Hasbiyallahu la ilaha illa Huwa, 'alayhi tawakkaltu, wa huwa rabbul-'arshil-‘azim.,",
   "arti": "Cukuplah Allah bagiku; tidak ada Tuhan selain Dia. Hanya kepada-Nya aku bertawakkal dan Dia adalah Tuhan yang memiliki Arsy yang agung,",
   "cara": "Dibaca 7X pagi dan sore hari,",
   "utama": "dibaca sungguh-sungguh atau tidak, Alloh akan mencukupi kesulitannya/cita-citanya yang tidak tercapai,",
   "sumber": "At Taubah 129,"
 },
 {
   "no": 64,
   "doa": "Doa dalam Alquran  Yunus 85 86",
   "arab": "۔... رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِلْقَوْمِ الظَّالِمِينَ 85) وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ 86)۔,",
   "latin": "Rabbana la taj'alna fitnatan lilqawmi az-zalimeen. Wajinna birahmatika mina al-qawmi al-kafireen.,",
   "arti": "85. ... Ya Tuhan kami; janganlah Engkau jadikan kami sasaran fitnah bagi kaum yang´zalim <br> 86. dan selamatkanlah kami dengan rahmat Engkau dari tipu daya) orang-orang yang kafir,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Yunus 85, 86,"
 },
 {
   "no": 65,
   "doa": "Doa dalam Alquran  Hud 47",
   "arab": "۔... رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ ۖ وَإِلَّا تَغْفِرْ لِي وَتَرْحَمْنِي أَكُنْ مِنَ الْخَاسِرِينَ,",
   "latin": "Rabbi inni a'udhu bika an as'alaka ma laysa li bihi 'ilm, wa illa taghfir li watarhamni akun mina al-khasireen.,",
   "arti": "... Ya Tuhanku, sesungguhnya aku berlindung kepada Engkau dari memohon kepada Engkau sesuatu yang aku tiada mengetahui hakekat)nya. Dan sekiranya Engkau tidak memberi ampun kepadaku, dan tidak) menaruh belas kasihan kepadaku, niscaya aku akan termasuk orang-orang yang merugi,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Hud 47,"
 },
 {
   "no": 66,
   "doa": "Doa dalam Alquran  Al Israa 80",
   "arab": "۔... رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا,",
   "latin": "Rabbi adkhilni mudkhala sidqin wa akhrijni mukhraja sidqin wa ajil li min ladunka sultanan nasira.,",
   "arti": "… Ya Tuhanku, masukkanlah aku dengan cara yang baik dan keluarkanlah aku dengan cara yang baik dan berikanlah kepadaku dari sisi Engkau kekuasaan yang menolong.,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Israa 80,"
 },
 {
   "no": 67,
   "doa": "Doa dalam Alquran  Al Kahfi 10 Doa ashabul kahfi)",
   "arab": "۔... رَبَّنَا آتِنَا مِنْ لَدُنْكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا,",
   "latin": "Rabbana atina min ladunka rahmatan wa hayyi' lana min amrina rashadan.,",
   "arti": "... Wahai Tuhan kami, berikanlah rahmat kepada kami dari sisi-Mu dan sempurnakanlah bagi kami petunjuk yang lurus dalam urusan kami ini),",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Kahfi 10,"
 },
 {
   "no": 68,
   "doa": "Doa dalam Alquran  Al Mu'minun 94",
   "arab": "رَبِّ فَلَا تَجْعَلْنِي فِي الْقَوْمِ الظَّالِمِينَ,",
   "latin": "Rabbi fala taj'alni fi al-qawmi az-zalimeen.,",
   "arti": "ya Tuhanku, maka janganlah Engkau jadikan aku berada di antara orang-orang yang zalim,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Mu'minun 94,"
 },
 {
   "no": 69,
   "doa": "Doa dalam Alquran  Al Mu'minun 97 98",
   "arab": "۔... رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ 97) وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ 98)۔,",
   "latin": "Rabbi a'udhu bika min hamazati ash-shayateen, wa a'udhu bika rabbi an yahduroon.,",
   "arti": "97. ... Ya Tuhanku aku berlindung kepada Engkau dari bisikan-bisikan syaitan <br> 98. Dan aku berlindung pula) kepada Engkau ya Tuhanku, dari kedatangan mereka kepadaku,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Mu'minun 97, 98,"
 },
 {
   "no": 70,
   "doa": "Doa dalam Alquran  Al Mu'minun 118",
   "arab": "۔... رَبِّ اغْفِرْ وَارْحَمْ وَأَنْتَ خَيْرُ الرَّاحِمِينَ,",
   "latin": "Rabbi ghfir warham wa anta khayrur rahimeen.,",
   "arti": "... Ya Tuhanku berilah ampun dan berilah rahmat, dan Engkau adalah Pemberi rahmat Yang Paling baik,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Mu'minun 118,"
 },
 {
   "no": 71,
   "doa": "Doa dalam Alquran  Al Mu'minun 109",
   "arab": "۔... رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الرَّاحِمِينَ,",
   "latin": "Rabbana amanna faghfir lana warhamna wa anta khayrur rahimeen.,",
   "arti": "... Ya Tuhan kami, kami telah beriman, maka ampunilah kami dan berilah kami rahmat dan Engkau adalah Pemberi rahmat Yang Paling Baik,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Mu'minun 109,"
 },
 {
   "no": 72,
   "doa": "Doa dalam Alquran  Al Furqon 6566",
   "arab": "۔... رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ ۖ إِنَّ عَذَابَهَا كَانَ غَرَامًا 65) إِنَّهَا سَاءَتْ مُسْتَقَرًّا وَمُقَامًا 66)۔,",
   "latin": "Rabbana isrif 'anna adhab jahannama, inna adhabaha kana gharaman. Innaha sa'at mustaqarran wa ma'aman.,",
   "arti": "65. ... Ya Tuhan kami, jauhkan azab jahannam dari kami, sesungguhnya azabnya itu adalah kebinasaan yang kekal <br> 66. Sesungguhnya jahannam itu seburuk-buruk tempat menetap dan tempat kediaman.,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Furqon 65,66,"
 },
 {
   "no": 73,
   "doa": "Doa dalam Alquran  Al Furqon 74",
   "arab": "۔... رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا,",
   "latin": "Rabbana hab lana min azwajina wa dhurriyatina qurrata a'yunin wa ajilna lil-muttaqeena imaman.,",
   "arti": "... Ya Tuhan kami, anugrahkanlah kepada kami isteri-isteri kami dan keturunan kami sebagai penyenang hati kami), dan jadikanlah kami imam bagi orang-orang yang bertakwa,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Furqon 74,"
 },
 {
   "no": 74,
   "doa": "Doa dalam Alquran  Al Ahkof 15",
   "arab": "۔... رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي ۖ إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ,",
   "latin": "Rabbi awzi'ni an ashkura ni'mataka allati an'amta 'alayya wa 'ala walidayya wa an a'mala salihan tardahu wa aslih li fi dhurriyyati, inni tubtu ilayka wa inni mina al-muslimeen.,",
   "arti": "... Ya Tuhanku, tunjukilah aku untuk mensyukuri nikmat Engkau yang telah Engkau berikan kepadaku dan kepada ibu bapakku dan supaya aku dapat berbuat amal yang saleh yang Engkau ridhai; berilah kebaikan kepadaku dengan memberi kebaikan) kepada anak cucuku. Sesungguhnya aku bertaubat kepada Engkau dan sesungguhnya aku termasuk orang-orang yang berserah diri,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Ahkof 15,"
 },
 {
   "no": 75,
   "doa": "Doa dalam Alquran  At Tahrim 8",
   "arab": "۔... رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا ۖ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ,",
   "latin": "Rabbana atimm lana noorana waghfir lana, innaka 'ala kulli shay'in qadeer.,",
   "arti": "... Ya Rabb kami, sempurnakanlah bagi kami cahaya kami dan ampunilah kami; Sesungguhnya Engkau Maha Kuasa atas segala sesuatu,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "At Tahrim 8,"
 },
 {
   "no": 76,
   "doa": "Doa dalam Alquran  Nuh 28",
   "arab": "رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا,",
   "latin": "Rabbi ghfir li waliwalidayya wliman dakhal bayti muminan walilmuminina walmuminati wa la tazidi az-zalimeena illa tabaran.,",
   "arti": "Ya Tuhanku! Ampunilah aku, ibu bapakku, orang yang masuk ke rumahku dengan beriman dan semua orang yang beriman laki-laki dan perempuan. Dan janganlah Engkau tambahkan bagi orang-orang yang zalim itu selain kebinasaan,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Nuh 28,"
 },
 {
   "no": 77,
   "doa": "Doa dalam Alquran Al Falaq Surat Penjagaan)",
   "arab": "قُل أَعُوذُ بِرَبِّ لفَلَقِ ﻿١﻿) مِن شَرِّ مَا خَلَقَ ﻿٢﻿) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ﻿٣﻿) وَمِن شَرِّ النَّفَّـٰثَـٰتِ فِى العُقَدِ ﻿٤﻿) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ﻿٥﻿),",
   "latin": "Qul a'udhu birabbil-falaq, min sharri ma khalaq, wa min sharri ghasiqin idha waqab, wa min sharri an-naffathati fi al-'uqad, wa min sharri hasidin idha hasad.,",
   "arti": ",",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Falaq,"
 },
 {
   "no": 78,
   "doa": "Doa dalam Alquran  An Nas Surat Penjagaan)",
   "arab": "قُل أَعُوذُ بِرَبِّ النَّاسِ ﻿١﻿) مَلِكِ النَّاسِ ﻿٢﻿) إِلَـٰهِ النَّاسِ ﻿٣﻿) مِن شَرِّ الوَسوَاسِ الخَنَّاسِ ﻿٤﻿) الَّذِى يُوَسوِسُ فِى صُدُورِ النَّاسِ ﻿٥﻿) مِنَ الجِنَّةِ وَٱلنَّاسِ ﻿٦﻿),",
   "latin": "Qul a'udhu birabbin-nas, malikin-nas, ilahin-nas, min sharri al-waswasi al-khannas, alladhi yuwaswisu fi sudurin-nas, mina al-jinnati wa an-nas.,",
   "arti": ",",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "An Nas,"
 },
 {
   "no": 79,
   "doa": "Bacaan Harian",
   "arab": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ,",
   "latin": "laa ilaaha illallahu wahdahuu laa syariika lahuu, lahul mulku wa lahul hamdu wa huwa 'alaa kulli syai'in qadir,",
   "arti": "Tidak ada ilah yang berhaq disembah) selain Allah Yang Maha Tunggal tidak ada sekutu bagi-Nya. Milik-Nya kerajaan dan bagi-Nya segala puji dan Dia Maha Kuasa atas segala sesuatu,",
   "cara": "dibaca 100X dalam sehari,",
   "utama": "pahala seperti membebaskan sepuluh orang budak, ditetapkan baginya seratus hasanah kebaikan) dan dijauhkan darinya seratus keburukan dan baginya ada perlindungan dari godaan) setan pada hari itu hingga petang dan tidak ada orang yang lebih baik amalnya dari orang yang membaca doa ini kecuali seseorang yang mengamalkan lebih banyak dari itu,",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 80,
   "doa": "Bacaan Harian 2",
   "arab": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ,",
   "latin": "Subhanallah wabihamdihi,",
   "arti": "Maha suci Allah dan segala pujian hanya untuk-Nya,",
   "cara": "dibaca 100X dalam sehari,",
   "utama": "kesalahan-kesalahannya akan terampuni walaupun sebanyak buih di lautan,",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 81,
   "doa": "Doa Pagi Sore",
   "arab": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ,",
   "latin": "BISMILLAAHILLADZII LAA YADHURRU MA'AS MIHI SYAI UN FIL ARDHI WA LAA FIS SAMAAI WA HUWAS SAMII'UL 'ALIIM,",
   "arti": "Dengan menyebutkan nama Allah yang tidak ada sesuatupun dengan menyebut namaNya yang membahayakan di bumi maupun di langit, dan Dia Maha Mendengar lagi Maha mengetahui,",
   "cara": "Pagi Hari 3X dan Sore Hari 3X,",
   "utama": "Tidak akan diganggu oleh sesuatupun,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 82,
   "doa": "Doa Pagi Sore 2",
   "arab": "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ وَأَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَعْتَرِفُ بِذُنُوبِي فَاغْفِرْ لِي ذُنُوبِي إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ,",
   "latin": "ALLAAHUMMA ANTA RABBII LAA ILAAHA ILLAA ANTA KHALAQTANII WA ANAA 'ABDUKA WA ANAA 'ALAA 'AHDIKA WA WA'DIKA MASTATHA'TU, A'UUDZU BIKA MIN SYARRI MAA SHANA'TU WA ABUU-U LAKA BINI'MATIKA 'ALAYYA WA A'TARIFU BIDZUNUUBII FAGHFIR LII DZUNUUBII, INNAHU LAA YAGHFIRUDZ DZUNUUBA ILLAA ANTA,",
   "arti": "Ya Allah, Engkau adalah Tuhanku, tidak ada tuhan yang berhak disembah kecuali Engaku, Engkau telah menciptakanku, dan aku adalah hambaMu, dan berada dalam perjanjian dan janjiMu semampuku. Aku berlindung kepadaMu dari keburukan apa yang telah aku perbuat, dan aku mengakui kenikmatanMu yang Engkau berikan kepadaku dan mengakui dosa-dosaku, maka ampunilah dosaku, sesungguhnya tidak ada yang dapat mengampuni dosa kecuali Engkau,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "Tidak ada seorangpun diantara kalian yang mengucapkannya ketika sore hari kemudian datang kepadanya taqdir untuk meninggal sebelum datang pagi hari melainkan wajib baginya Surga, dan tidaklah ia mengucapkannya ketika pagi hari kemudian datang kepadanya taqdir untuk meninggal sebelum datang sore hari melainkan wajib baginya Surga,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 83,
   "doa": "Doa Pagi Sore 3",
   "arab": "سُبْحَانَ اللَّهِ 100<br> الْحَمْدُ لِلَّهِ 100<br> لَا إِلَهَ إِلَّا اللَّهُ  100<br> اللَّهُ أَكْبَرُ 100,",
   "latin": "Subhanallah 100X<br> Al HAMDULILLAAH 100X<br> LAA ILAAHA ILLALLAAH 100X<br> ALLAAHU AKBAR 100X,",
   "arti": ",",
   "cara": "Dibaca Pagi dan Sore,",
   "utama": "Barang siapa yang bertasbih kepada Allah sebanyak seratus kali pada pagi hari dan seratus kali pada sore hari maka ia seperti orang yang seratus kali haji. Barang siapa bertahmid kepada Allah seratus kali pada pagi dan sore hari maka ia seperti membawa seratus kuda di jalan Allah, atau orang yang berperang seratus peperangan. Dan barang siapa yang bertahlil kepada Allah sebanyak seratus kali pada pagi hari dan seratus kali pada sore hari maka ia seperti orang yang memerdekakan budak dari anak Isma'il, dan barang siapa yang bertakbir kepada Allah sebayak seratus kali pada pagi hari dan seratus kali pada sore hari maka tidak ada orang pada hari itu yang membawa lebih banyak daripada apa yang ia bawa kecuali orang yang mengucapkan seperti itu atau lebih banyak lagi dari apa yang ia ucapkan,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 84,
   "doa": "Selesai Dari Majelis",
   "arab": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ,",
   "latin": "SUBHAANAKALLAAHUMMA WA BIHAMDIKA ASYHADU ANLAA ILAAHA ILLAA ANTA ASTAGHFIRUKA WA ATUUBU ILAIKA,",
   "arti": "Maha Suci Engkau wahai Allah, dan dengan memujiMu, aku bersaksi bahwa tidak ada tuhan yang berhak di sembah melainkan Engkau, aku meminta ampun dan bertaubat kepadaMu,",
   "cara": "Selesai dari majelis,",
   "utama": "diampuni dosanya selama di majelisnya itu,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 85,
   "doa": "Ketika Melihat Orang lain Terkena Musibah",
   "arab": "الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي مِمَّا ابْتَلَاكَ بِهِ وَفَضَّلَنِي عَلَى كَثِيرٍ مِمَّنْ خَلَقَ تَفْضِيلًا,",
   "latin": "Al HAMDULILLAAHILLAADZII 'AAFAANII MIMMAABTALAAKA BIHI WA FADHDHALANII 'ALAA KATSIIRIN MIMMAN KHALAQA TAFDHIILAN,",
   "arti": "segala puji bagi Allah yang telah menyelamatkanku dari musibah yang diberikan kepadamu, dan melebihkanku atas kebanyakan orang yang Dia ciptakan,",
   "cara": "Ketika melihat orang lain terkena musibah. Dibaca tapi jangan sampai yang terkena musibah mendengarnya,",
   "utama": "diselamatkan dari ujian tersebut, apapun hal tersebut selama ia masih hidup,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 86,
   "doa": "Doa Ketika Susah",
   "arab": "لَا إِلَهَ إِلَّا اللَّهُ الْعَظِيمُ الْحَلِيمُ، لَا إِلَهَ إِلَّا اللهُ رَبُّ الْعَرْشِ الْعَظِيمِ، لَا إِلَهَ إِلَّا اللهُ رَبُّ السَّمَاوَاتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيمِ,",
   "latin": "LAA-ILAAHA ILLALLAHUL 'ADZIIMUL HALIIM, LAA-ILAAHA ILLALLAH RABBUL'ARSYIL 'AZHIIMI LAA-ILAAHA ILLALLAH RABBUS SAMAAWAATI WARABBUL ARDLI WARABBUL'ASYIL KARIIMI,",
   "arti": "Tiada sesembahan yang hak selain Allah Yang Maha Mengetahui lagi Maha Bijaksana, tiada sesembahan yang hak selain Allah, Tuhan pemelihara arsy Yang Maha Agung, tiada sesembahan yang hak selain Allah Yang memelihara langit dan bumi, Tuhan pemelihara arsy yang mulia,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 87,
   "doa": "Doa Pengampunan Dosa",
   "arab": "لَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ,",
   "latin": "LAA ILAAHA ILLALLAAHU WALLAAHU AKBAR, WA LAA HAULA WA LAA QUWWATA ILLAA BILLAAH,",
   "arti": "Tidak ada tuhan yang berhak disembah kecuali Allah, dan Allah Maha Besar, tidak ada daya dan kekuatan kecuali dengan pertolongan Allah,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "diampuni dosa-dosanya walaupun seperti buih lautan,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 88,
   "doa": "Berat di timbangan dan disukai Allah",
   "arab": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ سُبْحَانَ اللَّهِ الْعَظِيمِ,",
   "latin": "SUBHAANALLAAHI WA BIHAMDIHI, SUBHAANALLAAHIL 'AZHIIM,",
   "arti": "Maha Suci Allah dan dengan memujiNya aku ada, Maha Suci Allah yang Maha Agung,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "Dua kalimat ringan dilisan, berat ditimbangan, dan disukai Ar Rahman,",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 89,
   "doa": "Doa Masuk Surga",
   "arab": "رَضِيتُ بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ رَسُولًا,",
   "latin": "RADHIITU BILLAAHI RABBAN WA BIL-ISLAAMI DIINAN WA BIMUHAMMADIN RASUULAN,",
   "arti": "Aku ridha Allah sebagai Tuhanku, Islam sebagai agamaku dan Muhammad sebagai rasul,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "wajib baginya untuk masuk Surga,",
   "sumber": "H.R. Abu Dawud,"
 },
 {
   "no": 90,
   "doa": "Doa Pengampunan Dosa 2",
   "arab": "أَسْتَغْفِرُ اللَّهَ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومَ وَأَتُوبُ إِلَيْهِ,",
   "latin": "ASTAGHFIRULLAAHAL LADZII LAA ILAAHA ILLAA HUWAL HAYYUL QAYYUUMU WA ATUUBU ILAIH,",
   "arti": "aku memohon ampun kepada Allah Dzat yang tidak ada tuhan yang berhak disembah kecuali Dia, yang Maha Hidup dan Yang terus mengurus makhlukNya, dan aku bertaubat kepadaNya,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "Akan diampuni walaupun dia pernah lari dari medan pertempuran,",
   "sumber": "H.R. Abu Dawud,"
 },
 {
   "no": 91,
   "doa": "Doa Pengampunan Dosa 3",
   "arab": "رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ,",
   "latin": "RABBIGHFIRLII WA TUB 'ALAYYA, INNAKA ANTAT TAWWAABUR RAHIIM,",
   "arti": "Ya Tuhanku, ampunilah aku dan terimalah taubatku sesungguhnya Engkau adalah Dzat yang Maha menerima taubat lagi Maha Penyayang,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Abu Dawud,"
 },
 {
   "no": 92,
   "doa": "Doa Untuk Orang Tua",
   "arab": "رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا,",
   "latin": "Robbighfirli waliwalidayya warkhamhuma kama rabbayani shoghiro,",
   "arti": ",",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Nuh 28 & Al isro' 24,"
 },
 {
   "no": 93,
   "doa": "Doa Setelah Adzan",
   "arab": "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلَاةِ الْقَائِمَةِ آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ,",
   "latin": "ALLAHUMMA RABBA HAADZIHID DA'WATIT TAMMAH WASHSHALAATIL QAA'IMAH. AATI MUHAMMADANIL WASIILATA WALFADLIILAH WAB'ATSHU MAQAAMAM MAHMUUDANIL LADZII WA'ADTAH,",
   "arti": "Ya Allah. Rabb Pemilik seruan yang sempurna ini, dan Pemilik shalat yang akan didirikan ini, berikanlah wasilah perantara) dan keutamaan kepada Muhammad. Bangkitkanlah ia pada kedudukan yang terpuji sebagaimana Engkau telah jannjikan,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 94,
   "doa": "Doa Sebelum Wudhu",
   "arab": "بِسْمِ اللَّهِ,",
   "latin": "BISMILLAH,",
   "arti": "Dengan menyebut nama Allah,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Abu Dawud,"
 },
 {
   "no": 95,
   "doa": "Doa Setelah Wudhu",
   "arab": "أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ,",
   "latin": "Asyhadu an laa ilaaha illalaahu wahdahu la syariika lahu, wa anna Muhammadan 'abduhu wa rasuluhu,",
   "arti": "Aku bersaksi, bahwa tidak ada tuhan yang berhak disembah selain Allah semata, tidak ada sekutu bagiNya dan bahwa Muhammad adalah hamba dan rasulNya,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Abu Dawud,"
 },
 {
   "no": 96,
   "doa": "Doa Masuk Masjid",
   "arab": "بِسْمِ اللَّهِ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ اللَّهُمَّ اغْفِرْ لِي ذُنُوبِي وَافْتَحْ لِي أَبْوَابَ رَحْمَتِكَ,",
   "latin": "BISMILLAHI WASSALAMU 'ALA ROSULILLAHI ALLOHUMMAGHFIRLI DZUNAUBI WAFTAHLI ABWAABA RAHMATIK,",
   "arti": "Dengan menyebut Nama Allah dan keselamatan semoga tetap atas Rosulillah Ya Allah, ampunilah dosa-dosaku dan bukanlah pintu-pintu rahmat-Mu untukku,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Ibnu Majah,"
 },
 {
   "no": 97,
   "doa": "Doa Keluar Masjid",
   "arab": "بِسْمِ اللَّهِ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ اللَّهُمَّ اغْفِرْ لِي ذُنُوبِي وَافْتَحْ لِي أَبْوَابَ فَضْلِكَ,",
   "latin": "BISMILLAHI WASSALAMU 'ALA ROSULILLAHI ALLOHUMMAGHFIRLI DZUNAUBI WAFTAHLI ABWAABA FADLLIK,",
   "arti": "Dengan menyebut Nama Allah dan keselamatan semoga tetap atas Rosulillah Ya Allah, ampunilah dosa-dosaku dan bukanlah pintu-pintu karunia-Mu untukku,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Ibnu Majah,"
 },
 {
   "no": 98,
   "doa": "Doa Ketika Mau tidur",
   "arab": "اَللَّهُمَّ بِاسْمِكَ أَمُوتُ وَأَحْيَا,",
   "latin": "Allohumma bismika amuutu wa ahya,",
   "arti": "Yaa Alloh dengan nama-Mu aku mati dan aku hidup,",
   "cara": "mau tidur,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 99,
   "doa": "Doa Bangun Tidur",
   "arab": "الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ,",
   "latin": "Al Hamdulillahilladzii ahyaana ba'da maa amatana wailaihi nusyur,",
   "arti": "Segala puji bagi Allah yang telah menghidupkan kami setelah mematikan kami, dan kepada-Nya lah tempat kembali,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 100,
   "doa": "Masuk WC",
   "arab": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ,",
   "latin": "ALLAHUMMA INNI A'UUDZU BIKA MINAL KHUBUTSI WAL KHOBAA`ITS,",
   "arti": "Ya Allah aku berlindung kepada-Mu dari setan laki-laki dan setan perempuan,",
   "cara": "Masuk WC,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 101,
   "doa": "Keluar WC",
   "arab": "غُفْرَانَكَ,",
   "latin": "GHUFRAANAKA,",
   "arti": "Aku mengharap ampunan-Mu,",
   "cara": "Keluar WC,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 102,
   "doa": "Doa Masuk Rumah",
   "arab": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ الْمَوْلَجِ وَخَيْرَ الْمَخْرَجِ بِسْمِ اللَّهِ وَلَجْنَا وَبِسْمِ اللَّهِ خَرَجْنَا وَعَلَى اللَّهِ رَبِّنَا تَوَكَّلْنَا,",
   "latin": "ALLAHUMMA INNII AS`ALUKA KHAIRAL MAULAJ WA KHAIRAL MAKHRAJ BIMILLAH WALAJNAA WA BISMILLAHI KHARAJNAA WA 'ALAALLAHI RABBINAA TAWAKKALNAA,",
   "arti": "Ya Allah, sesungguhnya aku minta kepada-Mu kebaikan tempat masuk dan tempat keluar. Dengan menyebut nama Allah, kami masuk rumah) dan dengan menyebut nama Allah kami keluar,",
   "cara": "Setelah baca doa ini hendaklah mengucapkan salam kepada keluarganya,",
   "utama": ",",
   "sumber": "H.R. Abu Dawud,"
 },
 {
   "no": 103,
   "doa": "Doa Keluar Rumah",
   "arab": "بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ,",
   "latin": "BISMILLAHI TAWAKKALTU 'ALALLAAH,  LAA HAULA WA LAA QUWWATA ILLAA BILLAAH,",
   "arti": "dengan nama Allah aku tawakal pada Allah, tidak ada daya dan kekuatan kecuali dengan dengan pertolongan Allah,",
   "cara": "Keluar dari rumah,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 104,
   "doa": "Doa Masuk Pasar",
   "arab": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ حَيٌّ لَا يَمُوتُ بِيَدِهِ الْخَيْرُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ,",
   "latin": "LAA ILAAHA ILLALLAAHU WAHDAHU LAA SYARIIKA LAH, LAHUL MULKU WA LAHUL HAMDU YUHYII WA YUMIITU WA HUWA HAYYUN LAA YAMUUTU BIYADIHIL KHAIRU WA HUWA 'ALAA KULLI SYAI-IN QADIIR,",
   "arti": "tidak ada tuhan yang berhak disembah kecuali Allah semata tidak ada sekutu bagiNya, milikNya semua kerajaan dan bagiNya seluruh pujian, Dia Yang menghidupkan, dan mematikan, Dia tidak mati, di tanganNya segala kebaikan, dan Dia Maha Mampu melakukan segala sesuatu,",
   "cara": "Masuk Pasar,",
   "utama": "Allah mencatat baginya satu juta kebaikan, dan menghapus darinya satu juta kesalahan, serta mengangkat untuknya satu juga derajat,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 105,
   "doa": "Doa Setelah Berpakaian",
   "arab": "الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي هَذَا الثَّوْبَ وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ,",
   "latin": "ALHAMDULILLAHIL LADZII KASAANII HADZA ATS TSAUBA WA RAZAQANIIHI MIN GHAIRI HAULIN MINNI WA LAA QUWWATIN,",
   "arti": "Segala puji bagi Allah yang telah memberikan pakaian ini kepadaku sebagai rizki, tanpa daya dan kekuatan dariku,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Abu Dawud,"
 },
 {
   "no": 106,
   "doa": "Doa Ketika Akan Makan",
   "arab": "بِسْمِ اللَّهِ,",
   "latin": "BISMILLAH,",
   "arti": "Dengan menyebut nama Allah,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 107,
   "doa": "Doa Ketika Lupa Membaca Basmalah saat akan Makan",
   "arab": " بِسْمِ اللَّهِ فِي أَوَّلِهِ وَآخِرِهِ,",
   "latin": "BISMILLAHI FI AWWALIHI WA AKHIRIHI,",
   "arti": "Dengan menyebut Nama Allah, di awal dan di akhirnya,",
   "cara": "Dibaca ketika ingat belum membaca basmalah ketika masih makan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 108,
   "doa": "Doa Sesudah Makan",
   "arab": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِينَ,",
   "latin": "Al HAMDULILLAAHILLADZII ATH'AMANAA WA SAQAANAA WA JA'ALANAA MUSLIMIIN,",
   "arti": "Segala puji bagi Allah Yang telah memberi makan dan minum kami, dan menjadikan kami orang-orang yang berserah diri,",
   "cara": "Setelah Selesai Makan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 109,
   "doa": "Doa Sesudah Minum Susu",
   "arab": "اللَّهُمَّ بَارِكْ لَنَا فِيهِ وَزِدْنَا مِنْهُ,",
   "latin": "ALLAAHUMMA BAARIK LANAA FIIHI WA ZIDNAA MINHU,",
   "arti": "Ya Allah, berkahilah kami padanya dan tambahkanlah darinya,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 110,
   "doa": "Doa Berdiri dari Duduk",
   "arab": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ,",
   "latin": "SUBHAANAKALLAAHUMMA WA BIHAMDIKA ASYHADU ANLAA ILAAHA ILLAA ANTA ASTAGHFIRUKA WA ATUUBU ILAIKA,",
   "arti": "Maha Suci Engkau wahai Allah, dan dengan memujiMu, aku bersaksi bahwa tidak ada tuhan yang berhak di sembah melainkan Engkau, aku meminta ampun dan bertaubat kepadaMu,",
   "cara": "Selesai dari majelis,",
   "utama": "diampuni dosanya selama di majelisnya itu,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 111,
   "doa": "Doa Menjimak Istri Berhubungan Suami Istri)",
   "arab": "اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا,",
   "latin": "ALLAHUMMA JANNIBNASY SYAITHAANA WA JANNIBISY SYAITHAANA MAA RAZAQTANAA,",
   "arti": "Ya Allah, jauhkanlah kami dari setan dan jauhkanlah setan dari apa yang Engkau rizkikan anak) kepada kami,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 112,
   "doa": "Doa Naik Kendaraan",
   "arab": "بِسْمِ اللَّهِ 3,<br>الْحَمْدُ لِلَّهِ 3 <br> سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ<br> الْحَمْدُ لِلَّهِ 3<br> اللَّهُ أَكْبَرُ3 <br> سُبْحَانَكَ إِنِّي قَدْ ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْت,",
   "latin": "BISMILLAAH 3X<br> Al HAMDULILLAAH 3X<br> SUBHAANALLADZII SAKHKHARA LANAA HAADZAA WA MAA KUNNAA LAHUU MUQRINIIN, WA INNAA ILAA RABBINAA LAMUNQALIBUUN<br> Al HAMDULILLAAH 3X<br> ALLAAHU AKBAR 3X<br> SUBHAANAKA INNII QAD ZHALAMTU NAFSII FAGHFIR LII, FAINNAHU LAA YAGHFIRUDZ DZUNUUBA ILLAA ANTA,",
   "arti": "Maha Suci Dzat yang telah menundukkan untuk kami hewan ini, dan tidaklah kami dapat memaksakannya, dan kepada Tuhan kami niscaya kami akan kembali. Maha Suci Engkau, sesungguhnya aku telah menzhalimi diriku maka ampunilah aku. Karena sesungguhnya tidak ada yang dapat mengampuni dosa kecuali engkau,",
   "cara": "BISMILLAAH 3X, naik ke kendaraan lalu membaca Al HAMDULILLAAH 3X, SUBHAANALLADZII SAKHKHARA LANAA HAADZAA WA MAA KUNNAA LAHUU MUQRINIIN, WA INNAA ILAA RABBINAA LAMUNQALIBUUN, Al HAMDULILLAAH 3X, ALLAAHU AKBAR 3X, SUBHAANAKA INNII QAD ZHALAMTU NAFSII FAGHFIR LII, FAINNAHU LAA YAGHFIRUDZ DZUNUUBA ILLAA ANTA setelah itu disunnahkan untuk tertawa,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 113,
   "doa": "Ketika terkena musibah",
   "arab": "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَأَخْلِفْ لِي خَيْرًا مِنْهَا,",
   "latin": "INAA LILLAHI WAINNAA ILAIHI RAAJI'UUN ALLAHUMMA`JURNII FII MUSHIIBATI WA AKHLIF LII KHAIRAN MINHAA,",
   "arti": "Sesungguhnya kami adalah milik Allah dan akan kembali kepada Allah. Ya Allah, berilah kami pahala karena mushibah ini dan tukarlah bagiku dengan yang lebih baik daripadanya,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Muslim,"
 },
 {
   "no": 114,
   "doa": "Doa Ketika Bersin",
   "arab": " الْحَمْدُ لِلَّهِ,",
   "latin": "Al Hamdulillah,",
   "arti": ",",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 115,
   "doa": "Doa Ketika Mendengar Orang Yang Bersin",
   "arab": " يَرْحَمُكَ اللَّهُ,",
   "latin": "Yarhamukallah ,",
   "arti": "semoga Allah merahmatimu,",
   "cara": "Hendaknya dibaca ketika yang bersin membaca hamdallah,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 116,
   "doa": "Jawaban Doa yang mendoakan kita ketika kita bersin",
   "arab": " يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ,",
   "latin": "Yahdikumullah wa yushlih baalakum,",
   "arti": "semoga Allah memberimu petunjuk dan memperbaiki hatimu,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 117,
   "doa": "Doa Menuju Masjid",
   "arab": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِحَقِّ السَّائِلِينَ عَلَيْكَ وَأَسْأَلُكَ بِحَقِّ مَمْشَايَ هَذَا فَإِنِّي لَمْ أَخْرُجْ أَشَرًا وَلَا بَطَرًا وَلَا رِيَاءً وَلَا سُمْعَةً وَخَرَجْتُ اتِّقَاءَ سُخْطِكَ وَابْتِغَاءَ مَرْضَاتِكَ فَأَسْأَلُكَ أَنْ تُعِيذَنِي مِنْ النَّارِ وَأَنْ تَغْفِرَ لِي ذُنُوبِي إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ,",
   "latin": "ALAHUMMA INNI AS`ALUKA BI HAQQIS SA`ILIIN 'ALAIKA WA AS`ALUKA BI HAQQI MAMSYAAYA HADZA FA INNI LAM AKHRUJ ASYARAN WA LAA BATHARAN WA LAA RIYA`AN WA LAA SUM'ATAN WA KHARAJTU ITTIQA`A SUKHTHIKA WABTIGHA`A MARDLATIKA FA AS`ALUKA AN TU'IDZANI MINANNAR WA AN TAGHFIRALI DZUNUBI INNAHU LAA YAGHFIRUDZ DZUNUBA ILLA ANTA,",
   "arti": "Ya Allah, aku meminta kepada-Mu dengan hak peminta kepada-Mu, dan aku juga meminta dengan hak jalanku ini. Sesungguhnya aku keluar bukan untuk keburukan, bukan untuk kesombongan, bukan untuk riya dan bukan untuk dipuji. Aku keluar agar terhindar dari murka-Mu dan mengharap ridla-Mu. Maka, aku meminta agar Engkau melindungiku dari siksa neraka dan mengampuni dosaku, sebab tidak ada yang mengampuni dosa selain-Mu,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Ibnu Majah,"
 },
 {
   "no": 118,
   "doa": "Doa Memakai Pakaian Baru",
   "arab": "الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي مَا أُوَارِي بِهِ عَوْرَتِي وَأَتَجَمَّلُ بِهِ فِي حَيَاتِي,",
   "latin": "Al HAMDULILLAAHILLADZII KASAANII MAA UWAARII BIHI 'AURAATII, WA ATAJAMMALU BIHI FII HAYAATII,",
   "arti": "Segala puji bagi Allah, yang telah memberiku pakaian yang dapat aku gunakan untuk menututupi auratku, dan berhias dalam hidupku,",
   "cara": "Memakai baju baru,",
   "utama": "berada dalam perlindungan dan penjagaan Allah, serta ditutupi oleh Allah baik dalam keadaan ia hidup maupun mati,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 119,
   "doa": "Doa Sesudah Makan 2",
   "arab": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ,",
   "latin": "Al HAMDULILLAAHILLADZII ATH'AMANII HAADZAA WA RAZAQANIIHI MIN GHAIRI HAULIN MINNII WA LAA QUWWATIN,",
   "arti": "Segala puji bagi Allah yang telah memberiku minum ini, dan merizkikan kepadaku tanpa daya serta kekuatan dariku,",
   "cara": "Setelah Selesai Makan,",
   "utama": "diampuni dosanya yang telah lalu,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 120,
   "doa": "Doa Sesudah Makan 3",
   "arab": "اللَّهُمَّ بَارِكْ لَنَا فِيهِ وَأَطْعِمْنَا خَيْرًا مِنْهُ,",
   "latin": "ALLAAHUMMA BAARIK LANAA FIIHI WA ATH'IMNAA KHAIRAN MINHU,",
   "arti": "Ya Allah, berkahilah kami padanya dan berilah kami makan yang lebih baik darinya,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 121,
   "doa": "Doa Berdiri dari Duduk 2",
   "arab": "رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ إِنَّكَ أَنْتَ التَّوَّابُ الْغَفُورُ,",
   "latin": "RABBIGHFIRLII WA TUB 'ALAYYA INNAKA ANTAT TAWWAABUL GAFUUR,",
   "arti": "Wahai Tuhanku, ampunilah dosaku, dan terimalah taubatku, sesungguhnya Engkau adalah Maha Pemberi taubat dan Maha Pengampu,",
   "cara": "Nabi Muhammad SAW membacanya 100X sebelum berdiri dari tempat duduknya di majelis,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 122,
   "doa": "Doa Ketika Mendengar Petir",
   "arab": "اللَّهُمَّ لَا تَقْتُلْنَا بِغَضَبِكَ وَلَا تُهْلِكْنَا بِعَذَابِكَ وَعَافِنَا قَبْلَ ذَلِكَ,",
   "latin": "ALLAAHUMMA LAA TAQTULNAA BIGHADHABIKA WA LAA TUHLIKNAA BI'ADZAABIKA WA 'AAFINAA QABLA DZAALIK,",
   "arti": "Ya Allah, janganlah Engkau bunuh kami dengan kemarahanMu, dan janganlah Engkau binasakan kami dengan adzabMu dan ampunilah kami sebelum itu,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 123,
   "doa": "Doa Ketika Menjumpai tanggal 1",
   "arab": "اللَّهُمَّ أَهْلِلْهُ عَلَيْنَا بِالْيُمْنِ وَالْإِيمَانِ وَالسَّلَامَةِ وَالْإِسْلَامِ رَبِّي وَرَبُّكَ اللَّهُ,",
   "latin": "ALLAAHUMMA AHLILHU 'ALAINAA BILYUMNI WAL AIMAANI WAS SALAAMATI WAL ISLAAM, RABBII WA RABBUKALLAAH,",
   "arti": "Terbitkanlah bulan tersebut kepada kami dengan berkah, iman, keselamatan serta Islam! Tuhanku dan Tuhanmu adalah Allah,",
   "cara": "Nabi Muhammad SAW membacanya ketika masuk tanggal 1,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 124,
   "doa": "Doa Ketika Marah",
   "arab": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ,",
   "latin": "A'UUDZU BILLAAHI MINASYSYAITHAANIRRAJIIM,",
   "arti": "aku berlindung kepada Allah dari syetan yang terkutuk,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "Hilang Marahnya,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 125,
   "doa": "Doa Ketika Angin Kencang",
   "arab": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِهَا وَخَيْرِ مَا فِيهَا وَخَيْرِ مَا أُرْسِلَتْ بِهِ وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا فِيهَا وَشَرِّ مَا أُرْسِلَتْ بِهِ,",
   "latin": "ALLAAHUMMA INNII AS-ALUKA MIN KHAIRIHAA WA KHAIRI MAA FIIHAA WA KHAIRI MAA URSILAT BIHI WA A'UUDZU BIKA MIN SYARRIHAA WA SYARRI MAA FIIHAA WA SYARRI MAA URSILAT BIHI,",
   "arti": "Ya Allah, aku mohon kepadaMu sebagian dari kebaikannya dan kebaikan yang ada padanya serta kebaikan sesuatu yang dikirim bersamanya, dan aku berlindung dari keburukan dan keburukan yang ada padanya serta keburukan sesuatu ia dikirim bersamanya,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 126,
   "doa": "Doa Sujud Quran",
   "arab": "سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ بِحَوْلِهِ وَقُوَّتِهِ,",
   "latin": "SAJADA WAJHIYA LILLADZII KHALAQAHU WA SYAQQA SAM'AHU WA BASHARAHU BIHAULIHI WA QUWWATIH.,",
   "arti": "wajahku bersujud kepada Dzat telah menciptakannya dan membuka pendengaran dan penglihatannya dengan daya dan kekuatanNya,",
   "cara": "Ketika menemui ayat sujud dalam Al Qur'an,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 127,
   "doa": "Doa Ketika Mau tidur 2",
   "arab": "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ وَفَوَّضْتُ أَمْرِي إِلَيْكَ وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ رَهْبَةً وَرَغْبَةً إِلَيْكَ لَا مَلْجَأَ وَلَا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ,",
   "latin": "ALLAHUMMA ASLAMTU NAFSII ILAIKA WA FAWWADLTU AMRII ILAIKA WA ALJA`TU ZHAHRII ILAIKA RAHBATAN WA RAGHBATAN ILAIKA LAA MALJA`A WA LAA MANJAA ILLAA ILAIKA AAMANTU BIKITAABIKALLADZII ANZALTA WANNABIYYIKALLADZII ARSALTA,",
   "arti": "Ya Allah, aku pasrahkan wajahku kepada-Mu, aku serahkan urusanku kepada-Mu, aku sandarkan punggungku kepada-Mu dengan perasaan senang dan takut kepada-Mu. Tidak ada tempat berlindung dan menyelamatkan diri dari siksa-Mu melainkan kepada-Mu. Ya Allah, aku beriman kepada kitab-Mu yang Engkau turunkan dan kepada Nabi-Mu yang Engkau utus,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "Jika kamu meninggal pada malammu itu, maka kamu dalam keadaan fitrah,",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 128,
   "doa": "Doa Ketika Mau tidur 3",
   "arab": "أَسْتَغْفِرُ اللَّهَ الْعَظِيمَ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْحَيَّ الْقَيُّومَ وَأَتُوبُ إِلَيْهِ,",
   "latin": "ASTAGHFIRULLAAHAL 'AZHIIM ALLADZII LAA ILAAHA ILLAA HUWAL HAYYUL QAYYUUM WA ATUUBU ILAIH,",
   "arti": "Aku memohon ampunan kepada Allah yang Maha Agung, Yang tidak ada tuhan yang berhak disembah kecuali Dia, yang selalu hidup dan senantiasa mengurus makhukNya. Aku bertaubat kepadaNya,",
   "cara": "Dibaca 3X,",
   "utama": "Allah mengampuni dosa-dosanya walaupun seperti buih lautan, walaupun sebanyak daun pohon, walaupun sebanyak kerikil, walaupun sebanyak hari-hari di dunia,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 129,
   "doa": "Sering dibaca Nabi Muhammad SAW",
   "arab": "اللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ,",
   "latin": "ALLAAHUMMA RABBANAA AATINAA FID DUN-YAA HASANAH WAFIL AAKHIRATI HASANAH WAQINAA 'ADZAABAN NAAR,",
   "arti": "Ya Allah, Wahai Rabb kami, karuniakanlah kepada kami kebaikan di dunia dan akhirat, dan hindarkanlah kami dari siksa api neraka,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 130,
   "doa": "Sering dibaca Nabi Muhammad SAW 2",
   "arab": "يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِي عَلَى دِينِكَ,",
   "latin": "YAA MUQALLIBAL QULUUB, TSABBIT QALBII 'ALAA DIINIKA,",
   "arti": "Wahai Dzat yang membolak-balikkan hati, tetapkanlah hatiku di atas agamaMu,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "Banyak dibaca Nabi Muhammad SAW,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 131,
   "doa": "Doa-doa Nabi Muhammad SAW",
   "arab": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ وَتَحَوُّلِ عَافِيَتِكَ وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيعِ سَخَطِكَ,",
   "latin": "ALLOOHUMMA INNII A'UUDZU BIKA MIN ZAWAALI NI'MATIKA, WATAHAWWULI 'AAFIYATIKA, WAFAJAA'ATI NIQMATIKA, WAJAMII'I SAKHOTHIKA,",
   "arti": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari hilangnya kenikmatan yang telah Engkau berikan, dari lepasnya kesehatan yang telah Engkau anugerahkan, dari siksa-Mu yang datang secara tiba-tiba, dan dari segala kemurkaan-Mu,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Muslim,"
 },
 {
   "no": 132,
   "doa": "Doa Sapu Jagad",
   "arab": "اللَّهُمَّ إِنَّا نَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنْتَ الْمُسْتَعَانُ وَعَلَيْكَ الْبَلَاغُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ,",
   "latin": "ALLAAHUMMA INNAA NAS-ALUKA MIN KHAIRI MAA SA-ALAKA MINHU NABIYYUKA MUHAMMADIN WA NA'UUDZU BIKA MIN SYARRI MAS TA'AADZA MINHU NABIYYUKA MUHAMMADUN SHALLALLAHU 'ALAIHI WASALLAM WA ANTAL MUSTA'AANU WA 'ALAIKAL BALAAGH, WA LAA HAULA WA LAA QUWWATA ILLAA BILLAH,",
   "arti": "Ya Allah, kami memohon diantara kebaikan apa yang diminta NabiMu Muhammad, dan kami berlindung dari keburukan yang NabiMu Muhammad shallallahu 'alaihi wasallam meminta perlindungan kepadanya, Engkau Tempat meminta pertolongan, dan Engkaulah tempat mengadu, dan tidak ada daya serta kekuatan kecuali karena pertolonganMu,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "sapu jagad meminta semua yang didoakan oleh Nabi Muhammad SAW),",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 133,
   "doa": "Ali Imron 38 Doa Nabi Zakaria AS - Meminta Keturunan/anak)",
   "arab": "۔... رَبِّ هَبۡ لِى مِن لَّدُنكَ ذُرِّيَّةً۬ طَيِّبَةً‌ۖ إِنَّكَ سَمِيعُ ٱلدُّعَآءِ,",
   "latin": "ROBBI HABLII MILLADUNKA DZURRIYATAN TOYYIBATAN INNAKA SAMII'UDDU'AA,",
   "arti": "Ya Tuhanku, berilah aku dari sisi Engkau seorang anak yang baik. Sesungguhnya Engkau Maha Pendengar doa,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Ali Imron 38,"
 },
 {
   "no": 134,
   "doa": "Ibrahim 40 Doa Nabi Ibrahim AS)",
   "arab": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِنْ ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ,",
   "latin": "ROBBIJ 'ALNII MUQIIMASSOLAATI WA MIN DZURRIYYATII ROBBANAA WA TAQOBBAL DU'AA,",
   "arti": "Ya Tuhanku, jadikanlah aku dan anak cucuku orang-orang yang tetap mendirikan shalat, ya Tuhan kami, perkenankanlah doaku,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Ibrahim 40,"
 },
 {
   "no": 135,
   "doa": "Toha 25-28 Doa Nabi Musa AS)",
   "arab": "۔... رَبِّ اشْرَحْ لِي صَدْرِي 25) وَيَسِّرْ لِي أَمْرِي 26) وَاحْلُلْ عُقْدَةً مِنْ لِسَانِي 27) يَفْقَهُوا قَوْلِي 28)۔,",
   "latin": "ROBBISYROKHLII SHODRII WA YASSIRLII AMRII WAHLUL 'UQDATAMMILLISAANII YAFQOHUU QOULII,",
   "arti": "25. ... Ya Tuhanku, lapangkanlah untukku dadaku, <br> 26. dan mudahkanlah untukku urusanku, <br> 27. dan lepaskanlah kekakuan dari lidahku, <br> 28. supaya mereka mengerti perkataanku,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Toha 25-28,"
 },
 {
   "no": 136,
   "doa": "Al Anbiya' 83 Doa Nabi Ayub AS)",
   "arab": "۔... أَنِّي مَسَّنِيَ الضُّرُّ وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ,",
   "latin": ",",
   "arti": "… sesungguhnya aku telah ditimpa penyakit dan Engkau adalah Tuhan Yang Maha Penyayang di antara semua penyayang,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Anbiya' 83,"
 },
 {
   "no": 137,
   "doa": "Al Anbiya' 87 Doa Nabi Yunus AS)",
   "arab": "۔... لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ,",
   "latin": "… LAA ILAAHA ILLAA ANTA SUBHAANAKA INNII KUNTU MINAZH ZHAALIMIIN,",
   "arti": "tidak ada Tuhan selain Engkau. Maha Suci Engkau, sesungguhnya aku adalah termasuk orang-orang yang zalim,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "tidaklah seorang muslim berdoa dengannya dalam suatu masalah melainkan Allah kabulkan baginya,",
   "sumber": "Al Anbiya' 87 – H.R. Tirmidzi,"
 },
 {
   "no": 138,
   "doa": "Al Anbiya' 89 Doa Nabi Zakaria AS)",
   "arab": " ۔... رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنْتَ خَيْرُ الْوَارِثِينَ,",
   "latin": "ROBBI LAA TADZARNII FARDAN WA ANTA KHOIRUL WAARITSIIN,",
   "arti": "... Ya Tuhanku janganlah Engkau membiarkan aku hidup seorang diri dan Engkaulah Waris Yang Paling Baik,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Anbiya' 89,"
 },
 {
   "no": 139,
   "doa": "Su'aro' 83848587 Doa Nabi Ibrahim AS)",
   "arab": "رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ 83) وَاجْعَلْ لِي لِسَانَ صِدْقٍ فِي الْآخِرِينَ 84) وَاجْعَلْنِي مِنْ وَرَثَةِ جَنَّةِ النَّعِيمِ 85) وَلَا تُخْزِنِي يَوْمَ يُبْعَثُونَ 87)۔,",
   "latin": ",",
   "arti": "83. Ya Tuhanku, berikanlah kepadaku hikmah dan masukkanlah aku ke dalam golongan orang-orang yang saleh <br> 84. dan jadikanlah aku buah tutur yang baik bagi orang-orang yang datang) kemudian, <br> 85. dan jadikanlah aku termasuk orang-orang yang mempusakai surga yang penuh kenikmatan <br> 87. dan janganlah Engkau hinakan aku pada hari mereka dibangkitkan,,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Su'aro' 83,84,85,87,"
 },
 {
   "no": 140,
   "doa": "An Naml 19 Doa Nabi Sulaiman AS)",
   "arab": "۔... رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ,",
   "latin": "ROBBI AUZI'NII AN ASYKURO NI'MATAKA ALLATII AN'AMTA 'ALAYYA WA 'ALAA WAALIDAYYA WA AN A'MALA SHOOLIHAN TARDHOOHU WA ADKHILNII BIROHMATIKA FII 'IBAADIKASSOOLIHIIN,",
   "arti": "... Ya Tuhanku berilah aku ilham untuk tetap mensyukuri nikmat Mu yang telah Engkau anugerahkan kepadaku dan kepada dua orang ibu bapakku dan untuk mengerjakan amal saleh yang Engkau ridhai; dan masukkanlah aku dengan rahmat-Mu ke dalam golongan hamba-hamba-Mu yang saleh,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "An Naml 19,"
 },
 {
   "no": 141,
   "doa": "Al Qosos 16 Doa Nabi Musa AS)",
   "arab": "۔... رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ ...۔,",
   "latin": "ROBBI INNII DZOLAMTU NAFSII FAGHFIRLII,",
   "arti": "... Ya Tuhanku, sesungguhnya aku telah menganiaya diriku sendiri karena itu ampunilah aku ...,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Qosos 16,"
 },
 {
   "no": 142,
   "doa": "Al Qosos 24 Doa Nabi Musa AS)",
   "arab": "۔... رَبِّ إِنِّي لِمَا أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ,",
   "latin": "ROBBI INNII LIMAA ANZALTA ILAYYA MIN KHOIRIN FAQIIR,",
   "arti": "... Ya Tuhanku sesungguhnya aku sangat memerlukan sesuatu kebaikan yang Engkau turunkan kepadaku,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Qosos 24,"
 },
 {
   "no": 143,
   "doa": "Al Qosos 21 Doa Nabi Musa AS)",
   "arab": "۔... رَبِّ نَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ,",
   "latin": "ROBBI NAJJINII MINAL QOUMIDZDZOOLIMIIN,",
   "arti": "... Ya Tuhanku, selamatkanlah aku dari orang-orang yang zalim itu,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Qosos 21,"
 },
 {
   "no": 144,
   "doa": "Al Qosos 22 Doa Nabi Musa AS)",
   "arab": "۔... عَسَىٰ رَبِّي أَنْ يَهْدِيَنِي سَوَاءَ السَّبِيلِ,",
   "latin": "'ASAA ROBBII AYYAHDIYANII SAWAA ASSABIIL,",
   "arti": "... Mudah-mudahan Tuhanku memimpinku ke jalan yang benar,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Qosos 22,"
 },
 {
   "no": 145,
   "doa": "Al Ankabut 30 Doa Nabi Luth AS)",
   "arab": "۔... رَبِّ انْصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ,",
   "latin": "ROBBIN SHURNII 'ALAL QOUMIL FAASIQIIN,",
   "arti": "... Ya Tuhanku, tolonglah aku dengan menimpakan azab) atas kaum yang berbuat kerusakan itu,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Ankabut 30,"
 },
 {
   "no": 146,
   "doa": "Ibrahim 35 Doa Nabi Ibrahim AS)",
   "arab": "۔... رَبِّ اجْعَلْ هَٰذَا الْبَلَدَ آمِنًا وَاجْنُبْنِي وَبَنِيَّ أَنْ نَعْبُدَ الْأَصْنَامَ,",
   "latin": "ROBBIJ'AL HAADZAL BALADA AAMINAN WAJNUBNII WA BANIYYA ANNA'BUDAL ASHNAAM,",
   "arti": "... Ya Tuhanku, jadikanlah negeri ini, negeri yang aman, dan jauhkanlah aku beserta anak cucuku daripada menyembah berhala-berhala,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Ibrahim 35,"
 },
 {
   "no": 147,
   "doa": "As Saffat 100 Doa Nabi Ibrahim AS)",
   "arab": "رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ,",
   "latin": "ROBBI HABLII MINASSHOOLIHIIN,",
   "arti": "Ya Tuhanku, anugrahkanlah kepadaku seorang anak) yang termasuk orang-orang yang saleh,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "As Saffat 100,"
 },
 {
   "no": 148,
   "doa": "Al Mumtahanah 45 Doa Nabi Ibrahim AS)",
   "arab": "۔... رَبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ 4) رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا ۖ إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ 5)۔,",
   "latin": "ROBBANAA 'ALAIKA TAWAKKALNAA WA ILAIKA ANABNAA WA ILAIKAL MASHIIR ROBBANAA LAA TAJ'ALNAA FITNATAN LILLADZIINA KAFARUU WAGHFIRLANAA ROBBANAA INNAKA ANTAL 'AZIIZUL HAKIIM,",
   "arti": "4. ... Ya Tuhan kami hanya kepada Engkaulah kami bertawakkal dan hanya kepada Engkaulah kami bertaubat dan hanya kepada Engkaulah kami kembali <br> 5. Ya Tuhan kami, janganlah Engkau jadikan kami sasaran) fitnah bagi orang-orang kafir. Dan ampunilah kami ya Tuhan kami. Sesungguhnya Engkaulah Yang Maha Perkasa lagi Maha Bijaksana,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Mumtahanah 4,5,"
 },
 {
   "no": 149,
   "doa": "Doa Nabi Daud AS",
   "arab": "اللَّهُمَّ إِنِّي أَسْأَلُكَ حُبَّكَ وَحُبَّ مَنْ يُحِبُّكَ وَالْعَمَلَ الَّذِي يُبَلِّغُنِي حُبَّكَ اللَّهُمَّ اجْعَلْ حُبَّكَ أَحَبَّ إِلَيَّ مِنْ نَفْسِي وَأَهْلِي وَمِنَ الْمَاءِ الْبَارِدِ,",
   "latin": "ALLAAHUMMA INNII AS-ALUKA HUBBAKA, WA HUBBA MAN YUHIBBUKA, WAL 'AMALALLADZII YUBALLIGHUNII HUBBAKA. ALLAAHUMMAJ'Al HUBBAKA AHABBA ILAYYA MIN NAFSII WA AHLII WA MINAL MAAIL BAARID,",
   "arti": "Ya Allah, aku memohon kepadaMu kecintaanMu, dan kecintaan orang yang mencintaiMu, serta amalan yang menyampaikanku kepada kecintaanMu. Ya Allah, jadikanlah kecintaanMu lebih aku cintai daripada diriku, keluargaku serta air dingin,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "Salah satu doa Nabi Daud AS,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 150,
   "doa": "Doa Nabi Yusuf AS",
   "arab": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الْمَخْزُوْنِ وَالْمَكْنُوْنِ يَا بَدِيْعَ السَّمٰوَاتِ وَالْأَرْضِ يَا ذَا الْجَلَالِ وَالْاِكْرَامِ أَنْ تَغْفِرَ لِي ذَنْبِي وَتَرْحَمْنِي وَأَنْ تَجْعَلَ لِي مِنْ أَمْرِي فَرَجًا وَمَخْرَجًا وَأَنْ تَرْزُقَنِي مِنْ حَيْثُ أَحْتَسِبُ وَمِنْ حَيْثُ لَا أَحْتَسِبُ,",
   "latin": "Allaahumma innii asaluKa bismiKal Makhzuuni wal Maknuuni yaa badiias samaawaati wal ardhi yaa Dzal Jalaali wal Ikraami an taghfira lii dzanbii wa tarchamanii wa an tajala lii min amrii farajan wa makhrajaa wa an tarzuqanii min chaitsu achtasibu wa min chaitsu laa achtasib,",
   "arti": "Ya Allah, sungguh saya mohon padaMu, dengan NamaMu yang disimpan dan disembunyikan. Ya yang membuat beberapa langit dan bumi. Ya pemilik keagungan dan pemulia, agar: 1), Kau ampuni dosa saya. 2), Dan agar Kau sayangi saya. 3), Dan agar Kau jadikan jalan keluar dari kesulitan) dan kebahagiaan untuk saya. 4), Dan agar Kau beri saya rizqi dari yang saya perhitungkan dan yang tidak saya perhitungkan,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "Allah azza wajalla menjadikan jalan keluar dari kesulitan) dan kebahagiaan untuk Nabi Yusuf AS, dan memberi anugrah kerajaan Mesir dari yang tidak dia sangka,",
   "sumber": "Jalaluddin Assayuthi  dalam Addurrul-Mantsur,"
 },
 {
   "no": 151,
   "doa": "Nabi Yusyak Yosua) AS",
   "arab": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الزَّكِيِّ الطَّهَرِ الطَّاهِرِ الْمُطَهَّرِ الْمُقَدَّسِ الْمُباَرَكِ الْمِخْزُوْنِ الْمَكْنُوْنِ الْمَكْتُوْبِ عَلَى سُراَدِقِ الْمَجْدِ وَسُراَدِقِ الْحَمْدِ وَسُراَدِقِ الْقُدْرَةِ وَسُراَدِقِ السُّلْطاَنِ وَسُراَدِقِ السِّرِّ إِنِّي أَدْعُوْكَ ياَ رَبِّ بِأَنَّ لَكَ الْحَمْدَ لاَ إِلهَ اِلاَّ أَنْتَ النُّوْرُ الْبَارُّ الرَّحْمنُ الرَّحِيْمُ الصَّادِقُ عَالِمُ الْغَيْبِ وَالشَّهاَدَةِ بَدِيْعُ السَّمواَتِ وَالْأَرْضِ وَنُوْرُهُنَّ وَقَيِّمُهُنَّ ذُوْ الْجَلاَلِ وَالْإِكرَامِ حَناَّنُ مَناَّنُ جَباَّرُ نُوْرٌ داَئِمٌ قُدُّوْسٌ حَيٌّ لاَ يَمُوْتُ,",
   "latin": "Allaahumma innii asaluKa bi-SmiKaz-Zakkiyyit-Thahiri-Ttaahiril-Muthahharil-Muqaddasil-Mubarakil-Makhzuunil-Maknuunil-Maktuubi alaa suraadiqil-majdi wasuraadiqil-qudrati wasuraadiqis-Sulthaani wasuraadiqis-Sirri. Innii aduuKa yaa Rabbi bianna laKal-hamda laa Ilaaha illaa Antan-Nuurul-Baarrur-Rahmaanur-Rachiimus-Shaadiqu Aalimul-ghoibi wassyahaadati Badiiussamaawaati wal-Ardhi wa-Nuuruhunna wa-Qayyimuhunna Dzul-Jalaali wal-ikraami Channanu Mannaanu Jabbaru Nuurun Daaimun Quddusun Chayyun laa yamuutu,",
   "arti": "Ya Allah! Sungguh saya minta pada Kau dengan NamaMu yang Maha Suci Maha Bersih Maha Bersih Maha membersihkan yang dianggap suci yang dibarakahi yang disimpan yang disembunyikan yang ditulis di dinding keagungan, dinding qadrat, dinding kerajaan, dan dinding rahasia. Sungguh saya berdoa padaMu ya Tuhanku! Karena sungguh milikmu segala puji. Tiada Tuhan yang berhak disembah kecuali Kau. Nur yang Maha Baik Maha pengasih Maha penyayang, Maha Benar. Maha Tahu barang ghoib dan barang yang tampak. Pencipta beberapa langit dan bumi. Penerang beberapa langit dan bumi. Perumat itu semuanya. Pemilik keagungan dan pemulia. Yang Maha pengasih yang Maha memberi anugrah. Yang Maha memaksa. Nur abadi Maha Suci Maha Hidup; takkan wafat,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "Kalimat inilah yang dipergunakan berdoa oleh Nabi Yusyak Yosua) bin Nun AS, hingga matahari diberhentikan sejenak) dengan Idzin Allah,",
   "sumber": "H.R. Kanzil Umal,"
 },
 {
   "no": 152,
   "doa": "Pengampunan Dosa",
   "arab": "رَبِّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي وَإِسْرَافِي فِي أَمْرِي كُلِّهِ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي اللَّهُمَّ اغْفِرْ لِي خَطَايَايَ وَعَمْدِي وَجَهْلِي وَهَزْلِي وَكُلُّ ذَلِكَ عِنْدِي اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ,",
   "latin": "ROBBIGHFIRLII KHOTHIIATII WAJAHLII WA ISROOFII FII AMRII KULLIHI WA MAA ANTA A'LAMU BIHI MINNII ALLOHUMMAGHFIRLII KHOTHOOYAAYA WA 'AMDII WA JAHLII WA HAZLII WA KULLU DZAALIKA 'INDII ALLOHUMMAGHFIRLII MAA QODDAMTU WA MAA AKHKHORTU WA MAA ASRORTU WA MAA A'LANTU ANTAL MUQODDIMU WA ANTAL MUAKHKHIRU WA ANTA 'ALAA KULLI SYAI IN QODIIR,",
   "arti": "Ya Allah, ampunilah kesalahan, kebodohan, dan perbuatanku yang terlalu berlebihan dalam urusanku, serta ampunilah kesalahanku yang Engkau lebih mengetahui daripadaku. Ya Allah, ampunilah kesalahanku, kemalasanku, kesengajaanku, kebodohanku, gelak tawaku yang semua itu ada pada diriku. Ya Allah, ampunilah aku atas dosa yang telah berlalu, dosa yang mendatang, dosa yang aku samarkan, dosa yang aku perbuat dengan terang-terangan dan dosa yang Engkau lebih mengetahuinya daripada aku, Engkaulah yang mengajukan dan Engkaulah yang mengakhirkan, serta Engkau Maha Kuasa atas segala sesuatu,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 153,
   "doa": "Mohon Masuk Surga",
   "arab": "اللَّهُمَّ اغْفِرْ لَنَا وَارْحَمْنَا، وَارْضَ عَنَّا، وَتَقَبَّلْ مِنَّا، وَأَدْخِلْنَا الْجَنَّةَ، وَنَجِّنَا مِنَ النَّارِ، وَأَصْلِحْ لَنَا شَأْنَنَا كُلَّهُ,",
   "latin": "ALLOHUMMAGHFIRLANAA WARHAMNAA WARDHO 'ANNA WA TAQOBBAL MINNAA WA ADKHILNALJANNATA WA NAJJINAA MINANNAARI WA ASHLIH LANAA SYA'NANAA KULLAH,",
   "arti": "Ya Allah! Ampuni kami, rahmati kami, ridlai kami, terimalah amalan) kami, masukkanlah kami ke surga, dan selamatkanlah kami dari neraka serta perbaikilah kondisi kami seluruhnya,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Ibnu Majah,"
 },
 {
   "no": 154,
   "doa": "Mohon Baiknya Urusan Dunia Akhirot",
   "arab": "اللهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي، وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ، وَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ,",
   "latin": "ALLOOHUMMA ASHLIH LII DIINII ALLADZII HUWA 'ISHMATU AMRII, WA ASHLIH LII DUN-YAAYA ALLATII FIIHAA MA'AASYII, WA ASH-LIH LII AAKHIROTII ALLATII FIIHAA MA'AADZII, WAJ'ALIL HAYAATA ZIYAADATAN LII FII KULLI KHOIRIN, WAJ'ALIL MAUTA ROOHATAN LII MIN KULLI SYARRIN,",
   "arti": "Ya Allah ya Tuhanku, perbaikilah bagiku agamaku sebagai benteng urusanku; perbaikilah bagiku duniaku yang menjadi tempat kehidupanku; perbaikilah bagiku akhiratku yang menjadi tempat kembaliku! Jadikanlah ya Allah kehidupan ini mempunyai nilai tambah bagiku dalam segala kebaikan dan jadikanlah kematianku sebagai kebebasanku dari segala kejahatan,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Muslim,"
 },
 {
   "no": 155,
   "doa": "Mohon Petunjuk dan Kebenaran",
   "arab": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى,",
   "latin": "ALLOOHUMMA INNII AS-ALUKALHUDAA WATTUQOO WAL'AFAAFA WALGHINAA,",
   "arti": "Ya Allah ya Tuhanku, sesungguhnya aku memohon kepada-Mu petunjuk, ketakwaan, terhindar dari perbuatan yang tidak baik, dan kecukupan tidak minta-minta,),",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Muslim,"
 },
 {
   "no": 156,
   "doa": "Mohon Petunjuk dan Kebenaran 2",
   "arab": "اللَّهُمَّ اهْدِنِي وَسَدِّدْنِي وَاذْكُرْ بِالْهُدَى هِدَايَتَكَ الطَّرِيقَ وَالسَّدَادِ سَدَادَ السَّهْمِ,",
   "latin": "ALOOHUMMAH DINII WASADDIDNII WADZKUR BILHUDAA HIDAAYATAKATH THORIIQO WASSADAADI SADAADAS SAHMI,",
   "arti": "Ya Allah, berikanlah petunjuk kepadaku. Berilah aku jalan yang lurus. Jadikan petunjuk-Mu sebagai jalanku dan kelurusan hidupku selurus anak panah,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Muslim,"
 },
 {
   "no": 157,
   "doa": "Mohon Khusyu' dan Doa Maqbul",
   "arab": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ وَالْجُبْنِ وَالْبُخْلِ وَالْهَرَمِ وَعَذَابِ الْقَبْرِ اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا أَنْتَ وَلِيُّهَا وَمَوْلَاهَا اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ وَمِنْ قَلْبٍ لَا يَخْشَعُ وَمِنْ نَفْسٍ لَا تَشْبَعُ وَمِنْ دَعْوَةٍ لَا يُسْتَجَابُ لَهَا,",
   "latin": "ALLOOHUMMA INNII A'UUDZU BIKA MINAL 'AJZI WAL KASALI, WAL JUBNI WAL BUKHLI WAL HAROMI, WA'ADZAABIL QOBRI, ALLOOHUMMA AATI NAFSII TAQWAAHAA, WAZAKKIHAA ANTA KHOIRU MAN ZAKKAAHAA, ANTA WALIYYUHAA WAMAULAAHAA, ALLOOHUMMA INNII A'UUDZU BIKA MIN 'ILMIN LAA YANFA'U WAMIN QOLBIN LAA YAKHSYA'U WAMIN NAFSIN LAA TASYBA'U WAMIN DA'WATIN LAA YUSTAJAABU LAHA,",
   "arti": "Ya Allah ya Tuhanku, aku berlindung kepada-Mu dari kelemahan, kemalasan, ketakutan, kekikiran, kepikunan, dan siksa kubur. Ya Allah ya Tuhanku, berikanlah ketakwaan kepada jiwaku, sucikanlah ia, sesungguhnya Engkaulah sebaik-baik Dzat yang dapat mensucikannya, Engkaulah yang menguasai dan yang menjaganya. Ya Allah ya Tuhanku, sesungguhnya aku berlindung kepada-Mu dari ilmu yang tidak berguna, hati yang tidak khusyu', diri yang tidak pernah puas, dan doa yang tidak terkabulkan,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Muslim,"
 },
 {
   "no": 158,
   "doa": "Mohon Khusyu' dan Doa Maqbul 2",
   "arab": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ قَلْبٍ لَا يَخْشَعُ وَمِنْ دُعَاءٍ لَا يُسْمَعُ وَمِنْ نَفْسٍ لَا تَشْبَعُ وَمِنْ عِلْمٍ لَا يَنْفَعُ أَعُوذُ بِكَ مِنْ هَؤُلَاءِ الْأَرْبَعِ,",
   "latin": "ALLAAHUMMA INNII A'UUDZU BIKA MIN QALBIN LAA YAKHSYA', WA MIN DU'AAIN LAA YUSMA' WA MIN NAFSIN LAA TASYBA' WA MIN 'ILMIN LAA YANFA' WA, A'UUDZU BIKA MIN HAA ULAA IL ARBA',",
   "arti": "Ya Allah, aku berlindung kepadaMu dari hati yang tidak khusyu', dari doa yang tidak didengar, dari jiwa yang tidak pernah merasa puas, dan dari ilmu yang tidak bermanfaat, dan aku berlindung kepadaMu dari empat perkara tersebut,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 159,
   "doa": "Mohon Ilham yang Benar",
   "arab": "اللَّهُمَّ أَلْهِمْنِي رُشْدِي وَأَعِذْنِي مِنْ شَرِّ نَفْسِي,",
   "latin": "ALLAAHUMMA ALHIMNII RUSYDII WA A'IDZNII MIN SYARRI NAFSII,",
   "arti": "Ya Allah, ilhamkan kepadaku petunjukku, dan lindungilah aku dari kejahatan diriku,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "dua kalimat yang bermanfaat,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 160,
   "doa": "Mohon Kesehatan Badan",
   "arab": "اللَّهُمَّ عَافِنِي فِي جَسَدِي وَعَافِنِي فِي بَصَرِي وَاجْعَلْهُ الْوَارِثَ مِنِّي لَا إِلَهَ إِلَّا اللَّهُ الْحَلِيمُ الْكَرِيمُ سُبْحَانَ اللَّهِ رَبِّ الْعَرْشِ الْعَظِيمِ وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ,",
   "latin": "ALLAAHUMMA 'AAFINII FII JASADII, WA 'AAFINII FII BASHARII, WAJ'ALHUL WAARITSA MINNII, LAA ILAAHA ILLAAHA ILLALLAAHUL HALIIMUL KARIIM, SUBHAANALLAAHI RABBIL 'ARSYIL 'AZHIIM, WAL HAMDULILLAAHI RABBIL 'AALAMIIN,",
   "arti": "Ya Allah, selamatkanlah aku dalam tubuhku, ya Allah selamatkan aku dalam pandanganku, dan jadikan itu sebagai warisan dariku, tidak ada tuhan yang berhak disembah kecuali Allah yang Maha lembut dan Mulia, Maha Suci Allah Tuhan Pemilik 'arsy yang agung, dan segala puji bagi Allah Tuhan semesta alam,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 161,
   "doa": "Mohon Rumah dan Rezekinya Barokah",
   "arab": "اللَّهُمَّ ارْزُقْنِي حُبَّكَ وَحُبَّ مَنْ يَنْفَعُنِي حُبُّهُ عِنْدَكَ اللَّهُمَّ مَا رَزَقْتَنِي مِمَّا أُحِبُّ فَاجْعَلْهُ قُوَّةً لِي فِيمَا تُحِبُّ اللَّهُمَّ وَمَا زَوَيْتَ عَنِّي مِمَّا أُحِبُّ فَاجْعَلْهُ فَرَاغًا لِي فِيمَا تُحِبُّ,",
   "latin": "ALLAAHUMMARZUQNII HUBBAKA, WA HUBBA MAN YANFA'UNII HUBBUHU 'INDAKA. ALLAAHUMMA MAA RAZAQTANII MIMMAA UHIBBU FAJ'ALHU QUWWATAN LII FIIMAA TUHIBBU. ALLAAHUMMA WA MAA ZAWAITA 'ANNII MIMMAA UHIBBU FAJ'ALHU FARAAGHAN LII FIIMAA TUHIBBU,",
   "arti": "Ya Allah, rizkikanlah kepadaku kecintaanMu, dan kecintaan orang yang memberiku manfaat kecintaannya di sisiMu. Ya Allah, apa yang Engkau rizkikan kepadaku diantara yang aku cintai maka jadikanlah kekuatan untukku melakukan apa yang Engkau cintai. Ya Allah, dan apa yang Engkau jauhkan dariku diantara apa yang aku cintai maka jadikahlah kesempatan bagiku untuk melakukan apa yang Engkau cintai,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 162,
   "doa": "Mohon Rumah dan Rezekinya Barokah 2",
   "arab": "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي وَوَسِّعْ لِي فِي دَارِي وَبَارِكْ لِي فِيمَا رَزَقْتَنِي,",
   "latin": "ALLAAHUMMAGHFIRLII DZANBII WA WASSI' LII FII DAARII, WA BAARIK LII FIIMAA RAZAQTANII,",
   "arti": "Ya Allah, ampunilah dosaku, dan luaskanlah tempat tinggalku, berkahilah aku pada rizki yang telah Engkau berikan,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "kalimat-kalimat yang tidak meninggalkan sesuatu,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 163,
   "doa": "Mohon Ilmu yang Manfaat",
   "arab": "اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي وَعَلِّمْنِي مَا يَنْفَعُنِي وَزِدْنِي عِلْمًا الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ وَأَعُوذُ بِاللَّهِ مِنْ حَالِ أَهْلِ النَّارِ,",
   "latin": "ALLAHUMMAN FA'NII BIMAA 'ALLAMTANII WA 'ALLIMNII MAA YANFA'UNII WA ZIDNII 'ILMA, ALHAMDULILLAHI 'ALAA KULLI HAALIN WA A'UUDZU BILLAHI MIN HAALI AHLIN NAAR,",
   "arti": "Ya Allah! Berilah manfaat terhadap apa yang telah Engkau berikan kepadaku, ajarkanlah kepadaku sesuatu yang bermanfaat bagiku dan tambahkanlah kepadaku ilmu. Segala puji hanya milik Allah pada semua kondisi baik kondosi bahagia maupun susah) dan aku berlindung kepada Allah dari perbuatan penduduk neraka,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 164,
   "doa": "Mohon Ilmu yang Manfaat 2",
   "arab": "اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي وَعَلِّمْنِي مَا يَنْفَعُنِي وَزِدْنِي عِلْمًا وَالْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ وَأَعُوذُ بِاللَّهِ مِنْ عَذَابِ النَّارِ,",
   "latin": "ALLOHUMMANFA'NII BIMAA 'ALLAMTANII WA 'ALLAMNII MAA YANFA'UNII WAZIDNII 'ILMAN WALHAMDULILLAAHI 'ALAA KULLI HAALIN WA A'UUDZUBILLAAHI MIN 'ADZAABINNAAR,",
   "arti": "Ya Allah, berikanlah kemanfa'atan atas apa yang telah Engkau ajarkan kepadaku, dan ajarkanlah aku apa-apa yang bermanfa'at untuk diriku, tambahkanlah kepadaku ilmu. Dan segala puji bagi Allah atas semua keadaan, aku pun berlindung kepada Allah dari siksa api neraka,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Ibnu Majah,"
 },
 {
   "no": 165,
   "doa": "Mohon Jadi Ahli Syukur Dzikir dan Thoat",
   "arab": "رَبِّ أَعِنِّي وَلَا تُعِنْ عَلَيَّ وَانْصُرْنِي وَلَا تَنْصُرْ عَلَيَّ وَامْكُرْ لِي وَلَا تَمْكُرْ عَلَيَّ وَاهْدِنِي وَيَسِّرْ الْهُدَى لِي وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ رَبِّ اجْعَلْنِي لَكَ شَكَّارًا لَكَ ذَكَّارًا لَكَ رَهَّابًا لَكَ مِطْوَاعًا لَكَ مُخْبِتًا إِلَيْكَ أَوَّاهًا مُنِيبًا رَبِّ تَقَبَّلْ تَوْبَتِي وَاغْسِلْ حَوْبَتِي وَأَجِبْ دَعْوَتِي وَثَبِّتْ حُجَّتِي وَسَدِّدْ لِسَانِي وَاهْدِ قَلْبِي وَاسْلُلْ سَخِيمَةَ صَدْرِي,",
   "latin": "ROBBI A'INNII WA LAA TU'IN 'ALAYYA WANSHURNII WA LAA TANSHUR 'ALAYYA, WAMKUR LII WA LAA TAMKUR 'ALAYYA, WAHDINII WA YASSIR Al HUDAA LII, WANSHURNII 'ALAA MAN BAGHAA 'ALAYYA. RABBIJ'ALNII LAKA SYAKKAARAN LAKA, DZAKKAARAN LAKA RAHHAABAN LAKA MITHWAA'AN LAKA MUKHBITAN ILAIKA, AWWAAHAN MUNIIBAN. RABBI TAQABBAL TAUBATII AGHSIL HAUBATII WA AJIB DA'WATII WA TSABBIT HUJJATII, WA SADDID LISAANII WAHDI QALBII WASLUL SAKHIIMATA SHADRII,",
   "arti": "Ya Allah, bantulah aku dan jangan Engkau bantu musuhku) untuk mengalahkanku, dan tolonglah aku dan jangan Engkau tolong musuhku untuk mengalahkanku, buatlah tipu daya untuk keberhasilanku dan jangan Engkau membuat tipu daya untuk mencelakai diriku. Berilah aku petunjuk dan mudahkanlah petunjuk untukku, dan tolonglah aku melawan orang yang melampui batas terhadapku. Wahai Tuhanku, jadikanlah aku orang yang senantiasa bersyukur kepadaMu, senantiasa ingat kepadaMu, senantiasa takut serta taat kepadaMu, bertaubat kepadaMu, dan senantiasa kembali kepadaMu. Wahai Tuhanku, terimalah taubatku, cucilah dosaku, dan kabulkan doaku, kokohkan hujjahku, luruskan lidahku, tunjukilah hatiku, dan hilangkanlah kedengkian hatiku,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 166,
   "doa": "Mohon Dipilihkan Perkara yang Baik",
   "arab": "اللَّهُمَّ خِرْ لِي وَاخْتَرْ لِي,",
   "latin": "ALLOHUMMA KHIRLII WAKHTARLII,",
   "arti": "Ya Allah, pilihkan untukku,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 167,
   "doa": "Mohon Hidup/Mati yang Baik",
   "arab": "اللَّهُمَّ أَحْيِنِي مَا كَانَتِ الْحَيَاةُ خَيْرًا لِي وَتَوَفَّنِي إِذَا كَانَتْ الْوَفَاةُ خَيْرًا لِي,",
   "latin": "ALLAHUMMA AHYINI MA KAANATIL HAYATU KHAIRAN LI WA TAWAFFANI IDZA KANATIL WAFATU KHAIRAN LI,",
   "arti": "Ya Allah, hidupkanlah aku jika kehidupan itu baik untukku, dan matikanlah aku jika kematian itu baik bagiku,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 168,
   "doa": "Mohon Dihilangkan Rasa Was-was",
   "arab": "هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ,",
   "latin": "HUWALAWWALU WAL AAKHIRU WADHDHOOHIRU WAL BAATHINU WA HUWA BIKULLI SYAI IN 'ALIIM,",
   "arti": "Dialah Yang Awal dan Yang Akhir Yang Zhahir dan Yang Bathin; dan Dia Maha Mengetahui segala sesuatu,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 169,
   "doa": "Mohon Harta dan Anak yang Banyak dan Barokah untuk diri sendiri)",
   "arab": "اللَّهُمَّ أَكْثِرْ مَالِى وَوَلَدِىْ وَبَارِكْ لِىْ فِيمَا أَعْطَيْتَنِى,",
   "latin": "ALLOHUMMAKTSIR MAALII WA WALADII WABAARIKLII FIIMAA A' THOITANII,",
   "arti": "Ya Allah, karuniailah saya harta dan anak yang banyak dan berkahilah apa yang telah Engkau berikan kepada saya.,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 170,
   "doa": "Mohon Harta dan Anak yang Banyak dan Barokah untuk orang lain)",
   "arab": "اللَّهُمَّ أَكْثِرْ مَالَهُ وَوَلَدَهُ وَبَارِكْ لَهُ فِيمَا أَعْطَيْتَهُ,",
   "latin": "ALLOHUMMAKTSIR MAALAHU WA WALADAHU WABAARIKLAHU FIIMAA A' THOITAHU,",
   "arti": "Ya Allah, karuniailah ia harta dan anak yang banyak dan berkahilah apa yang telah Engkau berikan kepadanya.,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 171,
   "doa": "Doa Baik untuk Sesama Muslim",
   "arab": "اللَّهُمَّ فَأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إِلَيْكَ يَوْمَ الْقِيَامَةِ,",
   "latin": "ALLOHUMMA FA AYYUMAA MU'MININ SABABTUHU FAJ'AL DZAALIKA LAHU QURBATAN ILAIKA YAUMAL QIYAAMAH,",
   "arti": "Ya Allah, sekiranya ada seorang mukmin yang pernah aku cela, maka jadikanlah celanya tersebut sebagai perkara yang dapat mendekatkan kepada-Mu di hari Kiamat kelak,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 172,
   "doa": "Berlindung dari fitnah",
   "arab": "رَضِينَا بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ رَسُولًا نَعُوذُ بِاللَّهِ مِنْ سُوءِ الْفِتَنِ,",
   "latin": "RADHIINA BILLAHI RABBAN WABIL ISLAAMI DIINAN WABI MUHAMMADIN RASUULAN NA'UUDZU BILLAH MIN SUUIL FITANI,",
   "arti": "Kami ridha Allah sebagai rabb, Islam sebagai agama, dan Muhammad sebagai utusan, kami berlindung kepada Allah dari keburukan fitnah,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 173,
   "doa": "Berlindung dari sifat penakut pelit malas dan hina",
   "arab": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَالحَزَنِ، وَالعَجْزِ وَالكَسَلِ، وَالبُخْلِ وَالجُبْنِ، وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ,",
   "latin": "ALLAHUMMA INNI A'UUDZUBIKA MINAL HAMMI WAL HAZANI WAL 'AJZI WAL KASALI WAL BUKHLI WAL JUBNI WA DLALA'ID DAINI WA GHALABATIR RIJAALI,",
   "arti": "Ya Allah, aku berlindung kepada-Mu dari keluh kesah dan kesedihan, dari kelemahan dan kemalasan, dari sifat bakhil dan penakut, dan dari lilitan hutang dan penindasan,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 174,
   "doa": "Berlindung dari fitnah kehidupan dan kematian",
   "arab": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ، وَالجُبْنِ وَالبُخْلِ وَالهَرَمِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ المَحْيَا وَالمَمَاتِ,",
   "latin": "ALLAHUMMA INNI A'UUDZUBIKA MINAL 'AJZI WAL KASALI WAL JUBNI WAL BUKHLI WAL HARAMI WA A'UUDZUBILKA MIN 'ADZAABIL QABRI WA A'UUDZUBIKA MIN FITNATIL MAHYAA WAL MAMAAT,",
   "arti": "Ya Allah, aku berlindung kepada-Mu dari kelemahan, kemalasan, pengecut, kekikiran dan kepikunan. Dan aku berlindung kepada-Mu dari siksa kubur dan berlindung kepada-Mu dari fitnah kehidupan dan kematian,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 175,
   "doa": "Berlindung dari dosa-dosa keberatan hutang dan pikun",
   "arab": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الكَسَلِ وَالهَرَمِ، وَالمَأْثَمِ وَالمَغْرَمِ، وَمِنْ فِتْنَةِ القَبْرِ، وَعَذَابِ القَبْرِ، وَمِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ، وَمِنْ شَرِّ فِتْنَةِ الغِنَى، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الفَقْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ المَسِيحِ الدَّجَّالِ، اللَّهُمَّ اغْسِلْ عَنِّي خَطَايَايَ بِمَاءِ الثَّلْجِ وَالبَرَدِ، وَنَقِّ قَلْبِي مِنَ الخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ المَشْرِقِ وَالمَغْرِبِ,",
   "latin": "ALLAHUMMA INNI A'UUDZUBIKA MINAL KASALI WAL HARAMI WAL MA`TSAMI WAL MAGHRAMI WAMIN FITNATIL QABRI WA 'ADZAABIL QABRI WAMIN FITNATIN NAARI WA 'AZAABIN NAARI WAMIN SYARRI FITNATIL GHANIY WA 'A'UUDZUBIKA MIN FITNATIL FAQRI WA A'UUDZUBIKA MIN FITNATIL MASIIHID DAJJAL, ALLHUMMAGHSIL 'ANNII KHATHAAYAYA BIMAAIS SALJI WALBARADI WANAQQI QALBII MINAL KHATHAAYAYA KAMAA NAQQAITATS TSAUBAL ABYADL MINAD DANAS WABAA'ID BAINI WABAINAL KHATHAAYAYA KAMAA BAA'ADTA BAINAL MASYRIQI WAL MAGHRIBI,",
   "arti": "Ya Allah, aku berlindung kepada-Mu dari rasa malas, kepikunan, kesalahan dan terlilit hutang, dan dari fitnah kubur serta siksa kubur, dan dari fitnah neraka dan siksa neraka dan dari buruknya fitnah kekayaan dan aku berlindung kepada-Mu dari buruknya fitnah kefakiran serta aku berlindung kepada-Mu dari fitnah Al Masih Ad Dajjal. Ya Allah, bersihkanlah kesalahan-kesalahanku dengan air salju dan air embun, sucikanlah hatiku dari kotoran-kotoran sebagaimana Engkau menyucikan baju yang putih dari kotoran. Dan jauhkanlah antara diriku dan kesalahan-kesalahanku sebagaimana Engkau jauhkan antara timur dan barat,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 176,
   "doa": "Berlindung dari dosa-dosa keberatan hutang dan pikun 2",
   "arab": "اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ,",
   "latin": "ALLAAHUMMAKFINII BIHALAALIKA 'AN HARAAMIK, WA AGHNINII BIFADHLIKA 'AMMAN SIWAAK,",
   "arti": "Ya Allah, cukupkanlah aku dengan kehalalanMu sehingga tidak memerlukan keharamanMu, dan jadikanlah aku kaya sehingga tidak butuh kepada selainMu,",
   "cara": "Keberatan hutang,",
   "utama": "seandainya memiliki hutang sebesar gunung Shir niscaya Allah akan membayarkannya,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 177,
   "doa": "Berlindung dari musibah / celaka",
   "arab": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ  مِنْ جَهْدِ الْبَلَاءِ وَدَرَكِ الشَّقَاءِ وَسُوءِ الْقَضَاءِ وَشَمَاتَةِ الْأَعْدَاءِ,",
   "latin": "ALLOHUMMA INNII A'UUDZUBIKA MIN JAHDILBALAA I WADAROKISYSYAQOO I WASUU ILQODLOO I WASYAMAATATIL A'DAA I,",
   "arti": "Ya Allah, aku berlindung kepada-Mu dari cobaan yang memayahkan, kesengsaraan yang menderitakan, takdir yang buruk dan cacian musuh.' Sufyan mengatakan,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 178,
   "doa": "Berlindung dari amal jelek",
   "arab": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ,",
   "latin": "ALLAHUMMA INNI A'UUDZU BIKA MIN SYARRI MAA 'AMILTU WA MIN SYARRI MAA LAM A'MAL,",
   "arti": "Ya Allah, aku berlindung kepada-Mu dari keburukan perbuatan yang telah aku lakukan dan yang belum aku lakukan,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Muslim,"
 },
 {
   "no": 179,
   "doa": "Berlindung dari kesesatan",
   "arab": "اللَّهُمَّ لَكَ أَسْلَمْتُ وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَإِلَيْكَ أَنَبْتُ وَبِكَ خَاصَمْتُ اللَّهُمَّ إِنِّي أَعُوذُ بِعِزَّتِكَ لَا إِلَهَ إِلَّا أَنْتَ أَنْ تُضِلَّنِي أَنْتَ الْحَيُّ الَّذِي لَا يَمُوتُ وَالْجِنُّ وَالْإِنْسُ يَمُوتُونَ,",
   "latin": "ALLAHUMMA LAKA ASLAMTU WABIKA AAMANTU, WA'ALAIKA TAWAKKALTU WAILAIKA ANABTU WABIKA KHASHAMTU, INNII A'UUDZU BI'IZZATIKA LAA-ILAAHA-ILLAA ANTA ANTUDHILLANII, ANTAL HAYYUL LADZII LAA YAMUUTU WAL JINNU WAL INSU YAMUUTUNNA,",
   "arti": "Ya Allah, sesunguhnya hanya kepada-Mu lah aku berserah diri, hanya kepada-Mu lah aku beriman, hanya kepada-Mu lah aku bertawakal, hanya kepada-Mu lah aku kembali, dan hanya karena-Mu lah aku memusuhi musuh-musuh-Mu. Ya Allah, sesungguhnya aku berlindung kepada keagungan-Mu yang tiada Tuhan selain Engkau- dari Engkau menyesatkanku. Engkaulah yang hidup dan tidak akan pernah mati, sedangkan jin dan manusia pasti akan mati,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Muslim,"
 },
 {
   "no": 180,
   "doa": "Berlindung dari jeleknya perbuatan anggota badan",
   "arab": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ سَمْعِي وَمِنْ شَرِّ بَصَرِي وَمِنْ شَرِّ لِسَانِي وَمِنْ شَرِّ قَلْبِي وَمِنْ شَرِّ مَنِيِّي,",
   "latin": "ALLAAHUMMA INNII A'UUDZU BIKA MIN SYARRI SAM'II, WA MIN SYARRI BASHARII, WA MIN SYARRI LISAANII, WA MIN SYARRI QALBII, WA MIN SYARRI MANIYYII,",
   "arti": "Ya Allah, aku berlindung kepadaMu dari keburukan telingaku, dari keburukan mataku, dari keburukan lisanku, dari keburukan hatiku, dan dari keburukan kemaluanku,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "Doa perlindungan,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 181,
   "doa": "Berlindung dari penganiayaan",
   "arab": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْفَقْرِ وَالْقِلَّةِ وَالذِّلَّةِ، وَأَنْ تَظْلِمَ أَوْ تُظْلَمَ,",
   "latin": "ALLOHUMMA INNII A'UUDZUBIKA MINAL FAQRI WALQILLATI WADZDZILAATI WA AN TADZLIMA AU TUDZLUM,",
   "arti": "Ya Allah, aku berlindung kepada-Mu dari kefakiran dan kekurangan dan kehinaan dan berbuat dzalim dan di dzalimi,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Ibnu Majah,"
 },
 {
   "no": 182,
   "doa": "Doa Ketika Terbangun Malam",
   "arab": "لاَ إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، الحَمْدُ لِلَّهِ، وَسُبْحَانَ اللَّهِ، وَلاَ إِلَهَ إِلَّا اللَّهُ، وَاللَّهُ أَكْبَرُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلَّا بِاللَّهِ,",
   "latin": "laa ilaaha illallah wahdahu laa syariika lahu, lahul mulku wa lahul hamdu wa huwa 'alaa kulli syai-in qadiir. Alhamdulillahi wa subhaanallah wa laa ilaaha illallah wallahu akbar wa laa haula wa laa quwwata illa billah,",
   "arti": "Tidak ada ilah yang berhaq disembah kecuali Allah satu-satunya, tidak ada sekutu bagiNya. Dialah yang memiliki kerajaan dan baginNya segala pujian dan Dia berkuasa atas segala sesuatu. Segala puji bagi Allah dan Maha Suci Allah dan tidak ada ilah kecuali Allah dan Allah Maha Besar dan tidak ada daya dan upaya kecuali dengan Dia,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 183,
   "doa": "istighfar",
   "arab": "اللَّهُمَّ اغْفِرْ لِي / اَسْتَغْفِرُ اللَّه,",
   "latin": "Allahummaghfirlii / ASTAGHFIRULLAAH,",
   "arti": "Ya Allah ampunilah aku,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 184,
   "doa": "",
   "arab": "",
   "latin": "",
   "arti": "",
   "cara": "",
   "utama": "",
   "sumber": ""
 },
 {
   "no": 185,
   "doa": "Al A'rof 23 Doa Nabi Adam AS)",
   "arab": "رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ,",
   "latin": "ROBBANAA DZOLAMNAA ANFUSANAA WA ILLAM TAGHFIRLANAA WATARHAMNAA LANAKUUNANNA MINAL KHOOSIRIIN,",
   "arti": "Ya Tuhan kami, kami telah menganiaya diri kami sendiri, dan jika Engkau tidak mengampuni kami dan memberi rahmat kepada kami, niscaya pastilah kami termasuk orang-orang yang merugi,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "Doa permohonan ampun Nabi Adam AS ketika turun ke dunia,",
   "sumber": "Al A'rof 23,"
 },
 {
   "no": 186,
   "doa": "Ibrahim 41 Mendoakan kedua Orang Tua)",
   "arab": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ,",
   "latin": ",",
   "arti": "Ya Tuhan kami, beri ampunlah aku dan kedua ibu bapaku dan sekalian orang-orang mukmin pada hari terjadinya hisab hari kiamat),",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Ibrahim 41,"
 },
 {
   "no": 187,
   "doa": "Al Hasr 10",
   "arab": "۔... رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَحِيمٌ,",
   "latin": ",",
   "arti": "... Ya Rabb kami, beri ampunlah kami dan saudara-saudara kami yang telah beriman lebih dulu dari kami, dan janganlah Engkau membiarkan kedengkian dalam hati kami terhadap orang-orang yang beriman; Ya Rabb kami, Sesungguhnya Engkau Maha Penyantun lagi Maha Penyayang,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Al Hasr 10,"
 },
 {
   "no": 188,
   "doa": "Asmaul Husna",
   "arab": "<style> .tablearab{ text-align:right; width:100%; direction:ltr;} .tablearab td{line-height:125%; font-family: arab; padding:6px 4px; direction:ltr;font-weight:bold;} .r {color:red} .b {color:blue} .g {color:green} .p {color:purple} .l {color:#8B4513} </style> <table class=tablearab><tr><td>يَااللَّهُ الَّذِي لَا إِلٰهَ إِلَّا اَنْتَ</td><td>1</td></tr><tr><td>يَارَحْمٰنُ</td><td>2</td></tr><tr><td>يَارَحِيمُ</td><td>3</td></tr><tr><td>يَامَلِكُ</td><td>4</td></tr><tr><td>يَاقُدُّوسُ</td><td>5</td></tr> <tr class=r><td>يَاسَلَامُ</td><td>6</td></tr><tr class=r><td>يَامُؤْمِنُ</td><td>7</td></tr><tr class=r><td>يَامُهَيْمِنُ</td><td>8</td></tr><tr class=r><td>يَاعَزِيزُ</td><td>9</td></tr><tr class=r><td>يَاجَبَّارُ</td><td>10</td></tr> <tr class=g><td>يَامُتَكَبِّرُ</td><td>11</td></tr><tr class=g><td>يَاخَالِقُ</td><td>12</td></tr><tr class=g><td>يَابَارِئُ</td><td>13</td></tr><tr class=g><td>يَامُصَوِّرُ</td><td>14</td></tr><tr class=g><td>يَاغَفَّارُ</td><td>15</td></tr> <tr class=b><td>يَاقَهَّارُ</td><td>16</td></tr><tr class=b><td>يَاوَهَّابُ</td><td>17</td></tr><tr class=b><td>يَارَزَّاقُ</td><td>18</td></tr><tr class=b><td>يَافَتَّاحُ</td><td>19</td></tr><tr class=b><td>يَاعَلِيمُ</td><td>20</td></tr> <tr class=l><td>يَاقَابِضُ</td><td>21</td></tr><tr class=l><td>يَابَاسِطُ</td><td>22</td></tr><tr class=l><td>يَاخَافِضُ</td><td>23</td></tr><tr class=l><td>يَارَافِعُ</td><td>24</td></tr><tr class=l><td>يَامُعِزُّ</td><td>25</td></tr> <tr class=p><td>يَامُذِلُّ</td><td>26</td></tr><tr class=p><td>يَاسَمِيعُ</td><td>27</td></tr><tr class=p><td>يَابَصِيرُ</td><td>28</td></tr><tr class=p><td>يَاحَكَمُ</td><td>29</td></tr><tr class=p><td>يَاعَدْلُ</td><td>30</td></tr> <tr><td>يَالَطِيفُ</td><td>31</td></tr><tr><td>يَاخَبِيرُ</td><td>32</td></tr><tr><td>يَاحَلِيمُ</td><td>33</td></tr><tr><td>يَاعَظِيمُ</td><td>34</td></tr><tr><td>يَاغَفُورُ</td><td>35</td></tr> <tr class=r><td>يَاشَكُورُ</td><td>36</td></tr><tr class=r><td>يَاعَلِيُّ</td><td>37</td></tr><tr class=r><td>يَاكَبِيرُ</td><td>38</td></tr><tr class=r><td>يَاحَفِيظُ</td><td>39</td></tr><tr class=r><td>يَامُقِيتُ</td><td>40</td></tr> <tr class=g><td>يَاحَسِيبُ</td><td>41</td></tr><tr class=g><td>يَاجَلِيلُ</td><td>42</td></tr><tr class=g><td>يَاكَرِيمُ</td><td>43</td></tr><tr class=g><td>يَارَقِيبُ</td><td>44</td></tr><tr class=g><td>يَامُجِيبُ</td><td>45</td></tr> <tr class=b><td>يَاوَاسِعُ</td><td>46</td></tr><tr class=b><td>يَاحَكِيمُ</td><td>47</td></tr><tr class=b><td>يَاوَدُودُ</td><td>48</td></tr><tr class=b><td>يَامَجِيدُ</td><td>49</td></tr><tr class=b><td>يَابَاعِثُ</td><td>50</td></tr> <tr class=l><td>يَاشَهِيدُ</td><td>51</td></tr><tr class=l><td>يَاحَقُّ</td><td>52</td></tr><tr class=l><td>يَاوَكِيلُ</td><td>53</td></tr><tr class=l><td>يَاقَوِيُّ</td><td>54</td></tr><tr class=l><td>يَامَتِينُ</td><td>55</td></tr> <tr class=p><td>يَاوَلِيُّ</td><td>56</td></tr><tr class=p><td>يَاحَمِيدُ</td><td>57</td></tr><tr class=p><td>يَامُحْصِي</td><td>58</td></tr><tr class=p><td>يَامُبْدِئُ</td><td>59</td></tr><tr class=p><td>يَامُعِيدُ</td><td>60</td></tr> <tr><td>يَامُحْيِي</td><td>61</td></tr><tr><td>يَامُمِيتُ</td><td>62</td></tr><tr><td>يَاحَيُّ</td><td>63</td></tr><tr><td>يَاقَيُّومُ</td><td>64</td></tr><tr><td>يَاوَاجِدُ</td><td>65</td></tr> <tr class=r><td>يَامَاجِدُ</td><td>66</td></tr><tr class=r><td>يَاوَاحِدُ</td><td>67</td></tr><tr class=r><td>يَاصَمَدُ</td><td>68</td></tr><tr class=r><td>يَاقَادِرُ</td><td>69</td></tr><tr class=r><td>يَامُقْتَدِرُ</td><td>70</td></tr> <tr class=g><td>يَامُقَدِّمُ</td><td>71</td></tr><tr class=g><td>يَامُؤَخِّرُ</td><td>72</td></tr><tr class=g><td>يَاأَوَّلُ</td><td>73</td></tr><tr class=g><td>يَاآخِرُ</td><td>74</td></tr><tr class=g><td>يَاظَاهِرُ</td><td>75</td></tr> <tr class=b><td>يَابَاطِنُ</td><td>76</td></tr><tr class=b><td>يَاوَالِيَ</td><td>77</td></tr><tr class=b><td>يَامُتَعَالِي</td><td>78</td></tr><tr class=b><td>يَابَرُّ</td><td>79</td></tr><tr class=b><td>يَاتَوَّابُ</td><td>80</td></tr> <tr class=l><td>يَامُنْتَقِمُ</td><td>81</td></tr><tr class=l><td>يَاعَفُوُّ</td><td>82</td></tr><tr class=l><td>يَارَءُوفُ</td><td>83</td></tr><tr class=l><td>يَامَالِكَ الْمُلْكِ</td><td>84</td></tr><tr class=l><td>يَاذَا الْجَلَالِ وَالْإِكْرَامِ</td><td>85</td></tr> <tr class=p><td>يَامُقْسِطُ</td><td>86</td></tr><tr class=p><td>يَاجَامِعُ</td><td>87</td></tr><tr class=p><td>يَاغَنِيُّ</td><td>88</td></tr><tr class=p><td>يَامُغْنِي</td><td>89</td></tr><tr class=p><td>يَامَانِعُ</td><td>90</td></tr> <tr><td>يَاضَارُّ</td><td>91</td></tr><tr><td>يَانَافِعُ</td><td>92</td></tr><tr><td>يَانُورُ</td><td>93</td></tr><tr><td>يَاهَادِي</td><td>94</td></tr><tr><td>يَابَدِيعُ</td><td>95</td></tr> <tr class=r><td>يَابَاقِي</td><td>96</td></tr><tr class=r><td>يَاوَارِثُ</td><td>97</td></tr><tr class=r><td>يَارَشِيدُ</td><td>98</td></tr><tr class=r><td>يَاصَبُورُ</td><td>99</td></tr></table>,",
   "latin": ",",
   "arti": "<table><tr ><td>1</td><td>Ya Allah, Tuhan yang tidak ada Tuhan selain Engkau</td></tr><tr ><td>2</td><td>Yang Maha Pengasih</td></tr><tr ><td>3</td><td>Yang Maha Penyayang</td></tr><tr ><td>4</td><td>Yang Maha Merajai/Memerintah</td></tr><tr ><td>5</td><td>Yang Maha Suci</td></tr><tr class=r><td>6</td><td>Yang Maha Memberi Kesejahteraan</td></tr><tr class=r><td>7</td><td>Yang Maha Memberi Keamanan</td></tr><tr class=r><td>8</td><td>Yang Maha Pemelihara</td></tr><tr class=r><td>9</td><td>Yang Maha Perkasa</td></tr><tr class=r><td>10</td><td>Yang Memiliki Mutlak Kegagahan</td></tr><tr class=g><td>11</td><td>Yang Maha Megah, Yang Memiliki Kebesaran</td></tr><tr class=g><td>12</td><td>Yang Maha Pencipta</td></tr><tr class=g><td>13</td><td>Yang Maha Melepaskan Membuat, Membentuk, Menyeimbangkan)</td></tr><tr class=g><td>14</td><td>Yang Maha Membentuk Rupa makhluknya)</td></tr><tr class=g><td>15</td><td>Yang Maha Pengampun</td></tr><tr class=b><td>16</td><td>Yang Maha Memaksa</td></tr><tr class=b><td>17</td><td>Yang Maha Pemberi Karunia</td></tr><tr class=b><td>18</td><td>Yang Maha Pemberi Rezeki</td></tr><tr class=b><td>19</td><td>Yang Maha Pembuka Rahmat</td></tr><tr class=b><td>20</td><td>Yang Maha Mengetahui Memiliki Ilmu)</td></tr><tr class=l><td>21</td><td>Yang Maha Menyempitkan makhluknya)</td></tr><tr class=l><td>22</td><td>Yang Maha Melapangkan makhluknya)</td></tr><tr class=l><td>23</td><td>Yang Maha Merendahkan makhluknya)</td></tr><tr class=l><td>24</td><td>Yang Maha Meninggikan makhluknya)</td></tr><tr class=l><td>25</td><td>Yang Maha Memuliakan makhluknya)</td></tr><tr class=p><td>26</td><td>Yang Maha Menghinakan makhluknya)</td></tr><tr class=p><td>27</td><td>Yang Maha Mendengar</td></tr><tr class=p><td>28</td><td>Yang Maha Melihat</td></tr><tr class=p><td>29</td><td>Yang Maha Menetapkan</td></tr><tr class=p><td>30</td><td>Yang Maha Adil</td></tr><tr ><td>31</td><td>Yang Maha Lembut</td></tr><tr ><td>32</td><td>Yang Maha Mengenal</td></tr><tr ><td>33</td><td>Yang Maha Penyantun</td></tr><tr ><td>34</td><td>Yang Maha Agung</td></tr><tr ><td>35</td><td>Yang Maha Memberi Pengampunan</td></tr><tr class=r><td>36</td><td>Yang Maha Pembalas Budi Menghargai)</td></tr><tr class=r><td>37</td><td>Yang Maha Tinggi</td></tr><tr class=r><td>38</td><td>Yang Maha Besar</td></tr><tr class=r><td>39</td><td>Yang Maha Memelihara</td></tr><tr class=r><td>40</td><td>Yang Maha Pemberi Kecukupan</td></tr><tr class=g><td>41</td><td>Yang Maha Membuat Perhitungan</td></tr><tr class=g><td>42</td><td>Yang Maha Luhur</td></tr><tr class=g><td>43</td><td>Yang Maha Pemurah</td></tr><tr class=g><td>44</td><td>Yang Maha Mengawasi</td></tr><tr class=g><td>45</td><td>Yang Maha Mengabulkan</td></tr><tr class=b><td>46</td><td>Yang Maha Luas</td></tr><tr class=b><td>47</td><td>Yang Maha Maka Bijaksana</td></tr><tr class=b><td>48</td><td>Yang Maha Mengasihi</td></tr><tr class=b><td>49</td><td>Yang Maha Mulia</td></tr><tr class=b><td>50</td><td>Yang Maha Membangkitkan</td></tr><tr class=l><td>51</td><td>Yang Maha Menyaksikan</td></tr><tr class=l><td>52</td><td>Yang Maha Benar</td></tr><tr class=l><td>53</td><td>Yang Maha Memelihara</td></tr><tr class=l><td>54</td><td>Yang Maha Kuat</td></tr><tr class=l><td>55</td><td>Yang Maha Kokoh</td></tr><tr class=p><td>56</td><td>Yang Maha Melindungi</td></tr><tr class=p><td>57</td><td>Yang Maha Terpuji</td></tr><tr class=p><td>58</td><td>Yang Maha Mengalkulasi Menghitung Segala Sesuatu)</td></tr><tr class=p><td>59</td><td>Yang Maha Memulai</td></tr><tr class=p><td>60</td><td>Yang Maha Mengembalikan Kehidupan</td></tr><tr ><td>61</td><td>Yang Maha Menghidupkan</td></tr><tr ><td>62</td><td>Yang Maha Mematikan</td></tr><tr ><td>63</td><td>Yang Maha Hidup</td></tr><tr ><td>64</td><td>Yang Maha Mandiri</td></tr><tr ><td>65</td><td>Yang Maha Penemu</td></tr><tr class=r><td>66</td><td>Yang Maha Mulia</td></tr><tr class=r><td>67</td><td>Yang Maha Tunggal</td></tr><tr class=r><td>68</td><td>Yang Maha Dibutuhkan, Tempat Meminta</td></tr><tr class=r><td>69</td><td>Yang Maha Menentukan, Maha Menyeimbangkan</td></tr><tr class=r><td>70</td><td>Yang Maha Berkuasa</td></tr><tr class=g><td>71</td><td>Yang Maha Mendahulukan</td></tr><tr class=g><td>72</td><td>Yang Maha Mengakhirkan</td></tr><tr class=g><td>73</td><td>Yang Maha Awal</td></tr><tr class=g><td>74</td><td>Yang Maha Akhir</td></tr><tr class=g><td>75</td><td>Yang Maha Nyata</td></tr><tr class=b><td>76</td><td>Yang Maha Ghaib</td></tr><tr class=b><td>77</td><td>Yang Maha Memerintah</td></tr><tr class=b><td>78</td><td>Yang Maha Tinggi</td></tr><tr class=b><td>79</td><td>Yang Maha Penderma Maha Pemberi Kebajikan)</td></tr><tr class=b><td>80</td><td>Yang Maha Penerima Tobat</td></tr><tr class=l><td>81</td><td>Yang Maha Pemberi Balasan</td></tr><tr class=l><td>82</td><td>Yang Maha Pemaaf</td></tr><tr class=l><td>83</td><td>Yang Maha Pengasuh</td></tr><tr class=l><td>84</td><td>Yang Maha Penguasa Kerajaan Semesta)</td></tr><tr class=l><td>85</td><td>Yang Maha Pemilik Kebesaran dan Kemuliaan</td></tr><tr class=p><td>86</td><td>Yang Maha Pemberi Keadilan</td></tr><tr class=p><td>87</td><td>Yang Maha Mengumpulkan</td></tr><tr class=p><td>88</td><td>Yang Maha Kaya</td></tr><tr class=p><td>89</td><td>Yang Maha Pemberi Kekayaan</td></tr><tr class=p><td>90</td><td>Yang Maha Mencegah</td></tr><tr ><td>91</td><td>Yang Maha Penimpa Kemudharatan</td></tr><tr ><td>92</td><td>Yang Maha Memberi Manfaat</td></tr><tr ><td>93</td><td>Yang Maha Bercahaya Menerangi, Memberi Cahaya)</td></tr><tr ><td>94</td><td>Yang Maha Pemberi Petunjuk</td></tr><tr ><td>95</td><td>Yang Maha Pencipta Yang Tiada Bandingannya</td></tr><tr class=r><td>96</td><td>Yang Maha Kekal</td></tr><tr class=r><td>97</td><td>Yang Maha Pewaris</td></tr><tr class=r><td>98</td><td>Yang Maha Pandai</td></tr><tr class=r><td>99</td><td>Yang Maha Sabar</td></tr></table>,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 189,
   "doa": "Shalawat",
   "arab": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ فِي الْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ,",
   "latin": "ALLOOHUMMA SHOLLI 'ALAA MUHAMMAD WA'ALAA AALI MUHAMMAD, KAMAA SHOLLAITA 'ALAA AALI IBROOHIIMA WABAARIK 'ALAA MUHAMMAD WA'ALAA AALI MUHAMMAD KAMAA BAAROKTA 'ALAA AALI IBROOHIIMA FIL'AALAMIINA INNAKA HAMIIDUN MAJIID,",
   "arti": "Ya Allah, berilah shalawat atas Muhammad dan keluarga Muhammad sebagaimana Engkau memberi shalawat atas keluarga Ibrahim, dan berilah berkah atas Muhammad dan keluarga Muhammad sebagaimana Engkau memberi berkah kepada keluarga Ibrahim di dunia. Engkau Maha Terpuji dan Maha Mulia,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Muslim,"
 },
 {
   "no": 190,
   "doa": "Doa bangun malam",
   "arab": "اللَّهُمَّ لَكَ الحَمْدُ، أَنْتَ نُورُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الحَمْدُ، أَنْتَ قَيِّمُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الحَمْدُ، أَنْتَ الحَقُّ، وَوَعْدُكَ حَقٌّ، وَقَوْلُكَ حَقٌّ، وَلِقَاؤُكَ حَقٌّ، وَالجَنَّةُ حَقٌّ، وَالنَّارُ حَقٌّ، وَالسَّاعَةُ حَقٌّ، وَالنَّبِيُّونَ حَقٌّ، وَمُحَمَّدٌ حَقٌّ، اللَّهُمَّ لَكَ أَسْلَمْتُ، وَعَلَيْكَ تَوَكَّلْتُ، وَبِكَ آمَنْتُ، وَإِلَيْكَ أَنَبْتُ، وَبِكَ خَاصَمْتُ، وَإِلَيْكَ حَاكَمْتُ، فَاغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ، لاَ إِلَهَ إِلَّا أَنْتَلاَ إِلَهَ غَيْرُكَ),",
   "latin": "ALLAHUMA LAKAL HAMDU, ANTA NUURUSSAMAWAATI WAL ARDH WAMAN FIIHINNA, WALAKAL HAMDU ANTA QAYYIMUSSAWAATI WAL ARDH WAMAN FIIHINNA, WALAKAL HAMDU ANTAL HAQQU, WAWA'DUKA HAQQ, WAQAULUKA HAQQ, WALIQAA'UKA HAQQ, WALJANNATU HAQQ, WANNAARU HAQQ, WASSAA'ATU HAQQ, WANNABIYUUN HAQQ, WAMUHAMMADUN HAQQ. ALLAAHUMMA LAKA ASLAMTU WABIKA AAMANTU WAILAIKA TAWAKKALTU, WAILAIKA ANABTU, WABIKA KHAASHAMTU, WAILAIKA HAAKAMTU, FAHGHFIRLII MA QADDAMMTU WAMAA AKHKHARTU, WAMA ASRARTU WAMAA A'LANTU, ANTAL MUQADDIM WA ANTAL MU`AKHIR LAA-ILAAHA ILLAA ANTA LAA ILAAHA ILLA GHAIRUKA),",
   "arti": "Ya Allah, bagi-Mu lah segala puji, Engkau cahaya langit dan bumi dan sesuatu yang berada di antara keduanya, bagiMu segala puji, Engkau adalah pemelihara langit dan bumi dan siapa saja yang menghuninya, Engkau adalah benar, dan janji-Mu benar, firman-Mu benar, pertemuan dengan-Mu benar, surga-Mu benar, neraka-Mu benar, kiamat benar, para nabi benar, dan Muhammad adalah benar. Ya Allah, kepada-Mu aku berserah, kepada-Mu aku beriman, kepada-Mu aku bertawakkal, kepada-Mu aku menyandarkan diri, karena-Mu aku memusuhi, dan kepada-Mu aku meminta penghakiman, maka ampunilah bagiku apa yang telah aku perbuat dan apa yang belum aku lakukan, apa yang aku lakukan secara sembunyi-sembunyi dan apa yang aku lakukan secara terang-terangan, Engkaulah Dzat Yang Maha terdahulu dan Engkaulah Dzat Yang Maha terakhir, tiada sesembahan yang hak selain Engkau atau tiada sesembahan selain Engkau,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 191,
   "doa": "Bangun tidur untuk sholat malam",
   "arab": "اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَوَاتِ وَالْأَرْضِ وَلَكَ الْحَمْدُ أَنْتَ قَيَّامُ السَّمَوَاتِ وَالْأَرْضِ وَلَكَ الْحَمْدُ أَنْتَ رَبُّ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ أَنْتَ الْحَقُّ وَوَعْدُكَ الْحَقُّ وَلِقَاؤُكَ حَقٌّ وَالْجَنَّةُ حَقٌّ وَالنَّارُ حَقٌّ وَالسَّاعَةُ حَقٌّ اللَّهُمَّ لَكَ أَسْلَمْتُ وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَإِلَيْكَ أَنَبْتُ وَبِكَ خَاصَمْتُ وَإِلَيْكَ حَاكَمْتُ فَاغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ أَنْتَ إِلَهِي لَا إِلَهَ إِلَّا أَنْتَ,",
   "latin": "ALLAAHUMMA LAKAL HAMDU ANTA NUURUS SAMAAWAATI WAL ARDHI WA LAKAL HAMDU ANTA QAYYUUMUS SAMAAWAATI WAL ARDHI, WA LAKAL HAMDU ANTA RABBUS SAMAAWAATI WAL ARDHI WA MAN FIIHINNA, ANTAL HAQQU WA WA'DUKAL HAQQU WA LIQAAUKA HAQQUN WAL JANNATU HAQQUN WAS SAA'ATU HAQQUN, ALLAAHUMMA LAKA ASLAMTU WA BIKA AAMANTU WA 'ALAIKA TAWAKKALTU WA ILAIKA ANABTU WA BIKA KHAASHAMTU WA ILAIKA HAAKAMTU FAGHFIR LII MAA QADDAMTU WA MAA AKHKHARTU WA MAA ASRARTU WA MAA A'LANTU, ANTA ILAAHII, LAA ILAAHA ILLAA ANTA,",
   "arti": "Ya Allah, segala puji bagiMu, Engkau Yang memberikan cahaya langit dan bumi, segala puji bagiMu, Engkau Yang terus mengurus langit dan bumi. Segala puji bagiMu, Engkau Tuhan langit dan bumi dan yang ada padanya. Engkau Maha Benar, janjiMu adalah benar, pertemuan denganMu adalah benar, Surga adalah benar, Hari Kiamat adalah benar. Ya Allah, kepadaMu aku berserah diri, kepadaMu aku beriman, kepadaMu aku bertawakal, kepadaMu aku kembali, dengan pertolonganMu aku berseteru, dan kepadaMu aku berhukum, maka ampunilah apa yang telah aku lakukan dan yang belum aku lakukan, apa yang aku sembunyikan dan apa yang aku nampakkan. Engkau adalah Tuhan sembahanku, tidak ada tuhan yang berhak disembah kecuali Engkau,",
   "cara": "Ketika bangun untuk sholat,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 192,
   "doa": "Iftitaf Sholat Malam",
   "arab": "اللَّهُمَّ رَبَّ جِبْرِيلَ وَمِيكَائِيلَ وَإِسْرَافِيلَ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنْ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ,",
   "latin": "ALLAAHUMMA RABBA JIBRIIL WA MIIKAAIIL WA ISRAAFIIL, FAATHIRAS SAMAAWAATI WAL ARDHI 'AALIMAL GHAIBI WASY SYAHAADAH ANTA TAHKUMU BAINA 'IBAADIKA FIIMAA KAANUU FIIHI YAKHTALIFUUN. IHDINII LIMAAKH TULIFA FIIHI MINAL HAQQI BIIDZNIKA INNAKA TAHDII MAN TASYAA-U ILAA SHIRAATHIN MUSTAQIIM,",
   "arti": "Ya Allah Tuhan Jibril, Mikail, dan Israfil, Pencipta langit dan bumi, Yang Maha Mengetahui perkara yang tersembunyi dan yang nampak, Engkau memberikan keputusan diantara para hambaMu dalam perkara yang mereka perselisihkan. Berilah aku petunjuk mendapatkan kebenaran yang diperselisihkan dengan idzinMu, sesungguhnya Engkau memberikan petunjuk orang yang Engkau kehendaki kepada jalan yang lurus,",
   "cara": "Bacaan iftitah sholat malam,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 193,
   "doa": "Iftitaf Sholat Malam 2",
   "arab": "وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالأَرْضَ حَنِيفًا وَمَا أَنَا مِنَ المُشْرِكِينَ، إِنَّ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ العَالَمِينَ، لَا شَرِيكَ لَهُ، وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ المُسْلِمِينَ، اللَّهُمَّ أَنْتَ المَلِكُ لَا إِلَهَ إِلَّا أَنْتَ، أَنْتَ رَبِّي وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِي وَاعْتَرَفْتُ بِذَنْبِي، فَاغْفِرْ لِي ذُنُوبِي جَمِيعًا، إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، وَاهْدِنِي لِأَحْسَنِ الأَخْلَاقِ، لَا يَهْدِي لِأَحْسَنِهَا إِلَّا أَنْتَ، وَاصْرِفْ عَنِّي سَيِّئَهَا، لَا يَصْرِفُ عَنِّي سَيِّئَهَا إِلَّا أَنْتَ، آمَنْتُ بِكَ، تَبَارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ,",
   "latin": "WAJJAHTU WAJHIYA LILLADZII FATHARAS SAMAAWAATI WAL ARDHA HANIIFAN WA MAA ANA MINAL MUSYRIKIIN, INNA SHALAATII WA NUSUKII WA MAHYAAYA WA MAMAATII LILLAAHI RABBIL 'AALAMIIN, LAA SYARIIKA LAHU WA BIDZAALIKA UMIRTU WA ANA MINAL MUSLIMIIN. ALLAAHUMMA ANTAL MALIKU LAA ILAAHA ILLAA ANTA, ANTA RABBII WA ANA 'ABDUKA, ZHALAMTU NAFSII WA'TARAFTU BIDZANBII, FAGHFIR LII DZUNUUBII JAMII'AN. INNAHU LAA YAGHFIRUDZ DZUNUUBA ILLAA ANTA WAHDINII LIAHSANIL AKHLAAQI LAA YAHDII LIAHSANIHAA ILLAA ANTA WASHRIF 'ANNII SAYYIAHAA INNAHUU LAA YASHRIFU 'ANNII SAYYIAHAA ILLAA ANTA, AAMANTU BIKA, TABAARAKTA WA TA'AALAITA ASTAGHFIRUKA WA ATUUBU ILAIKA,",
   "arti": "Aku arahkan wajahku dengan lurus kepada Dzat yang telah menciptakan langit dan bumi dan aku bukan termasuk orang-orang yang berbuat syirik. Sesungguhnya shalatku, dan sembelihanku serta kehidupan dan matiku adalah untuk Allah Tuhan semesta alam, tidak ada sekutu bagiNya dan karena itu aku diperintahkan dan aku termasuk orang-orang yang berserah diri. Ya Allah, Engkau adalah Raja, tidak ada tuhan yang berhak disembah kecuali Engkau, Maha Suci Engkau, Engkau adalah Tuhanku, dan aku adalah hambaMu. Aku telah menzhalimi diriku dan aku telah mengakui dosaku, maka ampunilah dosa-dosaku semua, karena sesungguhnya tidak ada yang yang dapat mengampuni dosa kecuali Engkau. Dan berilah aku petunjuk untuk berakhlak yang terpuji, tidak ada yang dapat memberi petunjuk untuk berakhlak terpuji kecuali Engkau dan palingkan dariku keburukannya, tidak ada yang dapat memalingkan dariku keburukannya kecuali Engkau. Aku memenuhi panggilanmu dan seluruh kebaikan ada ditanganMu, dan seluruh keburukan tidak dinisbatkan kepadaMu. Aku memohon pertolongan kepadaMu, dan berlindung kepadaMu, Maha Suci Engkau dan Maha Tinggi Engkau, aku mohon ampunan dan bertaubat kepadaMu,",
   "cara": "Bacaan iftitah sholat malam 1 Rangkaian dengan doa selanjutnya),",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 194,
   "doa": "Rukuk Sholat Malam",
   "arab": "اللَّهُمَّ لَكَ رَكَعْتُ وَبِكَ آمَنْتُ وَلَكَ أَسْلَمْتُ خَشَعَ لَكَ سَمْعِي وَبَصَرِي وَمُخِّي وَعِظَامِي وَعَصَبِي,",
   "latin": "ALLAAHUMMA LAKA RAKA'TU WA BIKA AAMANTU WA LAKA ASLAMTU KHASYA'A LAKA SAM'II WA BASHARII, WA MUKHKHII WA 'IZHAAMII WA 'ASHABII,",
   "arti": "Ya Allah, untukmu aku ruku', dan kepadaMu aku beriman, dan kepadaMu aku berserah diri. kepadaMu pendengaranku, penglihatanku, tulangku, dan urat syarafku patuh,",
   "cara": "Rukuk sholat malam 1 rangkaian dengan doa sebelum dan sesudahnya),",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 195,
   "doa": "I'tidal Sholat Malam",
   "arab": "اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَوَاتِ وَالْأَرَضِينَ وَمِلْءَ مَا بَيْنَهُمَا وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ,",
   "latin": "ALLAAHUMMA RABBANAA LAKAL HAMDU MIL-AS SAMAAWAATI WAL ARDHIINA WA MIL-A MAA BAINAHUMAA, WA MIL-A MAA SYI`TA MIN SYAI-IN BA'DU,",
   "arti": "Ya Allah Tuhan kami, bagiMu seluruh pujian sepenuh langit dan bumi, serta sepenuh apa yang ada diantara keduanya, dan sepenuh apa yang Engkau kehendaki setelah itu,",
   "cara": "I'tidal berdiri setelah rukuk) sholat malam 1 rangkaian dengan doa sebelum dan sesudahnya),",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 196,
   "doa": "Sujud Sholat Malam",
   "arab": "اللَّهُمَّ لَكَ سَجَدْتُ وَبِكَ آمَنْتُ وَلَكَ أَسْلَمْتُ سَجَدَ وَجْهِيَ لِلَّذِي خَلَقَهُ فَصَوَّرَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ,",
   "latin": "ALLAAHUMMA LAKA SAJADTU WA BIKA AAMANTU WA LAKA ASLAMTU, SAJADA WAJHIYA LILLADZII KHALAQAHU FASHAWWARAHU WA SYAQQA SAM'AHU WA BASHARAHU, FATABAARAKALLAAHU AHSANUL KHAALIQIIN,",
   "arti": "Ya Allah, kepadaMu aku bersujud, dan kepadaMu aku beriman, dan kepadaMu aku berserah diri, wajahku bersujud kepada Dzat Yang telah menciptakannya dan membentuknya dan membuka pendengaran dan penglihatannya, Maha Suci Allah sebaik-baik Pencipta,",
   "cara": "Sujud sholat malam 1 rangkaian dengan doa sebelum dan sesudahnya),",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 197,
   "doa": "Doa setelah tasyahud sebelum salam Sholat Malam",
   "arab": "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ لَا إِلَهَ إِلَّا أَنْتَ,",
   "latin": "ALLAAHUMMAGHFIRLII MAA QADDAMTU WA MAA AKHKHARTU WA MAA ASRARTU WA MAA A'LANTU WA MAA ANTA A'LAMU BIHII MINNII, ANTAL MUQADDIMU WA ANTAL MUAKHKHIRU LAA ILAAHA ILLAA ANTA,",
   "arti": "Ya Allah, ampunilah dosa yang telah aku lakukan dan yang aku tunda, yang aku sembunyikan dan yang aku nampakkan dan apa yang Engkau lebih mengetahuinya daripadaku. Engkau Yang mendahulukan dan Yang menunda, tidak ada tuhan yang berhak disembah kecuali Engkau,",
   "cara": "Setelah tasyahud dan sebelum salam dalam sholat malam 1 rangkaian dengan doa sebelumnya),",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 198,
   "doa": "Doa setelah tasyahud sebelum salam Witir",
   "arab": "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ وَأَعُوذُ بِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ وَأَعُوذُ بِكَ مِنْكَ لَا أُحْصِي ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ,",
   "latin": "ALLAAHUMMA INNII A'UUDZU BIRIDHAAKA MIN SAKHATHIK, WA A'UUDZU BIMU'AAFAATIKA MIN 'UQUUBATIK, WA A'UUDZU BIKA MINKA LAA UHSHII TSANAA-AN 'ALAIK, ANTA KAMAA ATSNAITA 'ALAA NAFSIK,",
   "arti": "Aku berlindung dengan keridhaanMu dari kemurkaanMu, dan dengan ampunanMu dari hukumanMu, aku tidak dapat menghitung pujian kepadaMu. Engkau sebagaimana pujian yang Engkau berikan kepada diriMu,",
   "cara": "Doa Sesudah tahiyat dan Sebelum Salam dalam sholat Witir,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 199,
   "doa": "Doa setelah witir",
   "arab": "سُبْحَانَ الْمَلِكِ الْقُدُّوسِ,",
   "latin": "Subbhanal Malikil Quddus,",
   "arti": ",",
   "cara": "Dibaca 3X, bacaan ke tiga suara lebih keras,",
   "utama": ",",
   "sumber": "H.R. Nasai,"
 },
 {
   "no": 200,
   "doa": "Setelah Selesai sholat Malam",
   "arab": "اللَّهُمَّ إِنِّي أَسْأَلُكَ رَحْمَةً مِنْ عِنْدِكَ تَهْدِي بِهَا قَلْبِي وَتَجْمَعُ بِهَا أَمْرِي وَتَلُمُّ بِهَا شَعَثِي وَتُصْلِحُ بِهَا غَائِبِي وَتَرْفَعُ بِهَا شَاهِدِي وَتُزَكِّي بِهَا عَمَلِي وَتُلْهِمُنِي بِهَا رُشْدِي وَتَرُدُّ بِهَا أُلْفَتِي وَتَعْصِمُنِي بِهَا مِنْ كُلِّ سُوءٍ اللَّهُمَّ أَعْطِنِي إِيمَانًا وَيَقِينًا لَيْسَ بَعْدَهُ كُفْرٌ وَرَحْمَةً أَنَالُ بِهَا شَرَفَ كَرَامَتِكَ فِي الدُّنْيَا وَالْآخِرَةِ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْفَوْزَ فِي الْعَطَاءِ وَنُزُلَ الشُّهَدَاءِ وَعَيْشَ السُّعَدَاءِ وَالنَّصْرَ عَلَى الْأَعْدَاءِ اللَّهُمَّ إِنِّي أُنْزِلُ بِكَ حَاجَتِي وَإِنْ قَصُرَ رَأْيِي وَضَعُفَ عَمَلِي افْتَقَرْتُ إِلَى رَحْمَتِكَ فَأَسْأَلُكَ يَا قَاضِيَ الْأُمُورِ وَيَا شَافِيَ الصُّدُورِ كَمَا تُجِيرُ بَيْنَ الْبُحُورِ أَنْ تُجِيرَنِي مِنْ عَذَابِ السَّعِيرِ وَمِنْ دَعْوَةِ الثُّبُورِ وَمِنْ فِتْنَةِ الْقُبُورِ اللَّهُمَّ مَا قَصُرَ عَنْهُ رَأْيِي وَلَمْ تَبْلُغْهُ نِيَّتِي وَلَمْ تَبْلُغْهُ مَسْأَلَتِي مِنْ خَيْرٍ وَعَدْتَهُ أَحَدًا مِنْ خَلْقِكَ أَوْ خَيْرٍ أَنْتَ مُعْطِيهِ أَحَدًا مِنْ عِبَادِكَ فَإِنِّي أَرْغَبُ إِلَيْكَ فِيهِ وَأَسْأَلُكَهُ بِرَحْمَتِكَ رَبَّ الْعَالَمِينَ اللَّهُمَّ ذَا الْحَبْلِ الشَّدِيدِ وَالْأَمْرِ الرَّشِيدِ أَسْأَلُكَ الْأَمْنَ يَوْمَ الْوَعِيدِ وَالْجَنَّةَ يَوْمَ الْخُلُودِ مَعَ الْمُقَرَّبِينَ الشُّهُودِ الرُّكَّعِ السُّجُودِ الْمُوفِينَ بِالْعُهُودِ إِنَّكَ رَحِيمٌ وَدُودٌ وَأَنْتَ تَفْعَلُ مَا تُرِيدُ اللَّهُمَّ اجْعَلْنَا هَادِينَ مُهْتَدِينَ غَيْرَ ضَالِّينَ وَلَا مُضِلِّينَ سِلْمًا لِأَوْلِيَائِكَ وَعَدُوًّا لِأَعْدَائِكَ نُحِبُّ بِحُبِّكَ مَنْ أَحَبَّكَ وَنُعَادِي بِعَدَاوَتِكَ مَنْ خَالَفَكَ اللَّهُمَّ هَذَا الدُّعَاءُ وَعَلَيْكَ الْإِجَابَةُ وَهَذَا الْجُهْدُ وَعَلَيْكَ التُّكْلَانُ اللَّهُمَّ اجْعَلْ لِي نُورًا فِي قَلْبِي وَنُورًا فِي قَبْرِي وَنُورًا مِنْ بَيْنِ يَدَيَّ وَنُورًا مِنْ خَلْفِي وَنُورًا عَنْ يَمِينِي وَنُورًا عَنْ شِمَالِي وَنُورًا مِنْ فَوْقِي وَنُورًا مِنْ تَحْتِي وَنُورًا فِي سَمْعِي وَنُورًا فِي بَصَرِي وَنُورًا فِي شَعْرِي وَنُورًا فِي بَشَرِي وَنُورًا فِي لَحْمِي وَنُورًا فِي دَمِي وَنُورًا فِي عِظَامِي اللَّهُمَّ أَعْظِمْ لِي نُورًا وَأَعْطِنِي نُورًا وَاجْعَلْ لِي نُورًا سُبْحَانَ الَّذِي تَعَطَّفَ الْعِزَّ وَقَالَ بِهِ سُبْحَانَ الَّذِي لَبِسَ الْمَجْدَ وَتَكَرَّمَ بِهِ سُبْحَانَ الَّذِي لَا يَنْبَغِي التَّسْبِيحُ إِلَّا لَهُ سُبْحَانَ ذِي الْفَضْلِ وَالنِّعَمِ سُبْحَانَ ذِي الْمَجْدِ وَالْكَرَمِ سُبْحَانَ ذِي الْجَلَالِ وَالْإِكْرَامِ,",
   "latin": "ALLAAHUMMA INNII AS-ALUKA RAHMATAN MIN 'INDIKA TAHDII BIHAA QALBII WA TAJMA'U BIHAA AMRII, WA TALUMMU BIHAA SYA'ATSII, WA TUSHLIHU BIHAA GHAAIBII, WA TARFA'U BIHAA SYAAHIDII, WA TUZAKKII BIHAA 'AMALII, WA TULHIMUNII BIHAA RUSYDII, WA TARUDDU BIHAA ULFATII, WA TA'SHIMUNII BIHAA MIN KULLI SUUIN. ALLAAHUMMA A'THINII IIMAANAN WA YAQIINAN LAISA BA'DAHU KUFRUN WA RAHMATAN ANAALU BIHAA SYARAFA KARAAMATIKA FID DUNYAA WAL AAKHIRAH, ALLAAHUMMA INNII AS-ALUKAL FAUZA FIL 'ATHAAI WA NUZULASY SYUHADAAI, WA 'AISYAS SU'ADAAI, WAN NASHRA 'ALAL A'DAAI. ALLAAHUMMA INNII UNZILU BIKA HAAJATII, WA IN QASHURA RA`YII WA DHA'UFA 'AMALII. IFTAQARTU ILAA RAHMATIKA FA-AS-ALUKA YAA QAADHIYAL UMUURI, WA YAA SYAAFIYASH SHUDUURI KAMAA TUJIIRU BAINAL BUHUURI AN TUJIIRANII MIN 'ADZAABIS SA'IIRI, WA MIN DA'WATITS TSUBUURI, WA MIN FITNATIL QUBUURI. ALLAAHUMMA MAA QASHURA 'ANHU RA`YII WA LAM TABLUGHHU NIYYATII WA LAM TABLUGHU MAS-ALATII MIN KHAIRIN WA'ADTAHU AHADAN MIN KHALQIKA AU KHAIRIN ANTA MU'THIIHI AHADAN MIN 'IBAADIKA FAINNII ARGHABU ILAIKA FIIHI WA AS-ALUKAHU BIRAHMATIKA RABBAL 'AALAMIIN. ALLAAHUMMA DZAL HABLISY SYADIIDI WAL AMRIR RASYIIDI, AS-ALUKAL AMNA YAUMAL WA'IIDI WAL JANNATA YAUMAL KHULUUDI MA'Al MUQARRABIINASY SYUHUUDI AR RUKKA'IS SUJUUDI ALMUUFIINA BIL 'UHUUDI, INNAKA RAHIIMUN WADUUDUN, WA ANTA TAF'ALU MAA TURIIDU. ALLAAHUMMAJ 'ALNAA HAADIINA MUHTADIINA GHAIRA DHAALLIINA WA LAA MUDHILLIINA SILMAN LI AULIYAAIKA WA 'ADUWWAN LI A'DAAIKA NUHIBBU BIHUBBIKA MAN AHABBAKA WA NU'AADII BI 'ADAAWATIKA MAN KHAALAFAKA. ALLAAHUMMA HAADZAD DU'AAU WA 'ALAIKAL IJAABATU WA HAADZAL JUHDU WA 'ALAIKAT TUKLAANU. ALLAAHUMMAJ 'Al LII NUURAN FII QALBII, WA NUURAN FII QABRII, WA NUURAN MIN BAINI YADAYYA WA NUURAN MIN KHALFII, WANUURON 'AN YAMIINII WA NUURAN 'AN SYIMAALII, WA NUURAN MIN FAUQII, WA NUURAN MIN TAHTII, WA NUURAN FII SAM'II, WANUURON FII BASHORII, WANUURON FII SYA'RII, WANUURON FII BASYARII, WANUURON FII LAHMII, WANUURON FII DAMII, WA NUURAN FII 'IZHAAMII. ALLAAHUMMA A'ZHIM LII NUURAN WA A'THINII NUURAN WAJ'Al LII NUURAN, SUBHAANALLADZII TA'ATHTHAFAL 'IZZA WA QAALA BIHI, SUBHAANALLADZII LABISAL MAJDA WA TAKARRAMA BIHI, SUBHAANALLADZII LAA YANBAGHIT TASBIIHU ILLAA LAHU, SUBHAANA DZIL FADHLI WAN NI'AMI, SUBHAANA DZIL MAJDI WAL KARAMI, SUBHAANA DZIL JALAALI WAL IKRAAMI,",
   "arti": "Ya Allah, aku memohon rahmat dari sisiMu, dengannya Engkau memberikan petunjuk kepada hatiku, dan dengannya Engkau kumpulkan urusanku, dengannya Engkau cela kekacauanku, dan dengannya Engkau perbaiki apa yang tidak nampak dariku, dan dengannya Engkau angkat apa yang nampak padaku, dengannya Engkau mensucikan amalanku, dengannya Engkau mengilhami pikiranku, dan dengannya Engkau kembali kelembutanku, dengannya Engkau melindungiku dari segala keburukan. Ya Allah, berikan kepadaku keimanan dan keyakinan yang tidak ada kekafiran setelahnya, serta rahmat yang dengannya aku peroleh kemuliaan-Mu di dunia dan akhirat. Ya Allah, aku memohon kepadaMu keberuntungan mendapatkan pemberianMu, serta hidangan orang-orang yang mati syahid, kehidupan orang-orang yang berbahagia, dan kemenangan atas musuh. Ya Allah kepadaMu aku sampaikan hajatku, walaupun terbatas penglihatanku, serta lemah amalanku. Aku butuh kepada rahmatMu, maka aku memohon kepadaMu wahai Dzat Yang Maha Mampu menyelesaikan segala perkara, wahai Dzat yang mengobati hatiku, sebagaimana Engkau melindungi diantara lautan aku mohon agar Engkau lindungi aku dari adzab Neraka Sa'ir, serta seruan kebinasaan, serta fitnah kubur. Ya Allah, apa yang tidak mampu terlihat oleh pandanganku, dan tidak dicapai oleh niatku, serta tidak sampai permintaanku dari kebaikan yang telah Engkau janjikan kepada seseorang diantara makhlukMu, atau kebaikan yang Engkau berikan kepada seseorang diantara hamba-hambaMu, maka menginginkan dan memohonnya kepadaMu dengan rahmatMu wahai Tuhan semesta alam. Ya Allah Yang memiliki tali agama) yang kuat, dan perkara yang lurus, aku memohon kepadaMu keamanan pada hari yang penuh dengan ancaman, serta Surga pada hari yang kekal bersama orang-orang yang dekat, yang mati syahid, yang banyak melakukan ruku' dan sujud, serta yang senantiasa memenuhi janji, sesungguhnya Engkau Maha Pengasih dan Penyayang. Engkau mampu melakukan apa yang Engkau kehendaki. Ya Allah, jadikanlah kami orang-orang yang memberi petunjuk dan mendapatkan petunjuk, yang tidak tersesat dan menyesatkan, menyerah kepada para waliMu dan memusuhi musuh-musuhMu. Kami mencintai dengan kecintaanMu kepada orang yang mencintaiMu dan memusuhi dengan permusuhanMu kepada orang yang menyelisihiMu. Ya Allah, inilah doa yang mampu aku panjatkan dan kabulkanlah doa tersebut, dan inilah usahaku dan kepadaMu aku bersandar. Ya Allah berikanlah cahaya dalam hatiku dan cayaha dalam kuburku, cahaya di hadapanku, cahaya dari belakangku, cahaya dari kananku, cahaya dari kiriku, cahaya dari atasku, cahaya dari bawahku, cahaya dalam pendengaranku, cahaya dalam penglihatanku, cahaya dalam rambutku, cahaya dalam kulitku, cahaya dalam dagingku, cahaya dalam darahku, dan cahaya dalam tulangku. Ya Allah, perbesarkan cahaya untukku, berilah aku cahaya dan jadikan untukku cahaya. Maha Suci Dzat Yang memberikan kemuliaan dan berfirman dengan kemuliaan. Maha Suci dzat yang memiliki keagungan, dan memberi dengan keagungan. Maha Suci Dzat yang tidak sepantas untuk memuji kecuali kepadaNya, Dzat Yang memiliki karunia dan kenikmatan. Maha Suci Dzat yang memiliki keagungan dan kemurahan, Maha Suci Dzat Yang memiliki kebesaran dan kemuliaan,",
   "cara": "Setelah Selesai Sholat malam,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 201,
   "doa": "Doa Agar Sembuh Dari Sakit",
   "arab": "بِسْمِ اللَّهِ أَعُوذُ بِعِزَّةِ اللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ مِنْ وَجَعِي هَذَا,",
   "latin": "BISMILLAHI A'UUDZU BI 'IZZATILLAHI WA QUDRATIHI MIN SYARRI MAA AJIDU MIN WAJ'II HADZA,",
   "arti": "Dengan nama Allah, aku berlindung dengan kemuliaan Allah dan kekuasaan-Nya dari sakit yang aku derita ini,",
   "cara": "Bila kamu merasakan sakit, maka letakkanlah tanganmu di anggota badan) yang kamu rasakan sakitnya dan ucapkan doa ini. Kemudian angkat tanganmu lalu ulangilah hal itu secara ganjil.,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 202,
   "doa": "Mendoakan Orang yang Sakit agar Sembuh",
   "arab": "اللَّهُمَّ أَذْهِبِ الْبَأْسَ رَبَّ النَّاسِ وَاشْفِ فَأَنْتَ الشَّافِي لَا شِفَاءَ إِلَّا شِفَاؤُكَ شِفَاءً لَا يُغَادِرُ سَقَمًا,",
   "latin": "ALLAAHUMMA ADZHIBIL BA`SA, RABBAN NAASI, WASYFI, FA-ANTASY SYAAFII, LAA SYIFFAA-A ILLAA SYIFAAUKA, SYIFAA-AN LAA YUGHAADIRU SAQAMAN,",
   "arti": "Ya Allah, Tuhan manusia, hilangkanlah penyakit, dan sembuhkanlah, Engkau adalah Pemberi kesembuhan, tidak ada kesembuhan kecuali kesembuhanMu, kesembuhan yang tidak meninggalkan sakit,",
   "cara": "Menjenguk orang sakit,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 203,
   "doa": "Doa Sholat Mayit",
   "arab": "اللهُمَّ، اغْفِرْ لَهُ وَارْحَمْهُ وَعَافِهِ وَاعْفُ عَنْهُ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ، وَنَقِّهِ مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنَ الدَّنَسِ، وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ، وَأَهْلًا خَيْرًا مِنْ أَهْلِهِ وَزَوْجًا خَيْرًا مِنْ زَوْجِهِ، وَأَدْخِلْهُ الْجَنَّةَ وَأَعِذْهُ مِنْ عَذَابِ الْقَبْرِ مِنْ عَذَابِ النَّارِ),",
   "latin": "ALLAHUMMAGHFIR LAHU WARHAMHU WA 'AAFIHI WA'FU 'ANHU WA AKRIM NUZULAHU WA WASSI' MUDKHALAHU WAGHSILHU BILMAA`I WATS TSALJI WAL BARADI WA NAQQIHI MINAL KHATHAAYAA KAMAA NAQQAITATS TSAUBAL ABYADLA MINAD DANASI WA ABDILHU DAARAN KHAIRAN MIN DAARIHI WA AHLAN KHAIRAN MIN AHLIHI WA ZAUJAN KHAIRAN MIN ZAUJIHI WA ADKHILHUL JANNATA WA A'IDZHU MIN 'ADZAABIL QABRI MIN 'ADZAABIN NAAR),",
   "arti": "Ya Allah, ampunilah dosa-dosanya, kasihanilah ia, lindungilah ia dan maafkanlah ia, muliakanlah tempat kembalinya, lapangkan kuburnyak, bersihkanlah ia dengan air, salju dan air yang sejuk. Bersihkanlah ia dari segala kesalahan, sebagana Engkau telah membersihkan pakaian putih dari kotoran, dan gantilah rumahnya -di dunia- dengan rumah yang lebih baik -di akhirat- serta gantilah keluarganya -di dunia- dengan keluarga yang lebih baik, dan pasangan di dunia dengan yang lebih baik. Masukkanlah ia ke dalam surga-Mu dan lindungilah ia dari siksa kubur atau siksa api neraka,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Muslim,"
 },
 {
   "no": 204,
   "doa": "Doa Sholat Mayit 2",
   "arab": "اللَّهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا وَشَاهِدِنَا وَغَائِبِنَا وَذَكَرِنَا وَأُنْثَانَا وَصَغِيرِنَا وَكَبِيرِنَا,",
   "latin": "ALLOHUMMAGHFIR LIHAYYINAA WA MAYYITINAA WA SYAAHIDINAA WA GHOO IBINAA WA DZAKARINAA WA UNTSAANAA WA SHOGHIIRINAA WA KABIIRINAA,",
   "arti": "Ya Allah berilah ampunan bagi yang masih hidup di antara kami dan yang sudah meninggal dunia, orang yang hadir di antara kami dan yang tidak hadir, kaum laki-laki di antara kami dan kaum wanita, orang yang masih muda di antara kami dan orang yang sudah tua,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Nasai,"
 },
 {
   "no": 205,
   "doa": "Doa Memasukan Mayit Dalam Kubur",
   "arab": "بِسْمِ اللَّهِ وَعَلَى سُنَّةِ رَسُولِ اللَّهِ,",
   "latin": "BISMILLAH WA 'ALA SUNNATI RASUULILLAH,",
   "arti": "dengan nama Allah dan berada di atas sunnah Rasulullah shallallahu 'alaihi wasallam,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Abu Daud,"
 },
 {
   "no": 206,
   "doa": "Doa Ziaroh ke Kuburan Orang Iman",
   "arab": "السَّلَامُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ وَأَتَاكُمْ مَا تُوعَدُونَ غَدًا مُؤَجَّلُونَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لَاحِقُونَ,",
   "latin": "ASSALAAMU 'ALAIKUM DAARO QOUMIMMU'MINIINA WA ATAAKUM MAA TUU 'ADUUNA GHODAN MU AJJALUUNA WAINNAA INSYAA ALLOHU BIKUM LAA HIQUUNA,",
   "arti": "Semoga keselamatan atas kalian wahai para penghuni kuburan) dari kaum mukminin. Apa yang dijanjikan Allah kepada kalian niscaya akan kalian dapati esok pada hari kiamat), dan kami Insya Allah akan menyusul kalian,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Muslim,"
 },
 {
   "no": 207,
   "doa": "Doa Ziaroh ke Kuburan Orang Iman 2",
   "arab": "السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنْ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ لَلَاحِقُونَ أَسْأَلُ اللَّهَ لَنَا وَلَكُمْ الْعَافِيَةَ,",
   "latin": "AS SALAAMU 'ALA AHLID DIYAAR -sementara dalam riwayat Zuhair- AS SALAAMU 'ALAIKUM AHLAD DIYAARI MINAL MUKMINIIN WAL MUSLIMIIN WA INNAA INSYAA`ALLAHU BIKUM LAAHIQUUN ASALULLAHA LANAA WALAKUMUL 'AAFIYAH ,",
   "arti": "Semoga keselamatan tercurah bagi penghuni kubur) dari kalangan orang-orang mukmin dan muslim dan kami insya Allah akan menyulul kalian semua. Saya memohon kepada Allah bagi kami dan bagi kalian Al 'Afiyah keselamatan),",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Muslim,"
 },
 {
   "no": 208,
   "doa": "Doa Ziaroh ke Kuburan Orang Iman 3",
   "arab": " السَّلَامُ عَلَيْكُمْ يَا أَهْلَ الْقُبُورِ يَغْفِرُ اللَّهُ لَنَا وَلَكُمْ أَنْتُمْ سَلَفُنَا وَنَحْنُ بِالْأَثَرِ ,",
   "latin": "ASSALAAMU 'ALAIKUM YA AHLAL QUBUR, YAGHFIRULLAHU LANA WA WALAKU ANTUM SALAFUNA WA NAHNU BIL ATSARI,",
   "arti": "Semoga keselamatan tercurah kepada kalian, wahai penghuni kubur. Semoga Allah mengampuni kami dan kalian. Kalian telah mendahului kami dan kami akan menyusul kalian,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 209,
   "doa": "Doa Ziaroh ke Kuburan Orang Iman 4",
   "arab": " السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنْ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لَاحِقُونَ أَنْتُمْ لَنَا فَرَطٌ وَنَحْنُ لَكُمْ تَبَعٌ أَسْأَلُ اللَّهَ الْعَافِيَةَ لَنَا وَلَكُمْ,",
   "latin": "ASSALAAMU 'ALAIKUM AHLADDIYAARI MINAL MU'MINIINA WAL MUSLIMIINA WAINNAA INSYAA ALLOHU BIKUM LAAHIQUNA ANTUM LANAA FAROTHUN WANAHNU LAKUM TABA'UN ASALULLOHAL 'AAFIYATA LANAA WALAKUM,",
   "arti": "Semoga kesejahteraan terlimpahkan kepada kalian wahai penghuni kubur dari kaum Mukminin dan Muslimin, dan kami insya Allah akan bertemu kalian, kalian bagi kami sebagai pendahulu dan kami bagi kalian sebagai pengikut. Aku memohon keselamatan kepada Allah bagi kami dan kalian,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Nasai,"
 },
 {
   "no": 210,
   "doa": "Doa Ziaroh ke Kuburan Orang Iman 5",
   "arab": " السَّلَامُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لَاحِقُونَ,",
   "latin": "ASSALAAMU 'ALAIKUM DAARO QOUMIMMU'MINIINA WAINNAA INSYAA ALLOHU BIKUM LAAHIQUUNA,",
   "arti": "Assalamu'alaikum wahai penghuni negeri kaum mukmin. Kami insya Allah akan menyusul kalian,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Nasai,"
 },
 {
   "no": 211,
   "doa": "Doa Berbuka Puasa",
   "arab": "اللَّهُمَّ لَكَ صُمْتُ وَعَلَى رِزْقِكَ أَفْطَرْتُ,",
   "latin": "ALLAAHUMMA LAKA SHUMTU WA 'ALAA RIZQIKA AFTHARTU,",
   "arti": "Ya Allah, untukMu aku berpuasa, dan dengan rizqiMu aku berbuka,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Abu Dawud,"
 },
 {
   "no": 212,
   "doa": "Doa Berbuka Puasa 2",
   "arab": "ذَهَبَ الظَّمَأُ وَابْتَلَّتِ الْعُرُوقُ، وَثَبَتَ الْأَجْرُ إِنْ شَاءَ اللَّهُ,",
   "latin": "DZAHABAZH ZHAMAA`U WABTALLATIL 'URUUQU WA TSABATAL AJRU IN SYAA-ALLAAH,",
   "arti": "Telah hilang dahaga, dan telah basah tenggorokan, dan telah tetap pahala insya Allah,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Abu Dawud,"
 },
 {
   "no": 213,
   "doa": "Doa Lailatul Qodar",
   "arab": "اللَّهُمَّ إِنَّكَ عَفُوٌّ كَرِيمٌ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي,",
   "latin": "ALLAAHUMMA INNAKA 'AFUWWUN KARIIMUN TUHIBBUL 'AFWA FA'FU 'ANNII,",
   "arti": "Ya Allah, sesungguhnya Engkau Maha Pemberi ampunan dan Maha Pemurah, Engkau senang memberikan ampunan, maka ampunilah aku,",
   "cara": "Dibaca ketika malam Qodar,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 214,
   "doa": "Doa Sholat Istikhoroh",
   "arab": "اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ وَتَعْلَمُ وَلَا أَعْلَمُ وَأَنْتَ عَلَّامُ الْغُيُوبِ اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي عَاجِلِ أَمْرِي وَآجِلِهِ) فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي  فِي عَاجِلِ أَمْرِي وَآجِلِهِ) فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ وَاقْدُرْ لِي الْخَيْرَ حَيْثُ كَانَ ثُمَّ أَرْضِنِي,",
   "latin": "Allahumma inniy astakhiiruka bi 'ilmika wa astaqdiruka biqudratika wa as-aluka min fadhlikal 'azhim, fainnaka taqdiru wa laa aqdiru wa ta'lamu wa laa A'lamu wa anta 'allaamul ghuyuub. Allahumma in kunta ta'lamu anna haadzal amru khairun liy fiy diiniy wa ma'aasyiy wa 'aafiyati amriy  'Aajili amriy wa aajilihi) faqdurhu liy wa yassirhu liy tsumma baarik liy fiihi. Wa in kunta ta'lamu anna haadzal amru syarrun liy fiy diiniy wa ma'aasyiy wa 'aafiyati amriy fiy 'aajili amriy wa aajilihi) fashrifhu 'anniy washrifniy 'anhu waqdurliyl khaira haitsu kaana tsummar dhiniy,",
   "arti": "Ya Allah aku memohon pilihan kepadaMu dengan ilmuMu dan memohon kemampuan dengan kekuasaanMu dan memohon kepadaMu dengan karuniaMu yang Agung, karena Engkau Maha berkuasa sedang aku tidak berkuasa, Engkau Maha Mengetahui sedang aku tidak mengetahui karena Engkaulah yang Maha Mengetahui perkara yang ghoib. Ya Allah bila Engkau mengetahui bahwa urusan ini baik untukku, bagi agamaku, kehidupanku dan kesudahan urusanku ini atau Beliau bersabda; di waktu dekat atau di masa nanti maka takdirkanlah buatku dan mudahkanlah kemudian berikanlah berkah padanya. Namun sebaliknya, ya Allah bila Engkau mengetahui bahwa urusan ini buruk untukku, bagi agamaku, kehidupanku dan kesudahan urusanku ini atau Beliau bersabda; di waktu dekat atau di maa nanti maka jauhkanlah urusan dariku dan jauhkanlah aku darinya dan tetapkanlah buatku urusn yang baik saja dimanapun adanya kemudian paskanlah hatiku dengan ketepanMu itu,",
   "cara": "sholat 2 rokaat lalu baca doa ini. Beberapa ulama berpendapat perkara yang minta petunjuk dari Allah agar disebutkan setelah kalimat هَذَا الْأَمْرَ haadzal amru),",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 215,
   "doa": "Doa Sholat Hajat",
   "arab": "لَا إِلَهَ إِلَّا اللَّهُ الْحَلِيمُ الْكَرِيمُ سُبْحَانَ اللَّهِ رَبِّ الْعَرْشِ الْعَظِيمِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ وَعَزَائِمَ مَغْفِرَتِكَ وَالْغَنِيمَةَ مِنْ كُلِّ بِرٍّ وَالسَّلَامَةَ مِنْ كُلِّ إِثْمٍ لَا تَدَعْ لِي ذَنْبًا إِلَّا غَفَرْتَهُ وَلَا هَمًّا إِلَّا فَرَّجْتَهُ وَلَا حَاجَةً هِيَ لَكَ رِضًا إِلَّا قَضَيْتَهَا يَا أَرْحَمَ الرَّاحِمِينَ,",
   "latin": "LAA ILAAHA ILLALLAAHUL HALIIMUL KARIIM, SUBHANALLAAHI RABBIL 'ARSYIL 'ADZIIM, AL HAMDULILLAAHI RABBIL 'AALAMIIN, AS'ALUKA MUUJIBAATI RAHMATIKA WA AZAA'IMA MAGHFIRATIKA WAL GHANIIMATA MIN KULLI BIRRIN WAS SALAAMATA MIN KULLI ITSMIN, LAA TADA' LI DZAMBAN ILLAA GHAFARTAHU WALAA HAMMAN ILLAA FARRAJTAHU WALAA HAAJATAN HIYA LAKA RIDLAN ILLA QADLAITAHA YAA ARHAMAR RAHIMIIN,",
   "arti": "Tidak ada Ilah yang berhak disembah selain Allah yang maha lembut lagi Mahapemurah, Mahasuci Allah Rabb pemilik 'Arsy yang Mahaagung, segala puji bagi Allah Rabb semesta Alam, aku mengharap rahmatMU, ketetapan hati untuk meraih) ampunanMu, mendapatkan keberuntungan dengan segala kabaikan dan keselamatan dari segala perbuatan dosa, jangan Engkau biarkan dosa padaku kecuali Engkau mengampuninya, dan jangan Engkau biarkan kegundahan kecuali Engkau membukakannya, dan jangan Engkau biarkan kebutuhan-kebutuhan yang Engkau ridlai kecuali Engkau penuhi, wahai Dzat yang maha pengasih,",
   "cara": "sholat 2 rokaat lalu baca doa ini,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 216,
   "doa": "Sholat Tasbih",
   "arab": "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ,",
   "latin": "SUBHAANALLAH WALHAMDULILLAH WA LAAILAAHA ILLALLAH WALLAHU AKBAR,",
   "arti": "Maha Suci Allah dan Segala puji bagi Allah dan Tiada Tuhan kecuali Allah dan Allah Maha Besar,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 217,
   "doa": "Rokaat 1 Sholat Khifdzi Surat Yasin)",
   "arab": "<p align=center>بسم الله الرحمن الرحيم</p>يٰسٓ 1) وَالْقُرْاٰنِ الْحَكِيْمِۙ 2) اِنَّكَ لَمِنَ الْمُرْسَلِيْنَۙ 3) عَلٰى صِرَاطٍ مُسْتَقِيْمٍۗ 4) تَنْزِيْلَ الْعَزِيْزِ الرَّحِيْمٍۙ 5) لِتُنْذِرَ قَوْمًا مَّآ اُنْذِرَ اٰبَآؤُهُمْ فَهُمْ غٰفِلُوْنَ 6) لَقَدْ حَقَّ الْقَوْلُ عَلٰٓى اَكْثَرِهِمْ فَهُمْ لَا يُؤْمِنُوْنَ 7) اِنَّا جَعَلْنَا فِيْٓ اَعْنَاقِهِمْ اَغْلٰـلًا فَهِيَ اِلَى الْاَذْقَانِ فَهُمْ مُّقْمَحُوْنَ 8) وَجَعَلْنَا مِنْ بَيْنِ اَيْدِيْهِمْ سَدًّا وَّمِنْ خَلْفِهِمْ سَدًّا فَاَغْشَيْنَاهُمْ فَهُمْ لَا يُبْصِرُوْنَ 9) وَسَوَآءٌ عَلَيْهِمْ ءَاَنْذَرْتَهُمْ اَمْ لَمْ تُنْذِرْهُمْ لَا يُؤْمِنُوْنَ 10) اِنَّمَا تُنْذِرُ مَنِ اتَّبَعَ الذِّكْرَ وَخَشِيَ الرَّحْمٰنَ بِالْغَيْبِۚ فَبَشِّرْهُ بِمَغْفِرَةٍ وَاَجْرٍ كَرِيْمٍ 11) اِنَّا نَحْنُ نُحْيِ الْمَوْتٰى وَنَكْتُبُ مَا قَدَّمُوْا وَاٰثَارَهُمْۗ وَكُلَّ شَيْءٍ اَحْصَيْنٰهُ فِيْٓ اِمَامٍ مُّبِيْنٍ 12) وَاضْرِبْ لَهُمْ مَّثَلًا اَصْحٰبَ الْقَرْيَةِۘ اِذْ جَآءَهَا الْمُرْسَلُوْنَۚ 13) اِذْ اَرْسَلْنَآ اِلَيْهِمُ اثْنَيْنِ فَكَذَّبُوْهُمَا فَعَزَّزْنَا بِثَالِثٍ فَقَالُوْآ اِنَّٓا اِلَيْكُمْ مُّرْسَلُوْنَ 14) قَالُوْا مَآ اَنْتُمْ اِلَّا بَشَرٌ مِثْلُنَاۙ وَمَآ اَنْزَلَ الرَّحْمٰنُ مِنْ شَيْءٍۙ اِنْ اَنْتُمْ اِلَّا تَكْذِبُوْنَ 15) قَالُوْا رَبُّنَا يَعْلَمُ اِنَّآ اِلَيْكُمْ لَمُرْسَلُوْنَ 16) وَمَا عَلَيْنَآ اِلَّا الْبَلٰـغُ الْمُبِيْنُ 17) قَالُوْٓا اِنَّا تَطَيَّرْنَا بِكُـمْۚ لَئِنْ لَّمْ تَنْتَهُوْا لَنَرْجُمَنَّكُمْ وَلَيَمَسَّنَّكُمْ مِّنَّا عَذَابٌ اَلِيْمٌ 18) قَالُوْا طَآئِرُكُمْ مَعَكُـمْۗ اَئِنْ ذُكِّرْتُـمْۗ بَلْ اَنْتُمْ قَوْمٌ مُّسْرِفُوْنَ 19) وَجَآءَ مِنْ اَقْصَى الْمَدِيْنَةِ رَجُلٌ يَسْعٰى قَالَ يٰـقَوْمِ اتَّبِعُوا الْمُرْسَلِيْنَۙ 20) اتَّبِعُوْا مَنْ لَا يَسْئَلُكُمْ اَجْرًا وَّهُمْ مُهْتَدُوْنَ 21) وَمَا لِيَ لَآ اَعْبُدُ الَّذِيْ فَطَرَنِيْ وَاِلَيْهِ تُرْجَعُوْنَ 22) ءَاَتَّخِذُ مِنْ دُوْنِهٖٓ اٰلِهَةً اِنْ يُّرِدْنِ الرَّحْمٰنُ بِضُرٍّ لَّا تُغْنِ عَنِّيْ شَفَاعَتُهُمْ شَيْئًا وَّلَا يُنْقِذُوْنِۚ 23) اِنِّيْٓ اِذًا لَفِيْ ضَلٰـلٍ مُّبِيْنٍ 24) اِنِّيْٓ اٰمَنْتُ بِرَبِّكُمْ فَاسْمَعُوْنِۗ 25) قِيْلَ ادْخُلِ الْجَنَّةَ.ۗ قَالَ يٰـلَيْتَ قَوْمِيْ يَعْلَمُوْنَۙ 26) بِمَا غَفَرَ لِيْ رَبِّيْ وَجَعَلَنِيْ مِنَ الْمُكْرَمِيْنَ 27) وَمَآ اَنْزَلْنَا عَلٰى قَوْمِهٖ مِنْ بَعْدِهٖ مِنْ جُنْدٍ مِّنَ السَّمَآءِ وَمَا كُنَّا مُنْزِلِيْنَ 28) اِنْ كَانَتْ اِلَّا صَيْحَةً وَاحِدَةً فَاِذَا هُمْ خَامِدُوْنَ 29) يٰـحَسْرَةً عَلَى الْعِبَادِۚ مَا يَأْتِيْهِمْ مِّنْ رَّسُوْلٍ اِلَّا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ 30) اَلَمْ يَرَوْا كَمْ أَهْلَـكْنَا قَبْلَهُمْ مِّنَ الْقُرُوْنِ اَنَّهُمْ اِلَيْهِمْ لَا يَرْجِعُوْنَ31)  وَاِنْ كُلٌّ لَّمَّا جَمِيْعٌ لَدَيْنَا مُحْضَرُوْنَ 32) وَاٰيَةٌ لَّهُمُ الْاَرْضُ الْمَيْتَةُ.ۖ اَحْيَـيْنٰـهَا وَاَخْرَجْنَا مِنْهَا حَبًّا فَمِنْهُ يَأْ كُـلُوْنَ 33) وَجَعَلْنَا فِيهَا جَنّٰتٍ مِّنْ نَخِيْلٍ وَاَعْنَابٍ وَّفَجَّرْنَا فِيهَا مِنَ الْعُيُوْنِۙ 34) لِيَأْ كُـلُوْا مِنْ ثَمَرِهٖۙ وَمَا عَمِلَتْهُ اَيْدِيْهِمْۗ اَفَلَا يَشْكُرُوْنَ 35) سُبْحٰنَ الَّـذِيْ خَلَقَ الْاَزْوَاجَ كُـلَّهَا مِمَّا تُنْبِتُ الْاَرْضُ وَمِنْ اَنْفُسِهِمْ وَمِمَّا لَا يَعْلَمُوْنَ 36) وَاٰيَةٌ لَّهُمُ اللَّيْلُ.ۖ نَسْلَخُ مِنْهُ النَّهَارَ فَاِذَا هُمْ مُّظْلِمُوْنَۙ 37) وَالشَّمْسُ تَجْرِيْ لِمُسْتَقَرٍّ لَّهَاۗ ذٰلِكَ تَقْدِيْرُ الْعَزِيْزِ الْعَلِيْمِۗ 38) وَالْقَمَرَ قَدَّرْنٰهُ مَنَازِلَ حَتّٰى عَادَ كَالْعُرْجُوْنِ الْقَدِيْمِ 39) لَا الشَّمْسُ يَنْبَغِيْ لَهَآ اَنْ تُدْرِكَ الْقَمَرَ وَلَا اللَّيْلُ سَابِقُ النَّهَارِۗ وَكُلٌّ فِيْ فَلَكٍ يَسْبَحُونَ 40) وَاٰيَةٌ لَّهُمْ اَنَّا حَمَلْنَا ذُرِّيَّـتَهُمْ فِي الْفُلْكِ الْمَشْحُوْنِۙ 41) وَخَلَقْنَا لَهُمْ مِّنْ مِثْلِهٖ مَا يَرْكَبُوْنَ 42) وَاِنْ نَّشَأْ نُغْرِقْهُمْ فَلَا صَرِيْخَ لَهُمْ وَلَا هُمْ يُنْقَذُوْنَ 43) اِلَّا رَحْمَةً مِّنَّا وَمَتَاعًا اِلٰى حِيْنٍ 44) وَاِذَا قِيْلَ لَهُمُ اتَّقُوْا مَا بَيْنَ اَيْدِيْـكُمْ وَمَا خَلْفَكُمْ لَعَلَّـكُمْ تُرْحَمُوْنَ 45) وَمَا تَأْتِيـْهِمْ مِّنْ اٰيَةٍ مِّنْ اٰيٰتِ رَبِّهِمْ اِلَّا كَانُوْا عَنْهَا مُعْرِضِيْنَ 46) وَاِذَا قِيْلَ لَهُمْ اَنْفِقُوْا مِمَّا رَزَقَكُمُ اللَّهُ قَالَ الَّذِيْنَ كَفَرُوْا لِلَّذِيْنَ اٰمَنُوا اَنُطْعِمُ مَنْ لَّوْ يَشَآءُ اللّٰهُ أَطْعَمَهٗ ۖ اِنْ اَنْتُمْ اِلَّا فِيْ ضَلٰـلٍ مُّبِيْنٍ 47) وَيَقُوْلُوْنَ مَتٰى هٰذَا الْوَعْدُ اِنْ كُنْتُمْ صٰدِقِيْنَ 48) مَا يَنْظُرُوْنَ اِلَّا صَيْحَةً وَاحِدَةً تَأْخُذُهُمْ وَهُمْ يَخِصِّمُوْنَ 49) فَلَا يَسْتَطِيْعُوْنَ تَوْصِيَةً وَّلَآ اِلٰى أَهْلِهِمْ يَرْجِعُوْنَ 50) وَنُفِخَ فِى الصُّوْرِ فَاِذَا هُمْ مِّنَ الْاَجْدَاثِ اِلٰى رَبِّهِمْ يَنْسِلُوْنَ 51) قَالُوْا يٰـوَيْلَنَا مَنْ بَعَثَنَا مِنْ مَّرْقَدِنَا هٰذَا مَا وَعَدَ الرَّحْمٰنُ وَصَدَقَ الْمُرْسَلُوْنَ 52) اِنْ كَانَتْ اِلَّا صَيْحَةً وَّاحِدَةً فَإِذَا هُمْ جَمِيعٌ لَّدَيْنَا مُحْضَرُوْنَ 53) فَالْيَوْمَ لَا تُظْلَمُ نَفْسٌ شَيْئًا وَّلَا تُجْزَوْنَ اِلَّا مَا كُنْتُمْ تَعْمَلُوْنَ 54) اِنَّ اَصْحٰبَ الْجَنَّةِ الْيَوْمَ فِيْ شُغُلٍ فٰـكِهُونَۚ 55) هُمْ وَاَزْوَاجُهُمْ فِيْ ظِلٰـلٍ عَلَى الْاَرَآئِـكِ مُتَّكِئُونَۚ 56) لَهُمْ فِيْهَا فَاكِهَةٌ وَلَهُمْ مَّا يَدَّعُوْنَۚ 57) سَلٰـمٌۗ قَوْلًا مِّنْ رَّبٍّ رَّحِيْمٍ 58) وَامْتَازُوا الْيَوْمَ اَيُّهَا الْمُجْرِمُونَ 59) اَلَمْ اَعْهَدْ اِلَيْكُمْ يَا بَنِيْٓ اٰدَمَ اَنْ لَّا تَعْبُدُوا الشَّيْطٰنَۚ اِنَّهٗ لَكُمْ عَدُوٌّ مُّبِيْنٌ 60) وَاَنِ اعْبُدُوْنِيْ.ۗ هٰذَا صِرَاطٌ مُّسْتَقِيْمٌ 61) وَلَقَدْ أَضَلَّ مِنْكُمْ جِبِلًّا كَثِيرًاۗ اَفَلَمْ تَكُوْنُوْا تَعْقِلُوْنَ 62) هٰذِهٖ جَهَنَّمُ الَّتِيْ كُنْتُمْ تُوْعَدُوْنَ 63) اِصْلَوْهَا الْيَوْمَ بِمَا كُنْتُمْ تَكْفُرُوْنَ 64) اَلْيَوْمَ نَخْتِمُ عَلٰٓى اَفْوَاهِهِمْ وَتُكَلِّمُنَا اَيْدِيْهِمْ وَتَشْهَدُ اَرْجُلُهُمْ بِمَا كَانُوْا يَكْسِبُوْنَ 65) وَلَوْ نَشَآءُ لَطَمَسْنَا عَلٰٓى اَعْيُنِهِمْ فَاسْتَبَقُوا الصِّرَاطَ فَاَنّٰى يُبْصِرُوْنَ 66) وَلَوْ نَشَآءُ لَمَسَخْنٰهُمْ عَلٰى مَكَانَتِهِمْ فَمَا اسْتَطَاعُوْا مُضِيًّا وَلَا يَرْجِعُوْنَ 67) وَمَنْ نُّعَمِّرْهُ نُنَكِّسْهُ فِي الْخَلْقِۗ اَفَلَا يَعْقِلُوْنَ 68) وَمَا عَلَّمْنٰهُ الشِّعْرَ وَمَا يَنْبَغِيْ لَهٗ اِنْ هُوَ اِلَّا ذِكْرٌ وَّقُرْاٰنٌ مُّبِيْنٌ 69) لِّيُنْذِرَ مَنْ كَانَ حَيًّا وَيَحِقَّ الْقَوْلُ عَلَى الْكٰفِرِيْنَ 70) اَوَلَمْ يَرَوْا اَنَّا خَلَقْنَا لَهُمْ مِّمَّا عَمِلَتْ اَيْدِينَآ اَنْعَامًا فَهُمْ لَهَا مَالِكُوْنَ 71) وَذَلَّلْنٰهَا لَهُمْ فَمِنْهَا رَكُوْبُهُمْ وَمِنْهَا يَأْ كُلُوْنَ 72) وَلَهُمْ فِيْهَا مَنَافِعُ وَمَشَارِبُ.ۗ اَفَلَا يَشْكُرُوْنَ73)  وَاتَّخَذُوْا مِنْ دُوْنِ اللَّهِ اٰلِهَةً لَعَلَّهُمْ يُنْصَرُوْنَ 74) لَا يَسْتَطِيْعُوْنَ نَصْرَهُمْ وَهُمْ لَهُمْ جُنْدٌ مُّحْضَرُوْنَ 75) فَلَا يَحْزُنْكَ قَوْلُهُمْۘ اِنَّا نَعْلَمُ مَا يُسِرُّوْنَ وَمَا يُعْلِنُوْنَ 76) اَوَلَمْ يَرَ الْاِنْسَانُ اَنَّا خَلَقْنٰهُ مِنْ نُّطْفَةٍ فَاِذَا هُوَ خَصِيْمٌ مُّبِيْنٌ ¡77) وَضَرَبَ لَنَا مَثَلًا وَّنَسِيَ خَلْقَهٗ قَالَ مَنْ يُّحْيِ الْعِظَامَ وَهِيَ رَمِيْمٌ 78) قُلْ يُحْيِـيْهَا الَّذِيْٓ اَنْشَاَهَآ اَوَّلَ مَرَّةٍۗ وَهُوَ بِكُلِّ خَلْقٍ عَلِيْمٌ 79) الَّذِيْ جَعَلَ لَكُمْ مِّنَ الشَّجَرِ الْالَخْضَرِ نَارًاۙ فَاِذَآ اَنْتُمْ مِّنْهُ تُوْقِدُوْنَ 80) اَوَلَيْسَ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ بِقٰدِرٍ عَلٰٓى اَنْ يَّخْلُقَ مِثْلَهُمْۗ بَلٰى وَهُوَ الْخَـلّٰقُ الْعَلِيْمُ 81) اِنَّمَآ اَمْرُهٗٓ اِذَآ اَرَادَ شَيْئًاۖ أَنْ يَقُوْلَ لَهٗ كُنْ فَيَكُوْنُ 82) فَسُبْحٰنَ الَّـذِيْ بِيَدِهٖ مَلَكُوْتُ كُلِّ شَيْءٍ وَّاِلَيْهِ تُرْجَعُوْنَ 83) ا,",
   "latin": ",",
   "arti": ",",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Surat Yasin,"
 },
 {
   "no": 218,
   "doa": "Rokaat 2 Sholat Khifdzi Surat Ad Dhukhon)",
   "arab": "<p align=center>بسم الله الرحمن الرحيم</p>حٰـمٓۚ 1) وَالْكِتَابِ الْمُبِيْنِۙ 2) اِنَّآ اَنْزَلْنٰهُ فِيْ لَيْلَةٍ مُّبٰرَكَةٍ اِنَّا كُنَّا مُنْذِرِيْنَ 3) فِيْهَا يُفْرَقُ كُلُّ اَمْرٍ حَكِيْـمٍۙ 4) اَمْرًا مِنْ عِنْدِنَا.ۗ اِنَّا كُنَّا مُرْسِلِيْنَۖ 5) رَحْمَةً مِّنْ رَّبِّكَ.ۗ اِنَّهٗ هُوَ السَّمِيْعُ الْعَلِيْمُۗ 6) رَبِّ السَّمٰوٰتِ وَالْاَرْضِ وَمَا بَيْنَهُمَاۘ اِنْ كُنْتُمْ مُوْقِنِيْنَ 7) لَآ اِلٰهَ اِلَّا هُوَ يُـحْـيٖ وَيُمِيْتُ.ۗ رَبُّكُمْ وَرَبُّ اٰبَآئِكُـمُ الْاَوَّلِيْنَ 8) بَلْ هُمْ فِيْ شَكٍّ يَّلْعَبُوْنَ 9) فَارْتَقِبْ يَوْمَ تَأْتِى السَّمَآءُ بِدُخَانٍ مُّبِيْنٍ 10) يَغْشَى النَّاسَۗ هٰذَا عَذَابٌ اَلِيْمٌ 11) رَبَّنَا اكْشِفْ عَنَّا الْعَذَابَ اِنَّا مُؤْمِنُوْنَ 12) اَنّٰى لَهُمُ الذِّكْرٰى وَقَدْ جَآءَهُمْ رَسُوْلٌ مُّبِيْنٌۙ 13)  ثُمَّ تَوَلَّوْا عَنْهُ وَقَالُوْا مُعَلَّمٌ مَّجْنُوْنٌۘ 14) اِنَّا كَاشِفُو الْعَذَابِ قَلِيْلًا اِنَّكُمْ عَآئِدُوْنَۘ 15) يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرٰىۚ اِنَّا مُنْتَقِمُوْنَ 16) وَلَقَدْ فَتَنَّا قَبْلَهُمْ قَوْمَ فِرْعَوْنَ وَجَآءَهُمْ رَسُوْلٌ كَرِيْمٌۙ 17) اَنْ اَدُّوْآ اِلَيَّ عِبَادَ اللّٰهِۗ اِنِّيْ لَكُمْ رَسُوْلٌ اَمِيْنٌۙ 18) وَاَنْ لَّا تَعْلُوْا عَلَى اللّٰهِۚ اِنِّيْٓ اٰتِيْكُمْ بِسُلْطٰنٍ مُّبِيْنٍۚ 19) وَاِنِّيْ عُذْتُ بِرَبِّيْ وَرَبِّكُمْ اَنْ تَرْجُمُوْنِۚ 20) وَاِنْ لَّمْ تُؤْمِنُوْا لِيْ فَاعْتَزِلُوْنِ 21)  فَدَعَا رَبَّهٗٓ اَنَّ هٰٓؤُلَآءِ قَوْمٌ مُّجْرِمُوْنَ 22) فَاَسْرِ بِعِبَادِيْ لَيْلًا اِنَّكُمْ مُّتَّبَعُوْنَۙ 23) وَاتْرُكِ الْبَحْرَ رَهْوًاۗ اِنَّهُمْ جُنْدٌ مُغْرَقُوْنَ 24) كَـمْ تَرَكُوْا مِنْ جَنّٰتٍ وَّعُيُوْنٍۙ 25) وَزُرُوْعٍ وَّمَقَامٍ كَرِيْمٍۙ 26) وَّنَعْمَةٍ كَانُوْا فِيْهَا فٰـكِهِيْنَ 27) كَذٰلِكَ.ۗ وَاَوْرَثْنٰـهَا قَوْمًا اٰخَرِيْنَۚ 28) فَمَا بَكَتْ عَلَيْهِمُ السَّمَآءُ وَالْاَرْضُ.ۗ وَمَا كَانُوْا مُنْظَرِيْنَ 29) وَلَقَدْ نَجَّيْنَا بَنِيْٓ اِسْرَآءِيْلَ مِنَ الْعَذَابِ الْمُهِيْنِۙ 30) مِنْ فِرْعَوْنَۗ اِنَّهٗ كَانَ عَالِيًا مِّنَ الْمُسْرِفِيْنَ 31) وَلَقَدِ اخْتَرْنٰهُمْ عَلٰى عِلْـمٍ عَلَى الْعٰلَمِيْنَۚ 32) وَاٰتَيْنٰهُمْ مِّنَ الْاٰيٰتِ مَا فِيْهِ بَلَآؤٌ مُّبِيْنٌ 33) اِنَّ هٰٓؤُلَآءِ لَيَقُوْلُوْنَۙ 34) اِنْ هِيَ اِلَّا مَوْتَتُنَا الْاُوْلٰى وَمَا نَحْنُ بِمُنْشَرِيْنَ 35) فَأْتُوْا بِاٰبَآئِنَآ اِنْ كُنْتُمْ صٰدِقِيْنَ 36) اَهُمْ خَيْرٌ اَمْ قَوْمُ تُبَّعٍۙ وَالَّذِيْنَ مِنْ قَبْلِهِمْ اَهْلَكْنٰهُمْ اِنَّهُمْ كَانُوْا مُجْرِمِيْنَ 37) وَمَا خَلَقْنَا السَّمٰوٰتِ وَالْاَرْضَ وَمَا بَيْنَهُمَا لٰعِبِيْنَ 38) مَا خَلَقْنٰهُمَآ اِلَّا بِالْحَقِّ وَلٰـكِنَّ اَكْـثَرَهُمْ لَا يَعْلَمُوْنَ 39) اِنَّ يَوْمَ الْفَصْلِ مِيْقَاتُهُمْ اَجْمَعِيْنَۙ 40) يَوْمَ لَا يُغْنِيْ مَوْلًى عَنْ مَّوْلًى شَيْئًا وَّلَا هُمْ يُنْصَرُوْنَۙ 41) اِلَّا مَنْ رَّحِمَ اللَّهُ.ۗ اِنَّهٗ هُوَ الْعَزِيْزُ الرَّحِيْمُ 42) اِنَّ شَجَرَتَ الزَّقُّوْمِۙ43)  طَعَامُ الْاَثِيْـمِۛ 44) كَالْمُهْلِۛ يَغْلِيْ فِى الْبُطُوْنِۙ 45) كَغَلْيِ الْحَمِيْمِۗ 46) خُذُوْهُ فَاعْتِلُوْهُ اِلٰى سَوَآءِ الْجَحِيْمِۙ 47) ثُمَّ صُبُّوْا فَوْقَ رَأْسِهٖ مِنْ عَذَابِ الْحَمِيْمِۗ 48) ذُقْ.ۚ اِنَّكَ اَنْتَ الْعَزِيْزُ الْكَرِيْمُ 49) اِنَّ هٰذَا مَا كُنْتُمْ بِهٖ تَمْتَرُوْنَ 50) اِنَّ الْمُتَّقِيْنَ فِيْ مَقَامٍ اَمِيْنٍۙ 51) فِيْ جَنّٰتٍ وَّعُيُوْنٍۙ 52) يَّلْبَسُوْنَ مِنْ سُنْدُسٍ وَّاِسْتَبْرَقٍ مُتَقٰبِلِيْنَۚ 53) كَذَلِكَ.ۗ وَزَوَّجْنٰهُمْ بِحُوْرٍ عِيْنٍۗ 54) يَدْعُوْنَ فِيْهَا بِكُلِّ فَاكِهَةٍ اٰمِنِيْنَۙ 55) لَا يَذُوْقُوْنَ فِيْهَا الْمَوْتَ اِلَّا الْمَوْتَةَ الْاُوْلٰىۚ وَوَقٰهُمْ عَذَابَ الْجَحِيْمِۙ 56) فَضْلًا مِّنْ رَّبِّكَ.ۚ ذٰلِكَ هُوَ الْفَوْزُ الْعَظِيْمُ 57) فَاِنَّمَا يَسَّرْنٰهُ بِلِسٰنِكَ لَعَلَّهُمْ يَتَذَ كَّرُوْنَ 58) فَارْتَقِبْ اِنَّهُمْ مُّرْتَقِبُوْنَ 59),",
   "latin": ",",
   "arti": ",",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Surat Ad Dhukhon,"
 },
 {
   "no": 219,
   "doa": "Rokaat 3 Sholat Khifdzi Surat As Sajda)",
   "arab": "<p align=center>بسم الله الرحمن الرحيم</p>الٓـمٓۗ 1) تَنْزِيْلُ الْكِتٰبِ لَا رَيْبَ فِيْهِ مِنْ رَّبِّ الْعٰلَمِيْنَۗ 2) اَمْ يَقُوْلُوْنَ افْتَرٰىهُ.ۚ بَلْ هُوَ الْحَقُّ مِنْ رَّبِّكَ لِتُنْذِرَ قَوْمًا مَّآ اَتٰهُمْ مِّنْ نَّذِيْرٍ مِّنْ قَبْلِكَ لَعَلَّهُمْ يَهْتَدُوْنَ 3) اللّٰهُ الَّـذِيْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ وَمَا بَيْنَهُمَا فِيْ سِتَّةِ اَيَّامٍ ثُمَّ اسْتَوٰى عَلَى الْعَرْشِۗ مَا لَكُمْ مِّنْ دُوْنِهٖ مِنْ وَّلِيٍّ وَّلَا شَفِيْعٍۗ اَفَلَا تَتَذَ كَّـرُوْنَ 4) يُدَبِّرُ الْاَمْرَ مِنَ السَّمَآءِ اِلَى الْاَرْضِ ثُمَّ يَعْرُجُ اِلَيْهِ فِيْ يَوْمٍ كَانَ مِقْدَارُهٗ اَلْفَ سَنَةٍ مِّمَّا تَعُدُّوْنَ 5) ذٰلِكَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْعَزِيْزُ الرَّحِيْمُۙ 6)  الَّـذِيْٓ اَحْسَنَ كُلَّ شَيْءٍ خَلَقَهٗ وَبَدَاَ خَلْقَ الْاِنْسَانِ مِنْ طِيْنٍ 7) ثُمَّ جَعَلَ نَسْلَهٗ مِنْ سُلٰلَةٍ مِّنْ مَّآءٍ مَّهِيْنٍۚ 8) ثُمَّ سَوّٰىهُ وَنَفَخَ فِيْهِ مِنْ رُّوْحِهٖ وَجَعَلَ لَكُمُ السَّمْعَ وَالْاَبْصَارَ وَالْاَفْئِدَةَ.ۗ قَلِيلًا مَّا تَشْكُرُوْنَ 9) وَقَالُوْآ ءَاِذَا ضَلَلْنَا فِى الْاَرْضِ ءَاِنَّا لَفِيْ خَلْقٍ جَدِيْدٍۗ بَلْ هُمْ بِلِقَآءِ رَبِّهِمْ كٰفِرُوْنَ 10) قُلْ يَتَوَفّٰـكُمْ مَّلَكُ الْمَوْتِ الَّـذِيْ وُكِّلَ بِكُمْ ثُمَّ اِلٰى رَبِّكُمْ تُرْجَعُوْنَ 11) وَلَوْ تَرٰٓى اِذِ الْمُجْرِمُوْنَ نَاكِسُوْ رُءُوْسِهِمْ عِنْدَ رَبِّهِمْۗ رَبَّنَآ اَبْصَرْنَا وَسَمِعْنَا فَارْجِعْنَا نَعْمَلْ صَالِحًا اِنَّا مُوْقِنُوْنَ 12) وَلَوْ شِئْنَا لَاٰ تَيْنَا كُلَّ نَفْسٍ هُدٰىـهَا وَلٰكِنْ حَقَّ الْقَوْلُ مِنِّيْ لَاَمْلَئَنَّ جَهَنَّمَ مِنَ الْجِنَّةِ وَالنَّاسِ اَجْمَعِيْنَ 13) فَذُوْقُوْا بِمَا نَسِيْتُمْ لِقَآءَ يَوْمِكُمْ هٰذَاۚ اِنَّا نَسِيْنٰكُمْ وَذُوْقُوْا عَذَابَ الْخُلْدِ بِمَا كُنْتُمْ تَعْمَلُوْنَ 14) اِنَّمَا يُؤْمِنُ بِاٰيٰـتِنَا الَّـذِيْنَ اِذَا ذُ كِّرُوْا بِهَا خَرُّوْا سُجَّدًا وَّسَبَّحُوْا بِحَمْدِ رَبِّهِمْ وَهُمْ لَا يَسْتَكْبِرُوْنَ ۩ 15) تَتَجَافٰى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ يَدْعُوْنَ رَبَّهُمْ خَوْفًا وَطَمَعًا.ۖ وَّمِمَّا رَزَقْنٰهُمْ يُنْفِقُوْنَ 16) فَلَا تَعْلَمُ نَفْسٌ مَّآ اُخْفِيَ لَهُمْ مِنْ قُرَّةِ اَعْيُنٍۚ جَزَآءً بِمَا كَانُوْا يَعْمَلُوْنَ 17) اَفَمَنْ كَانَ مُؤْمِنًا كَـمَنْ كَانَ فَاسِقًا.ۗ لَا يَسْتَوٗنَ 18) اَمَّا الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ فَلَهُمْ جَنّٰتُ الْمَأْوٰىۖ نُزُلًا بِمَا كَانُوْا يَعْمَلُوْنَ 19) وَاَمَّا الَّـذِيْنَ فَسَقُوْا فَمَأْوٰىـهُمُ النَّارُ كُلَّمَآ اَرَادُوْٓا اَنْ يَّخْرُجُوْا مِنْهَآ اُعِيْدُوْا فِيْهَا وَقِيْلَ لَهُمْ ذُوْقُوْا عَذَابَ النَّارِ الَّـذِيْ كُنْتُمْ بِهٖ تُكَذِّبُوْنَ 20) وَلَنُذِيْقَنَّهُمْ مِّنَ الْعَذَابِ الْاَدْنٰى دُوْنَ الْعَذَابِ الْاَ كْبَرِ لَعَلَّهُمْ يَرْجِعُوْنَ 21) وَمَنْ اَظْلَمُ مِمَّنْ ذُ كِّـرَ بِاٰيٰتِ رَبِّهٖ ثُمَّ أَعْرَضَ عَنْهَا.ۗ اِنَّا مِنَ الْمُجْرِمِيْنَ مُنْتَقِمُوْنَ 22) وَلَقَدْ اٰتَيْنَا مُوْسَى الْـكِتٰبَ فَلَا تَكُنْ فِيْ مِرْيَةٍ مِّنْ لِّقَآئِهٖ وَجَعَلْنٰهُ هُدًى لِبَنِيْٓ اِسْرَآءِيْلَ.ۚ 23) وَجَعَلْنَا مِنْهُمْ اَئِمَّةً يَّهْدُوْنَ بِاَمْرِنَا لَمَّا صَبَرُوْاۗ وَكَانُوْا بِاٰيٰـتِنَا يُوْقِنُوْنَ 24) اِنَّ رَبَّكَ هُوَ يَفْصِلُ بَيْنَهُمْ يَوْمَ الْقِيٰمَةِ فِيْمَا كَانُوْا فِيْهِ يَخْتَلِفُوْنَ 25) اَوَلَمْ يَهْدِ لَهُمْ كَـمْ اَهْلَـكْنَا مِنْ قَبْلِهِمْ مِّنَ الْقُرُوْنِ يَمْشُوْنَ فِيْ مَسٰكِنِهِمْۗ اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍۗ اَفَلَا يَسْمَعُوْنَ 26) اَوَلَمْ يَرَوْا اَنَّا نَسُوْقُ الْمَآءَ اِلَى الْاَرْضِ الْجُرُزِ فَنُخْرِجُ بِهٖ زَرْعًا تَأْ كُلُ مِنْهُ اَنْعَامُهُمْ وَاَنْفُسُهُمْۗ اَفَلَا يُبْصِرُوْنَ 27) وَيَقُوْلُوْنَ مَتٰى هٰذَا الْفَتْحُ اِنْ كُنْتُمْ صٰدِقِيْنَ 28) قُلْ يَوْمَ الْفَتْحِ لَا يَنْفَعُ الَّـذِيْنَ كَفَرُوْٓا اِيْمَانُهُمْ وَلَا هُمْ يُنْظَرُوْنَ 29) فَاَعْرِضْ عَنْهُمْ وَانْتَظِرْ اِنَّهُمْ مُّنْتَظِرُوْنَ 30)ا,",
   "latin": ",",
   "arti": ",",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Surat As Sajda,"
 },
 {
   "no": 220,
   "doa": "Rokaat 4 Sholat Khifdzi Surat Al Mulk)",
   "arab": "<p align=center>بسم الله الرحمن الرحيم</p> تَبَارَكَ الَّـذِيْ بِيَدِهِ الْمُلْكُ.ۖ وَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌۙ 1) الَّـذِيْ خَلَقَ الْمَوْتَ وَالْحَيٰوةَ لِيَبْلُوَكُمْ اَيُّكُمْ اَحْسَنُ عَمَلًاۗ وَهُوَ الْعَزِيْزُ الْغَفُوْرُۙ 2) الَّـذِيْ خَلَقَ سَبْعَ سَمٰوٰتٍ طِبَاقًا.ۗ مَا تَرٰى فِيْ خَلْقِ الرَّحْمٰنِ مِنْ تَفٰوُتٍۗ فَارْجِعِ الْبَصَرَۙ هَلْ تَرٰى مِنْ فُطُوْرٍ 3) ثُمَّ ارْجِعِ الْبَصَرَ كَرَّتَيْنِ يَنْقَلِبْ اِلَيْكَ الْبَصَرُ خَاسِئًا وَّهُوَ حَسِيْرٌ 4) وَلَقَدْ زَيَّنَّا السَّمَآءَ الدُّنْيَا بِمَصَابِيْحَ وَجَعَلْنٰهَا رُجُوْمًا لِلشَّيٰطِيْنِ وَاَعْتَدْنَا لَهُمْ عَذَابَ السَّعِيْرِ 5) وَلِلَّـذِيْنَ كَفَرُوْا بِرَبِّهِمْ عَذَابُ جَهَنَّمَۗ وَبِئْسَ الْمَصِيرُ 6) اِذَآ اُلْقُوْا فِيْهَا سَمِعُوْا لَهَا شَهِيْقًا وَهِيَ تَفُوْرُۙ 7)  تَكَادُ تَمَيَّزُ مِنَ الْغَيْظِۗ كُلَّمَآ اُلْقِيَ فِيْهَا فَوْجٌ سَاَلَهُمْ خَزَنَتُهَآ اَلَمْ يَأْتِكُـمْ نَذِيْرٌ 8) قَالُوْا بَلٰى قَدْ جَآءَنَا نَذِيْرٌۙ فَكَذَّبْنَا وَقُلْنَا مَا نَزَّلَ اللّٰهُ مِنْ شَيْءٍۖ اِنْ اَنْتُمْ اِلَّا فِيْ ضَلٰلٍ كَبِيْرٍ 9) وَقَالُوْا لَوْ كُنَّا نَسْمَعُ اَوْ نَعْقِلُ مَا كُنَّا فِيْٓ اَصْحٰبِ السَّعِيْرِ 10) فَاعْتَرَفُوْا بِذَنْبِهِمْ فَسُحْقًا لِّاَصْحٰبِ السَّعِيْرِ 11) اِنَّ الَّـذِيْنَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ لَهُمْ مَغْفِرَةٌ وَأَجْرٌ كَبِيْرٌ 12) وَاَسِرُّوْا قَوْلَكُمْ اَوِ اجْهَرُوْا بِهٖۗ اِنَّهٗ عَلِيْمٌ بِذَاتِ الصُّدُوْرِ 13) اَلَا يَعْلَمُ مَنْ خَلَقَۗ وَهُوَ اللَّـطِيْفُ الْخَبِيْرُ 14) هُوَ الَّـذِيْ جَعَلَ لَكُمُ الْاَرْضَ ذَلُوْلًا فَامْشُوْا فِيْ مَنَاكِبِهَا وَكُلُوْا مِنْ رِّزْقِهٖۗ وَاِلَيْهِ النُّشُوْرُ 15) ءَاَمِنْتُمْ مَّنْ فِى السَّمَآءِ اَنْ يَخْسِفَ بِكُمُ الْاَرْضَ فَاِذَا هِيَ تَمُوْرُۙ 16) اَمْ اَمِنْتُمْ مَّنْ فِى السَّمَآءِ اَنْ يُّرْسِلَ عَلَيْكُمْ حَاصِبًا.ۗ فَسَتَعْلَمُوْنَ كَيْفَ نَذِيْرِ 17) وَلَقَدْ كَذَّبَ الَّـذِيْنَ مِنْ قَبْلِهِمْ فَكَيْفَ كَانَ نَكِيْرِ 18) اَوَلَمْ يَرَوْا اِلَى الطَّيْرِ فَوْقَهُمْ صٰٓفّٰتٍ وَّيَقْبِضْنَۘ مَا يُمْسِكُهُنَّ اِلَّا الرَّحْمٰنُۗ اِنَّهٗ بِكُلِّ شَيْءٍ بَصِيْرٌ 19) اَمَّنْ هٰذَا الَّـذِيْ هُوَ جُنْدٌ لَّـكُمْ يَنْصُرُكُمْ مِّنْ دُوْنِ الرَّحْمٰنِۗ اِنِ الْكٰفِرُوْنَ اِلَّا فِيْ غُرُوْرٍۚ 20) اَمَّنْ هٰذَا الَّـذِيْ يَرْزُقُكُمْ اِنْ اَمْسَكَ رِزْقَهٗ.ۚ بَلْ لَّـجُّوْا فِيْ عُتُوٍّ وَّنُفُوْرٍ 21) اَفَمَنْ يَّمْشِيْ مُكِبًّا عَلٰى وَجْهِهٖٓ اَهْدٰىٓ اَمَّنْ يَّمْشِيْ سَوِيًّا عَلٰى صِرَاطٍ مُّسْتَقِيْمٍ22)  قُلْ هُوَ الَّـذِيْٓ اَنْشَاَ كُمْ وَجَعَلَ لَكُمُ السَّمْعَ وَالْاَبْصَارَ وَالْاَفْئِدَةَ.ۗ قَلِيْلًا مَّا تَشْكُرُوْنَ 23) قُلْ هُوَ الَّذِيْ ذَرَاَ كُمْ فِي الْاَرْضِ وَاِلَيْهِ تُحْشَرُوْنَ 24) وَيَقُوْلُوْنَ مَتٰى هٰذَا الْوَعْدُ اِنْ كُنْتُمْ صٰدِقِيْنَ 25) قُلْ اِنَّمَا الْعِلْمُ عِنْدَ اللّٰهِۖ وَاِنَّمَا اَنَاْ نَذِيْرٌ مُّبِيْنٌ 26) فَلَمَّا رَاَوْهُ زُلْفَةً سِيْٓئَتْ وُجُوْهُ الَّـذِيْنَ كَفَرُوْا وَقِيْلَ هٰذَا الَّـذِيْ كُنْتُمْ بِهٖ تَدَّعُوْنَ 27) قُلْ اَرَءَيْتُمْ اِنْ اَهْلَكَنِيَ اللّٰهُ وَمَنْ مَّعِيَ اَوْ رَحِمَنَاۙ فَمَنْ يُّجِيْرُ الْكٰـفِرِيْنَ مِنْ عَذَابٍ اَلِيـْمٍ 28) قُلْ هُوَ الرَّحْمٰنُ اٰمَنَّا بِهٖ وَعَلَيْهِ تَوَكَّلْنَا.ۚ فَسَتَعْلَمُوْنَ مَنْ هُوَ فِيْ ضَلٰلٍ مُّبِيْنٍ 29)  قُلْ اَرَءَيْتُمْ اِنْ اَصْبَحَ مَآؤُكُمْ غَوْرًا فَمَنْ يَأْتِيْكُمْ بِمَآءٍ مَّعِيْنٍ 30)ا,",
   "latin": ",",
   "arti": ",",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "Surat Al Mulk,"
 },
 {
   "no": 221,
   "doa": "Doa Sholat Khifdzi",
   "arab": "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ , لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ, لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ, اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ وَعَلَى سَائِرِ النَّبِيِّينَ اللَّهُمَّ اغْفِرْ لِلْمُؤْمِنِينَ وَالمُؤْمِنَاتِ وَلِإِخْوَانِكَ الَّذِينَ سَبَقُوكَ بِالإِيمَانِ وَلَا تَجْعَلِ فِى قُلُوْبِنَا غِلًّا لِلَّذِيْنَ اٰمَنُوْا رَبَّنَا إِنَّكَ رَءُوْفٌ رَحِيْمٌ. اللَّهُمَّ ارْحَمْنِي بِتَرْكِ المَعَاصِي أَبَدًا مَا أَبْقَيْتَنِي، وَارْحَمْنِي أَنْ أَتَكَلَّفَ مَا لَا يَعْنِينِي، وَارْزُقْنِي حُسْنَ النَّظَرِ فِيمَا يُرْضِيكَ عَنِّي، اللَّهُمَّ بَدِيعَ السَّمَوَاتِ وَالأَرْضِ ذَا الجَلَالِ وَالإِكْرَامِ وَالعِزَّةِ الَّتِي لَا تُرَامُ، أَسْأَلُكَ يَا أَللَّهُ يَا رَحْمَنُ بِجَلَالِكَ وَنُورِ وَجْهِكَ أَنْ تُلْزِمَ قَلْبِي حِفْظَ كِتَابِكَ كَمَا عَلَّمْتَنِي، وَارْزُقْنِي أَنْ أَتْلُوَهُ عَلَى النَّحْوِ الَّذِي يُرْضِيكَ عَنِّيَ، اللَّهُمَّ بَدِيعَ السَّمَوَاتِ وَالأَرْضِ ذَا الجَلَالِ وَالإِكْرَامِ وَالعِزَّةِ الَّتِي لَا تُرَامُ، أَسْأَلُكَ يَا أَللَّهُ يَا رَحْمَنُ بِجَلَالِكَ وَنُورِ وَجْهِكَ أَنْ تُنَوِّرَ بِكِتَابِكَ بَصَرِي، وَأَنْ تُطْلِقَ بِهِ لِسَانِي، وَأَنْ تُفَرِّجَ بِهِ عَنْ قَلْبِي، وَأَنْ تَشْرَحَ بِهِ صَدْرِي، وَأَنْ تَغْسِلَ بِهِ بَدَنِي، فَإِنَّهُ لَا يُعِينُنِي عَلَى الحَقِّ غَيْرُكَ وَلَا يُؤْتِيهِ إِلَّا أَنْتَ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ العَلِيِّ العَظِيمِ,",
   "latin": ",",
   "arti": ",",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 222,
   "doa": "Dzikir Sesudah Sholat",
   "arab": "اَسْتَغْفِرُ اللَّه 3<br>اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ,",
   "latin": "ASTAGHFIRULLAAH 3X<br>ALLAAHUMMA ANTAS SALAAM WAMINKAS SALAAM TABAARAKTA DZAL JALAALIL WAL IKROOM,",
   "arti": "Ya Allah, Engkau adalah Dzat yang memberi keselamatan, dan dari-Mulah segala keselamatan, Maha Besar Engkau wahai Dzat Pemilik kebesaran dan kemuliaan,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Muslim,"
 },
 {
   "no": 223,
   "doa": "Dzikir Sesudah Sholat 2",
   "arab": "سُبْحَانَ اللَّهِ 10<br> الْحَمْدُ لِلَّهِ 10<br> اللَّهُ أَكْبَرُ 10,",
   "latin": "Subhanallah 10X<br> Al HAMDULILLAAH 10X<br> ALLAAHU AKBAR 10X,",
   "arti": ",",
   "cara": "Masing-masing bisa dibaca 10X ataupun 33X,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 224,
   "doa": "Dzikir Sesudah Sholat 3",
   "arab": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ وَلَا مُعْطِيَ لِمَا مَنَعْتَ وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ,",
   "latin": "LAA ILAAHA ILLALLAH WAHDAHU LAA SYARIIKA LAHU, LAHUL MULKU WA LAHUL HAMDU WA HUWA 'ALAA KULLI SYAI'IN QADIIR. ALLAHUMMA LAA MAANI'A LIMA A'THAITA WA LAA MU'THIYA LIMA MANA'TA WA LAA YANFA'U DZAL JADDI MINKAL JADDU,",
   "arti": "Tidak ada tuhan yang berhak disembah selain Allah, yang Tunggal dan tidak ada sekutu bagi-Nya. Milik-Nya segala kerajaan, dan milik-Nya segala pujian. Dan Dia Maha Kuasa atas segala sesuatu. Ya Allah, tidak ada yang dapat menahan dari apa yang Engkau berikan dan dan tidak ada yang dapat memberi dari apa yang Engkau tahan. Dan tidak bermanfaat kekayaan orang yang kaya di hadapan-Mu sedikitpun,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 225,
   "doa": "Dzikir Sesudah Sholat 4",
   "arab": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ لَا إِلَهَ إِلَّا اللَّهُ وَلَا نَعْبُدُ إِلَّا إِيَّاهُ لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ لَا إِلَهَ إِلَّا اللَّهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الْكَافِرُونَ,",
   "latin": "LAA ILAAHA ILLALLAAH WAHDAHUU LAA SYARIIKA LAHU, LAHUL MULKU WALAHUL HAMDU WAHUWA 'ALAA KULLI SYAI'IN QADIIR, LAA HAULA WALAA QUWWATA ILLAA BILLAAH, LAA-ILAAHA ILALLAAH WALAA NA'BUDU ILLAA IYYAAH, LAHUN NI'MATU WALAHUL FADHLU WALAHUTS TSANAA'UL HASAN, LAA-ILAAHA ILLALLAAH MUKHLISHIINA LAHUD DIINA WALAU KARIHAL KAAFIRUUNA,",
   "arti": "Tiada sesembahan yang hak selain Allah semata yang tiada sekutu bagi-Nya, bagi-Nya selaga puji dan Dia Maha Kuasa atas segala sesuatu. Tiada Daya dan kekuatan selain dengan pertolongan Allah. Tiada sesembahan yang hak selain Allah, dan Kami tidak beribadah selain kepada-Nya, dengan memurnikan ketaatan kepada-Nya, hanya bagi-Nya ketundukan, sekalipun orang-orang kafir tidak menyukai,",
   "cara": "Rasulullah shallallahu 'alaihi wasallam selalu mengeraskan suara dengan kalimat ini setiap selesai shalat,",
   "utama": ",",
   "sumber": "H.R. Muslim,"
 },
 {
   "no": 226,
   "doa": "Dzikir Sesudah Sholat 5",
   "arab": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ,",
   "latin": "LAA ILAAHA ILLALLAAHU WAHDAHU LAA SYARIIKA LAH, LAHUL MULKU WA LAHUL HAMDU YUHYII WA YUMIITU WA HUWA 'ALAA KULLI SYAI-IN QADIIR,",
   "arti": "Tidak ada tuhan yang berhak disembah kecuali Allah semata tidak ada sekutu bagiNya, milikNya semua kerajaan dan bagiNya seluruh pujian, Dia Yang menghidupkan, serta mematikan, dan Dia Maha Mampu melakukan segala sesuatu,",
   "cara": "Dibaca 10 X setelah sholat subuh,",
   "utama": "ditulis 10 kebaikan, dihapus 10 kejelekan, diangkat 10 derajat, dan pada hari itu di dalam penjagaan dari yang dibenci, dijaga dari setan, dan tidak pantas bagi dosa menjumpai orang itu pada hari itu kecuali syirik kepada Alloh,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 227,
   "doa": "Doa Sebelum Salam",
   "arab": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ,",
   "latin": "ALLAHUMMA INNII ZHALAMTU NAFSII ZHULMAN KATSIIRAN WALAA YAGHFIRUDZDZUNUUBA ILLAA ANTA FAHGHFIRLII MAGHFIRATAN MIN 'INDIKA  WARHAMNI INNAKA ANTAL GHAFUURURRAHIIM,",
   "arti": "Ya Allah, sesungguhnya aku telah menzhalimi diriku sendiri dengan kezhaliman yang banyak, dan tidak ada yang bisa mengampuni dosa selain Engkau, maka ampunilah bagiku dari sisi-Mu, sesungguhnya Engkau Maha pengampun lagi Maha Penyayang,",
   "cara": "Dibaca sebelum salam,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 228,
   "doa": "Mendoakan Orang yang Akan Ditinggal Bepergian",
   "arab": "أَسْتَوْدِعُكَ اللَّهَ الَّذِي لَا تَضِيعُ وَدَائِعُهُ,",
   "latin": ",",
   "arti": "Aku menitipkan dirimu kepada Allah yang tidak akan menyia-nyiakan barang titipan-Nya,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Ibnu Majah,"
 },
 {
   "no": 229,
   "doa": "Doa Minta Keselamatan",
   "arab": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَدْمِ وَأَعُوذُ بِكَ مِنْ التَّرَدِّي وَأَعُوذُ بِكَ مِنْ الْغَرَقِ وَالْحَرَقِ وَالْهَرَمِ وَأَعُوذُ بِكَ أَنْ يَتَخَبَّطَنِي الشَّيْطَانُ عِنْدَ الْمَوْتِ وَأَعُوذُ بِكَ أَنْ أَمُوتَ فِي سَبِيلِكَ مُدْبِرًا وَأَعُوذُ بِكَ أَنْ أَمُوتَ لَدِيغًا,",
   "latin": "ALLAAHUMMA INNII A'UUDZU BIKA MINAL HADMI WA A'UUDZU BIKA MINAT TARADDII, WA A'UUDZU BIKA MINAL GHARAQI, WAL HARAQI, WAL HARAMI, WA A'UUDZU BIKA AN YATAKHABBATHANIISY SYAITHAANU 'INDAL MAUTI WA A'UUDZU BIKA AN AMUUTA FII SABIILIKA MUDBIRAN, WA A'UUDZU BIKA AN AMUUTA LADIIGHAN,",
   "arti": "Ya Allah, sesungguhnya aku berlindung kepadaMu dari kehancuran dan aku berlindung kepadaMu dari kebinasaan, aku berlindung kepadaMu dari tenggelam, terbakar dan dari pikun, aku berlindung kepadaMu agar jangan sampai syetan menggelincirkanku ketika aku akan mati, dan aku berlindung kepadaMu dari mati dijalanMu dalam keadaan lari dari medan pertempuran, dan aku berlindung kepadaMu dari mati karena tersengat binatang,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Abu Dawud,"
 },
 {
   "no": 230,
   "doa": "Bertempat di tempat baru",
   "arab": " يَا أَرْضُ رَبِّي وَرَبُّكِ اللَّهُ أَعُوذُ بِاللَّهِ مِنْ شَرِّكِ وَشَرِّ مَا فِيكِ وَشَرِّ مَا خُلِقَ فِيكِ وَمِنْ شَرِّ مَا يَدِبُّ عَلَيْكِ وَأَعُوذُ بِاللَّهِ مِنْ أَسَدٍ وَأَسْوَدَ وَمِنَ الْحَيَّةِ وَالْعَقْرَبِ وَمِنْ سَاكِنِ الْبَلَدِ وَمِنْ وَالِدٍ وَمَا وَلَدَ,",
   "latin": "Ya ardu, Rabbi wa Rabbuk-illahu, a'udhu billahi min sharriki wa sharri ma fiki, wa sharri ma khuliqa fiki, wa min sharri ma yadibbu 'alaiki; wa a'udhu billahi min asadin wa aswadin, wa minal-hayyati wal-'aqrabi, wa min sakinil-baladi, wa min walidin wa ma walad,",
   "arti": ",",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Abu Dawud,"
 },
 {
   "no": 231,
   "doa": "Niat Haji",
   "arab": "<ol><li>لَبَّيْكَ اللَّهُمَّ حَجًّا</li><li> لَبَّيْكَ بِحَجَّةٍ </li><li>لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ بِالْحَجِّ</li></ol>,",
   "latin": "<ol><li>Labbaikallahumma hajjan</li><li>labbaika bihajjatin</li><li>Labbaikallahumma labbaika bihajjatin</li></ol>,",
   "arti": ",",
   "cara": "Pilih salah satu,",
   "utama": ",",
   "sumber": "H.R. Bukhhori, H.R. Nasai,"
 },
 {
   "no": 232,
   "doa": "Niat Umroh",
   "arab": "<ol><li>لَبَّيْكَ اللَّهُمَّ عُمْرَةً</li><li>  لَبَّيْكَ بِعُمْرَةٍ </li></ol>,",
   "latin": "<ol><li>Labbaikallahumma 'umratan</li><li>labbaika bi 'umrah</li></ol>,",
   "arti": ",",
   "cara": "Pilih salah satu,",
   "utama": ",",
   "sumber": "H.R. Nasai,"
 },
 {
   "no": 233,
   "doa": "Talbiyah",
   "arab": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ، لاَ شَرِيكَ لَكَ,",
   "latin": "Labbaikallahumma labbaik. Labbaika laa syariika laka labbaik. Innal hamda wan ni'mata laka wal mulk. Laa syariika lak,",
   "arti": "Aku datang memenuhi panggilanMu ya Allah. Aku datang memenuhi panggilanMu tidak ada sekutu bagiMu. Sesungguhnya segala puji, nikmat milikMU begitu pula kerajaan. Tidak ada sekutu bagiMu,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 234,
   "doa": "Doa Menuju Masjid 2",
   "arab": "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا وَفِي لِسَانِي نُورًا وَاجْعَلْ فِي سَمْعِي نُورًا وَاجْعَلْ فِي بَصَرِي نُورًا وَاجْعَلْ مِنْ خَلْفِي نُورًا وَمِنْ أَمَامِي نُورًا وَاجْعَلْ مِنْ فَوْقِي نُورًا وَمِنْ تَحْتِي نُورًا اللَّهُمَّ أَعْطِنِي نُورًا,",
   "latin": "ALLAHUMMAJ 'AL FII QALBII NUURAN WA FII LISAANII NUURAN WAJ'AL FII SAM'I NUURAN WAJ'AL FII BASHARII NUURAN WAJ'AL MIN KHALFII NUURAN, WA MIN AMAAMII NUURAN, WAJ'AL MIN FAUQII NUURAN, WA MIN TAHTI NUURAAN, ALLAHUMMA'THINII NUURAN,",
   "arti": "Ya Allah berilah cahaya dalam hatiku, cahaya di lisanku, berilah cahaya dalam pendengaranku, berilah cahaya dalam penglihatanku, berilah aku cahaya dari belakangku, dari arah depanku, dan berikanlah cahaya dari atasku, dan arah bawahku. Ya Allah berilah aku cahaya,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Muslim,"
 },
 {
   "no": 235,
   "doa": "Melihat Ka'bah",
   "arab": "اللَّهُمَّ زِدْ هَذَا الْبَيْتَ تَشْرِيفًا وَتَعْظِيمًا، وَتَكْرِيمًا وَمَهَابَةً، وَزِدْ مَنْ شَرَّفَهُ وَكَرَّمَهُ مِمَّنْ حَجَّهُ أَوِ اعْتَمَرَه تَشْرِيفًا وَتَكْرِيمًا وَتَعْظِيمًا وَبِرًّا,",
   "latin": "ALLAHUMMA ZID HAAZAL BAITA TASYRIIFAN WATA'ZIIMAN WATAKRIIMAN WAMAHAABATAN. WAZID MAN SYARROFAHU WA 'ADZ-DZOMAHU WA KARROMAHU MIMMAN HAJJAHU AWI'TAMAROHU TASYRIIFAN WA TA'ZIIMAN WA TAKRIIMAN WABIRRON,",
   "arti": "Ya Allah, tambahkanlah kemuliaan, keagungan, kehormatan dan wibawa pada Baik Ka'bah) ini. Dan tambahkanlah pula pada orang-orang yang memuliakan, mengagungkan, menghormatinya diantara mereka yang berhaji atau yang berumrah dengan kemuliaan, keagungan, kehormatan, dan kebaikan,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Baihaqi,"
 },
 {
   "no": 236,
   "doa": "Melihat Ka'bah 2",
   "arab": "اللَّهُمَّ زِدْ بَيْتَكَ هَذَا تَشْرِيفًا وَتَعْظِيمًا، وَتَكْرِيمًا وَبِرًّا وَمَهَابَةً,",
   "latin": ",",
   "arti": ",",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Thabrani,"
 },
 {
   "no": 237,
   "doa": "Doa Mengusap / Isyarat hajar aswad dan rukun yaman",
   "arab": " بِسْمِ اللهِ ، وَاللهُ أَكْبَر,",
   "latin": ",",
   "arti": "Dengan menyebut nama Allah, Allah maha besar,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Baihaqi,"
 },
 {
   "no": 238,
   "doa": "Bacaan thowaf Dari hajar aswad - rukun yaman",
   "arab": "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ,",
   "latin": "Subhanallahu walhamdulillahi Laa ilaaha Illallah wAllahu Akbar wa Laa haula wa laa quwwata illaa billaah,",
   "arti": "Maha Suci Allah dan Segala puji bagi Allah dan Tiada Tuhan kecuali Allah dan Allah Maha Besa dan Tiada daya dan upaya kecuali dari Allah,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Ibnu Majah,"
 },
 {
   "no": 239,
   "doa": "Bacaan thowaf Dari rukun yaman - hajar aswad",
   "arab": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً، وَفِي الْآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ,",
   "latin": "ALLAHUMMA INNI AS`ALUKA AFWA WAL AFIYAH FIDUNYA WAL AKHIRAH RABBANA ATINA FIDUNYA HASANAH WAFIL AKHIRATI HASANAH WAQINA ADZABAN NAAR,",
   "arti": "Ya Allah aku berharap kemaafan dan kesehatan dari di dunia dan akhirat wahai Rabb kami, berilah kami kebaikan di dunia dan akhirat dan jauhkan kami dari api neraka,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Ibnu Majah,"
 },
 {
   "no": 240,
   "doa": "Bacaan sebelum sholat di belakang maqom ibrahim",
   "arab": "أَعُوذُ بِاللَّهِ مِنْ الشَّيْطَانِ الرَّجِيمِ بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى,",
   "latin": "A'udzu billahi minasysyaithani Rajim Bismillahi rahmaanir rahiim wattakhidzu min maqomi ibrohiima musholla,",
   "arti": "Aku berlindung kepada Allah dari syaitan yang terkutuk, Dengan menyebut nama Allah yang maha pengasih lagi maha penyayang, dan jadikanlah sebahagian maqam Ibrahim tempat shalat,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Ibnu Majah,"
 },
 {
   "no": 241,
   "doa": "Doa setelah sholat di belakang maqom Ibrahim",
   "arab": "اللَّهُمَّ أَنْتَ تَعْلَمُ سِرِّى وَعَلَانِيَّتِى فَاقْبَلْ مَعْذِرَتِى وَتَعْلَمُ حَاجَتِى فَأَعْطِنِى سُؤْلىِ وَتَعْلَمُ مَاعِنْدِى فَاغْفِرْلىِ ذُنُوْبىِ اللَّهُمَّ إِنِّي أَسْأَلُكَ إِيْمَانًا يُبَاهِى قَلْبِى وَيَقِيْنًا صَادِقًا حَتَّى أَعْلَمَ أَنَّهُ لَايُصِيْبُنِى إِلَّا مَا كَتَبْتَ لِى وَرَضِّنِى بِقَضَائِكَ,",
   "latin": ",",
   "arti": ",",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Thabrani,"
 },
 {
   "no": 242,
   "doa": "Doa ketika akan naik bukit shofa marwa",
   "arab": "أَعُوذُ بِاللَّهِ مِنْ الشَّيْطَانِ الرَّجِيمِ بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْم إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّه,",
   "latin": "A'udzu billahi minasysyaithani Rajim Bismillahi rahmaanir rahiim inna shoffa wal marwata min sya'airillah,",
   "arti": "Aku berlindung kepada Allah dari syaitan yang terkutuk, Dengan menyebut nama Allah yang maha pengasih lagi maha penyayang, Sesungguhnya Shafaa dan Marwa adalah sebahagian dari syi´ar Allah,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Ibnu Majah,"
 },
 {
   "no": 243,
   "doa": "Doa di atas bukit shofa marwa",
   "arab": "اللَّهُ أَكْبَرُ ,اللَّهُ أَكْبَرُ ,اللَّهُ أَكْبَرُ , لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ 3<br><br>اللَّهُمَّ إِنَّكَ قُلْتَ:ادْعُونِي أَسْتَجِبْ لَكُمْ، وَإِنَّكَ لَا تُخْلِفُ الْمِيعَادَ، وَإِنِّي أَسْأَلُكَ كَمَا هَدَيْتَنِي لِلْإِسْلَامِ أَنْ لَا تَنْزِعَهُ مِنِّي. حَتَّى تَتَوَفَّانِي وَأَنَا مُسْلِم,",
   "latin": "ALLAHU AKBAR ALLAHU AKBAR ALLAHU AKBAR LAA ILAAHA ILLALLAAHU WAHDAHU LAA SYARIIKA LAH, LAHUL MULKU WA LAHUL HAMDU YUHYII WA YUMIITU WA HUWA 'ALAA KULLI SYAI-IN QADIIR 3X <br><br> ALLAHUMMA INNAKA QULTA UD'UUNI ASTAJIB LAKUM WA INNAKA LAA TUKHLIFUL MII'AAD. WA INNI AS'ALUKA KAMA HADAITANII LIL ISLAAM AN LAA TANZI'AHU MINNII HATTA TATAWAFFAANII WA ANA MUSLIMUN,",
   "arti": "Allah Maha Besar 3X, Tidak ada tuhan yang berhak disembah kecuali Allah semata tidak ada sekutu bagiNya, milikNya semua kerajaan dan bagiNya seluruh pujian, Dia Yang menghidupkan, serta mematikan, dan Dia Maha Mampu melakukan segala sesuatu 3X) <br><br> Ya Allah, Engkau mengatakan: 'Mintalah kepada-Ku maka akan Aku kabulkan. Sesungguhnya Engkau tidak pernah mengingkari janji. Saya memohon kepadamu sebagaimana engkau tunjuki saya pada Islam, janganlah engkau cabut dariku hingga ajal menjemputku sedang saya dalam keadaan muslim,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Nasai, H.R. Malik,"
 },
 {
   "no": 244,
   "doa": "Doa ketika berlari kecil diantara bukit shofa dan marwa daerah bekas banjir - diberi tanda lampu hijau)",
   "arab": "رَبِّ اغْفِرْ لِي وَارْحَمْ وَأَنْتَ الْأَعَزُّ الْأَكْرَم,",
   "latin": ",",
   "arti": ",",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Baihaqi,"
 },
 {
   "no": 245,
   "doa": "Doa Ketika Wukuf di Arafah",
   "arab": "اللَّهُمَّ لَكَ الْحَمْدُ كَالَّذِي تَقُولُ وَخَيْرًا مِمَّا نَقُولُ اللَّهُمَّ لَكَ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي وَإِلَيْكَ مَآبِي وَلَكَ رَبِّ تُرَاثِي اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَوَسْوَسَةِ الصَّدْرِ وَشَتَاتِ الْأَمْرِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا تَجِيءُ بِهِ الرِّيحُ,",
   "latin": "ALLAAHUMMA LAKAL HAMDU KALLADZII TAQUULU WA KHAIRAN MIMMAA NAQUULU, ALLAAHUMMA LAKA SHALAATII, WA NUSUKII, WA MAHYAAYA WA MAMAATII WA ILAIKA MA-AABII, WA LAKA RABBI TURAATSII. ALLAAHUMMA INNII A'UUDZU BIKA MIN 'ADZAABIL QABRI, WA WASWASATISH SHADRI WA SYATAATIL AMRI. ALLAAHUMMA INNII A'UUDZU BIKA MIN SYARRI MAA TAJIIU BIHIR RIIHU,",
   "arti": "Ya Allah, segala puji bagiMu seperti yang engkau katakan, dan lebih baik daripada apa yang kami katakan. Ya Allah, untukMu shalatku, sembelihanku, hidup dan matiku, kepadaMu kembaliku, dan milikMu wahai Tuhanku kekayaanku. Ya Allah, aku berlindung kepadaMu dari adzab kubur, dan bisikan hati, serta kekacauan urusanku. Ya Allah, aku berlindung kepadaMu dari kejahatan apa yang dibawa oleh angin,",
   "cara": "Nabi Muhammad SAW banyak membacanya ketika sore hari di Arafah di tempat wukuf. Boleh ditambah dengan doa/dzikir/Al Qur'an semampunya,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 246,
   "doa": "Doa Pulang Haji",
   "arab": "اللَّهُ أَكْبَرُ3<br> لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ آيِبُونَ تَائِبُونَ عَابِدُونَ سَاجِدُونَ لِرَبِّنَا حَامِدُونَ صَدَقَ اللَّهُ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الْأَحْزَابَ وَحْدَهُ,",
   "latin": "ALLAHU AKBAR 3X<br>Laa ilaaha illallahu wahdahu laa syariika lahu, lahul mulku wa lahul hamdu wa huwa 'alaa kulli syai'in qadiir. Aayibuuna taa'buuna 'aabiduuna saajiduuna li rabbinaa haamiduun. Shadaqallah wa'dahu wa nashara 'abdahu wa hazamal ahzaaba wahdah,",
   "arti": "Allah Maha Besar<br>Tidak ada ilah yang berhak disembah selain Allah satu-satunya, tidak ada sekutu bagi-Nya. Milik-Nya segala kerajaan, dan pujian dan Dia Maha Berkuasa atas segala sesuatu. Kita kembali, sebagai hamba yang bertaubat, ber'ibadah, sujud untuk Rabb kita dan yang memuji-Nya. Allah Maha Benar dengan janji-Nya, menolong hamba-Nya dan menghancurkan musuh-musuh-Nya,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 247,
   "doa": "Minum Air Zam Zam",
   "arab": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا وَاسِعًا، وَشِفَاءً مِنْ كُلِّ دَاء,",
   "latin": ",",
   "arti": ",",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Hakam,"
 },
 {
   "no": 248,
   "doa": "Doa Pengendalian Diri",
   "arab": "اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ,",
   "latin": "Allaahumma Faathiras samaawaati wal-ardhi ‘Aalimal ghaibi was syahadah, Rabbi kulli syaiin wamaliikah. Asyhadu an laa Ilaaha illaa Anta. Aauudzu biKa min syarri nafsii, wasyarris syaithaani wasyirkih,",
   "arti": "Ya Allah Pencipta beberapa langit dan bumi, yang Maha Tahu barang-barang ghaib dan barang-barang tampak, Tuhan dan Penguasa segala sesuatu. Saya bersaksi bahwa tiada Tuhan yang wajib disembah kecuali Engkau. padaMu saya berlindung dari jeleknya diri saya, dari jelek dan syiriknya syaitan,",
   "cara": "Sebaiknya dibaca pagi, sore dan sebelum tidur,",
   "utama": ",",
   "sumber": "H.R. Abu Dawud,"
 },
 {
   "no": 249,
   "doa": "Doa Ketika Berperang",
   "arab": "اللَّهُمَّ أَنْتَ عَضُدِي وَأَنْتَ نَصِيرِي وَبِكَ أُقَاتِلُ,",
   "latin": "ALLAHUMMA ANTA 'ADLUDII WA ANTA NASHIIRII WABIKA UQAATILU,",
   "arti": "Ya Allah, Sesungguhnya Engkau adalah sandaranku dan penolongku, dengan kekuatan dan pertolongan-Mu lah) aku berperang,",
   "cara": "ketika berperang,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 250,
   "doa": "Doa Terhindar dari Bahaya",
   "arab": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ,",
   "latin": "A'UUDZU BIKALIMAATILLAHIT TAAMMAH MIN SYARRI MAA KHALAQ,",
   "arti": "aku berlindung kepada kalimat-kalimat Allah yang sempurna dari kejahatan para makhluk yang telah Dia ciptakan,",
   "cara": "Sore Hari dibaca 3X,",
   "utama": "dia tidak akan tertimpa bahaya pada malam itu,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 251,
   "doa": "Doa yang di Sukai Nabi Muhammad SAW",
   "arab": "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ,",
   "latin": "SUBHAANALLAHI WAL HAMDULILLAHI WALAA ILAAHA ILLA ALLAH WA ALLAHU AKBAR,",
   "arti": "maha suci Allah, segala pujian hanya milik Allah, tiada Ilah melainkan Allah dan Allah Maha Besar,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "lebih disukai Nabi Muhammad SAW dari terbitnya matahari,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 252,
   "doa": "Doa agar pintu langit dibuka",
   "arab": "اللَّهُ أَكْبَرُ كَبِيرًا وَالْحَمْدُ لِلَّهِ كَثِيرًا وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلًا,",
   "latin": "ALLAHU AKBAR KABIRAN WAL HAMDULILLAHI KATSIRAN WASUBHAANALLAHI BUKRATAN WA`ASHIILAA,",
   "arti": "Allah Maha Besar dengan besar, dan segala puji yang banyak bagi Allah, Maha Suci Engkau Allah di waktu pagi dan di waktu sore,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "Pintu-pintu langit dibuka,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 253,
   "doa": "Doa agar mengantarkan ke pintu surga",
   "arab": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ,",
   "latin": "LAA HAULA WALAA QUWWATA ILLA BILLAH,",
   "arti": "Tidak ada daya dan upaya kecuali milik Allah,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "mengantarkan menuju pintu-pintu surga,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 254,
   "doa": "Doa agar mati dalam keadaan fitrah",
   "arab": "اللَّهُمَّ أَسْلَمْتُ وَجْهِي إِلَيْكَ وَفَوَّضْتُ أَمْرِي إِلَيْكَ وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ رَغْبَةً وَرَهْبَةً إِلَيْكَ لَا مَلْجَأَ وَلَا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ وَنَبِيِّكَ الَّذِي أَرْسَلْتَ,",
   "latin": "ALLAAHUMMA ASLAMTU WAJHII ILAIKA, WA ASLAMTU WAJHII ILAIKA WA FAWWADHTU AMRII ILAIKA RAGHBATAN WA RAHBATAN ILAIKA, WA? ALJA`TU ZHAHRII ILAIKA, LAA MALJA-A WA LAA MANJAA MINKA ILLAA ILAIKA, AAMANTU BIKITAABIKALLADZII ANZALTA WA NABIYYIKALLADZII ARSALTA,",
   "arti": "Ya Allah, aku serahkan wajahku kepadaMu, aku serahkan urusanku kepadamu, dengan perasaan antara harap dan takut kepadaMu. Dan aku sandarkan punggungku kepadaMu, tidak ada tempat berlindung dan tempat menyelamatkan diri kecuali kepadaMu. Aku beriman kepada kitabMu yang telah Engkau turunkan, dan kepada nabiMu yang telah Engkau utus,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "engkau mati pada malam itu maka engkau mati dalam keadaan fitrah,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 255,
   "doa": "Tasbih yang lebih banyak pahalanya",
   "arab": "سُبْحَانَ اللَّهِ عَدَدَ خَلْقِهِ,",
   "latin": "SUBHAANALLAAH, 'ADADA KHALQIHI,",
   "arti": "Maha suci Allah, sebanyak jumlah makhluqNya,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "tasbih yang lebih banyak pahalanya,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 256,
   "doa": "Nama Allah yang Agung",
   "arab": "اللَّهُمَّ لَا إِلَهَ إِلَّا أَنْتَ الْمَنَّانُ بَدِيعُ السَّمَوَاتِ وَالْأَرْضِ ذَا الْجَلَالِ وَالْإِكْرَامِ,",
   "latin": "ALLAAHUMMA LAA ILAAHA ILLAA ANTA Al MANNAAN, BADII'US SAMAAWAATI WAL ARDHI DZAL JALAALI WAL IKRAAM,",
   "arti": "Ya Allah, tidak ada tuhan yang berhak disembah kecuali Engkau, Yang Maha Memberi, Pencipta langit dan bumi, Dzat Yang memiliki keagungan dan kemuliaan,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "nama Allah yang paling agung, yang apabila Allah dimintai dengan doa maka Allah akan mengabulkannya. Dan apabila diminta maka Allah akan memberi,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 257,
   "doa": "Doa agar doanya dikabulkan",
   "arab": "يَا ذَا الْجَلَالِ وَالْإِكْرَامِ,",
   "latin": "YAA DZAL JALAALI WAL IKRAAM,",
   "arti": "Wahai Dzat yang memiliki kebesaran dan kemuliaan,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "Doanya dikabulkan,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 258,
   "doa": "Doa agar diampuni Allah",
   "arab": " لَا إِلَهَ إِلَّا اللَّهُ الْعَلِيُّ الْعَظِيمُ لَا إِلَهَ إِلَّا اللَّهُ الْحَلِيمُ الْكَرِيمُ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ اللَّهِ رَبِّ الْعَرْشِ الْعَظِيمِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ)  ا,",
   "latin": "LAA ILAAHA ILLALLAAHUL 'ALIYYUL 'AZHIIMI LAA ILAAHA ILLALLAAHUL KARIIM, LAA ILAAHA ILLALLAAHU SUBHAANLLAAHI RABBIL 'ARSYIL 'AZHIIM Al HAMDULILLAAHI RABBIL 'AALAMIIN),",
   "arti": "Tidak ada tuhan yang berhak disembah kecuali Allah Yang Maha Tinggi dan Maha Agung, tidak ada tuhan yang berhak disembah kecuali Allah Yang Maha Maha Lembut dan Mulia. Tidak ada tuhan yang berhak disembah kecuali Allah, Maha Suci Allah Tuhan semesta 'arsy yang agung Segala puji bagi Allah Tuhan semesta alam),",
   "cara": "lafal Al HAMDULILLAAHI RABBIL 'AALAMIIN adalah tambahan dari Ali bin Al Husain bin Waqid,",
   "utama": "Allah akan mengampunimu,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 259,
   "doa": "Bacaan Terakhir Nabi Muhammad SAW",
   "arab": "اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَأَلْحِقْنِي بِالرَّفِيقِ الْأَعْلَى,",
   "latin": "ALLAAHUMMAGHFIRLII, WARHAMNII, WA ALHIQNII BIRRAFIIQIL A'LAA,",
   "arti": "Ya Allah, ampunilah aku, rahmatilah aku, dan pertemukan aku dengan kekasih Yang Tertinggi,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "Bacaan terakhir Nabi Muhammad SAW sebelum wafat,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 260,
   "doa": "40 Juta Kebaikan",
   "arab": "أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ إِلَهًا وَاحِدًا أَحَدًا صَمَدًا لَمْ يَتَّخِذْ صَاحِبَةً وَلَا وَلَدًا وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ,",
   "latin": "ASYHADU AN LAA ILAAHA ILLALLAAHU WAHDAHU LAA SYARIIKALAHU ILAAHAN WAAHIDAN SHAMADAN LAM YATTAKHIDZ SHAAHIBATAN WA LAM YAKUN LAHU KUFUWAN AHAD,",
   "arti": "aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah semata tidak ada sekutu bagiNya, Tuhan yang Esa, Tempat bergantung, tidak beristeri serta tidak beranak, dan tidak ada yang serupa denganNya,",
   "cara": "Dibaca 10 X,",
   "utama": "Allah mencatat baginya empat puluh juta kebaikan,",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 261,
   "doa": "Berangkat untuk bepergian",
   "arab": "اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ وَالْخَلِيفَةُ فِي الْأَهْلِ اللَّهُمَّ اصْحَبْنَا بِنُصْحِكَ وَاقْلِبْنَا بِذِمَّةٍ اللَّهُمَّ ازْوِ لَنَا الْأَرْضَ وَهَوِّنْ عَلَيْنَا السَّفَرَ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمُنْقَلَبِ,",
   "latin": "ALLAAHUMMA ANTASH SHAAHIBU FISSAFARI WAL KHALIIFATU FIL AHLI, ALLAAHUMMASHHABNAA BINUSHHIKA, WAQBALNAA BIDZIMMATIN, ALLAAHUMMAZWI LANAAL ARDHA WA HAWWIN 'ALAINAS SAFARA. ALLAAHUMMA INNII A'UUDZU BIKA MIN WA'TSAA-ISSAFARI WA KA-AABATIL MUNQALABI,",
   "arti": "Ya Allah, Engkau adalah Teman dalam perjalanan, dan Pengganti di dalam keluarga. Ya Allah, sertailah kami dengan nasehatMu, dan kembalikanlah kami dengan jaminan-Mu. Ya Allah, dekatkanlah jarak untuk kami, dan ringankanlah perjalanan untuk kami. Ya Allah, sesungguhnya aku berlindung kepadaMu dari beratnya perjalanan, dan kesedihan saat kembali,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 262,
   "doa": "Pulang dari bepergian",
   "arab": "آيِبُونَ تَائِبُونَ عَابِدُونَ لِرَبِّنَا حَامِدُونَ,",
   "latin": "AAYIBUUNA TAAIBUUNA 'AABIDUUNA LIRABBINAA HAAMIDUUN,",
   "arti": "Kami kembali, kami bertaubat, kami menyembah, dan kepada Tuhan kami, kami memuji,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 263,
   "doa": "Ketika orang yang berpergian berpamitan",
   "arab": "اسْتَوْدِعْ اللَّهَ دِينَكَ وَأَمَانَتَكَ وَآخِرَ عَمَلِكَ,",
   "latin": "ISTAUDI'ILLAAHA DIINAKA WA AMAANATAKA WA AAKHIRA 'AMALIKA,",
   "arti": "Titipkan kepada Allah agamamu, amanahmu dan akhir dari amalanmu,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 264,
   "doa": "istighfar yang paling baik raja istighfar)",
   "arab": " اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ  أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ) ا,",
   "latin": "ALLAHUMMA ANTA RABBI LAA ILAAHA ILLA ANTA KHALAQTANI WA ANA 'ABDUKA WA ANA 'ALA 'AHDIKA WA WA'DIKA MASTATHA'TU A'UUDZU BIKA MIN SYARRI MAA SHANA'TU ABUU`U LAKA BIDZANBI WA ABUU`U LAKA BINI'MATIKA 'ALAYYA FAGHFIRLI FA INNAHU LAA YAGHFIRU ADZ DZUNUUBA ILLA ANTA A'UUDZU BI SYARRI MAA SHANA'TU ),",
   "arti": "Ya Allah, Engkau adalah Tuhanku, tidak ada Tuhan yang berhak diibadahi selain Engkau. Engkau telah menciptakanku dan aku adalah hamba-Mu. Aku menetapi perjanjian-Mu dan janji-Mu sesuai dengan kemampuanku. Aku berlindung kepada-Mu dari keburukan perbuatanku, aku mengakui dosaku kepada-Mu dan aku akui nikmat-Mu kepadaku, maka ampunilah aku. Sebab tidak ada yang dapat mengampuni dosa selain-Mu dan aku meminta ampun dari segala yang pernah aku perbuat),",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "Jika ia mengucapkan di waktu sore lalu meninggal, maka ia akan masuk surga. Dan jika ia membacanya di waktu pagi lalu meninggal pada hari, maka ia mendapatkan seperti itu juga,",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 265,
   "doa": "doa solawat kepada orang lain",
   "arab": "اللَّهُمَّ صَلِّ عَلَى آل    فُلَانٍ) ا,",
   "latin": ",",
   "arti": ",",
   "cara": "fulan, diganti nama,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 266,
   "doa": "Doa Minta Hujan",
   "arab": "اللَّهُمَّ اسْقِنَا غَيْثًا مُغِيثًا مَرِيئًا مَرِيعاً نَافِعًا غَيْرَ ضَارٍّ عَاجِلاً غَيْرَ آجِلٍ,",
   "latin": ",",
   "arti": ",",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Abu Daud,"
 },
 {
   "no": 267,
   "doa": "Doa Memindahkan Hujan",
   "arab": "اللَّهُمَّ حَوَالَيْنَا وَلَا عَلَيْنَا,",
   "latin": "ALLAHUMMA HAWAALAINAA WALAA 'ALAINAA,",
   "arti": "Ya Allah, hujanilah sekitar kami dan jangan kepada kami,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Muslim,"
 },
 {
   "no": 268,
   "doa": "Doa yang dibalas ketika bertemu Allah",
   "arab": "يَا رَبِّ لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ وَلِعَظِيمِ سُلْطَانِكَ,",
   "latin": "Ya Rabb! Lakal-hamdu kama yanbagi li-jalali Wajhika wa li'azima sultanika,",
   "arti": "Ya Rabb, bagi-Mu segala puji sebagaimana yang selayaknya bagi kebesaran wajah-Mu dan keagungan kekuasaan-Mu,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "Dibalas ketika bertemu dengan Allah,",
   "sumber": "H.R. Ibnu Majah,"
 },
 {
   "no": 269,
   "doa": "Doa Sarah istri Nabi Ibrahim)",
   "arab": "اللَّهُمَّ إِنْ كُنْتُ آمَنْتُ بِكَ وَبِرَسُولِكَ، وَأَحْصَنْتُ فَرْجِي، إِلَّا عَلَى زَوْجِي فَلاَ تُسَلِّطْ عَلَيَّ الكَافِرَ,",
   "latin": ",",
   "arti": "Ya Allah, sesungguhnya Engkau mengetahui bahwa aku beriman kepadaMu dan kepada RasulMu dan aku memelihara kemaluanku kecuali untuk suamiku maka janganlah Engkau satukan aku dengan orang kafir ini,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Bukhori,"
 },
 {
   "no": 270,
   "doa": "Mendoakan Pengantin Baru",
   "arab": " بَارَكَ اللَّهُ لَكَ وَبَارَكَ عَلَيْكَ وَجَمَعَ بَيْنَكُمَا فِي الْخَيْرِ,",
   "latin": "BARAKALLAH LAKA WA BARAKA 'ALAIKA WA JAMA'A BAINAKUMA FIL KHAIR,",
   "arti": "semoga Allah memberi berkah kepadamu dan keberkahan atas pernikahan kamu, dan mengumpulkan kalian berdua dalam kebaikan,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": ",",
   "sumber": "H.R. Tirmidzi,"
 },
 {
   "no": 271,
   "doa": "Doa Orang yang Menikah Suami)/Membeli Kendaraan Baru",
   "arab": " اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَمِنْ شَرِّ مَا جَبَلْتَهَا عَلَيْهِ,",
   "latin": "ALLAAHUMMA INNII AS`ALUKA KHAIRAHAA WA KHAIRA MAA JABALTAHAA 'ALAIHI WA A'UUDZU BIKA MIN SYARRIHAA WA MIN SYARRI MAA JABALTAHAA 'ALAIH,",
   "arti": "Ya Allah, aku memohon kepadaMu kebaikannya dan kebaikan sesuatu yang Engkau ciptakan dia padanya, dan aku berlindung kepadaMu dari keburukannya dan keburukan sesuatu yang Engkau ciptakan dia padanya,",
   "cara": "Tangan kanan pria diletakkan di ubun-ubun mempelai wanita, tangan kiri pria di bahu mempelai wanita,",
   "utama": ",",
   "sumber": "H.R. Abu Daud,"
 },
 {
   "no": 272,
   "doa": "3 ayat terakhir Surat Al Hasr",
   "arab": " أَعُوذُ بِاللَّهِ السَّمِيعِ الْعَلِيمِ مِنْ الشَّيْطَانِ الرَّجِيمِ 3<br><p align=center> Tiga ayat Terakhir Surat Al Hasr </p> هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ ۖ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ ۖ هُوَ الرَّحْمَٰنُ الرَّحِيمُ22) هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ ۚ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ23) هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ ۖ لَهُ الْأَسْمَاءُ الْحُسْنَىٰ ۚ يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ 24) ا,",
   "latin": "A'udzu billahi Sami'il 'Aliim minasysyaithani Rajim 3X HUWALLAHULLADZII LAA ILAAHA ILLAHUWA ‘ALIMUL GHOIBI WASSYAHAADATI HUWARROHMAANURROOHIIM HUWALLAHULLADZII LAA ILAAHA ILLAA HUWAL MALIKUL QUDDUUSUSSALAAMUL MUMINUL MUHAIMINUL ‘AZIIZUL JABBAARUL MUTAKABBIRU SUBHAANALLAHI ‘AMMAA YUSYRIKUUN HUWALLAHUL KHOOLIQUL BAARI-UL MUSHOWWIRU LAHUL ASMAAAUL HUSNA YUSABBIHU LAHUU MAA FISSAMAAWAATI WAL ARDHI WAHUWAL ‘AZIIZUL HAKIIM,",
   "arti": "Aku berlindung kepada Allah Yang Maha Mendengar dan Mengetahui dari syaitan yang terkutuk,",
   "cara": "Dibaca 3X lalu dilanjutkan 3 Ayat Terakhir Surat Al Hasr, Dibaca saat permulaan sore / malam,",
   "utama": "Allah akan mewakilkan kepada tujuh puluh ribu Malaikat yang bershalawat untuknya hingga ia memasuki sore hari. Jika ia meninggal pada hari itu, maka ia meninggal sebagai syahid. Dan barangsiapa membacanya ketika sore hari, maka ia juga mendapat kedudukan seperti itu,",
   "sumber": "H.R. Ahmad,"
 },
 {
   "no": 273,
   "doa": "Doa agar Diberi Kerajaan",
   "arab": "اللَّهُمَّ مَالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَنْ تَشَاءُ، وَتَنْزِعُ الْمُلْكَ مِمَّنْ تَشَاءُ، وَتُعِزُّ مَنْ تَشَاءُ، وَتُذِلُّ مَنْ تَشَاءُ بِيَدِكَ الْخَيْرُ إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، تُولِجُ اللَّيْلَ فِي النَّهَارِ، وتُولِجُ النَّهَارَ فِي اللَّيْلِ، وَتُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ، وَتُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ، وَتَرْزُقُ مَنْ تَشَاءُ بِغَيْرِ حِسَابٍ رَحْمَنَ الدُّنْيَا وَالآخِرَةِ وَرَحِيمَهُمَا، تُعْطِي مَنْ تَشَاءُ مِنْهُمَا، وتَمْنَعُ مَنْ تَشَاءُ، ارْحَمْنِي رَحْمَةً تُغْنِيني بِهَا عَنْ رَحْمَةِ مَنْ سِوَاكَ,",
   "latin": "Allaahumma Maalikal-mulki tuthil mulka man tasyaaau wa tanziul mulka mimman tasyaaau wa tuizzu man tasyaaau wa tudzillu man tasyaaau bi Yadikal khairu innaka ‘alla kulli syaiin qadiir. Tuulijullaila finnahaari wa tuulijunnahaara fillaili wa tukhrijul chayya minal mayyiti wa tukhrijul mayyita minal chayyi wa tarzuqu man tasyaaau bi ghoii chisaab. Rohmaanad dunyaa wal aakhirati wa Rohiimahumaa. Tuthii man tasyaaau min humaa wa tamnau man tasyaaurhamnii rahmatan tughniinii bihaa ‘an rahmati man siwaaK,",
   "arti": "Ya Allah Raja segala kerajaan, Tuhan memberikan kerajaan pada yang Tuhan kehendaki dan melepas kerajaan dari yang Tuhan kehendaki, dan menjayakan orang yang Tuhan kehendaki, dan merendahkan orang yang Tuhan kehendaki. Di Tangan Tuhan lah segala kebaikan, sungguh Tuhan Maha Kuasa atas segala sesuatu. Tuhan memasukkan malam di dalam siang dan memasukkan siang di dalam malam. Mengeluarkan hidup dari mati dan mengeluarkan mati dari hidup. Dan memberi rizqi dengan tanpa perhitungan pada orang yang Tuhan kehendaki. Wahai yang Maha pengasih di dunia dan akhirat dan Maha penyayang di dalam duanya, Tuhan memberi bagian dari duanya pada orang yang Tuhan kehendaki dan menghalang-halangi orang yang Tuhan kehendaki. Sayangilah saya dengan rahmat yang Tuhan pergunakan memberi kekayaan hamba, jauh dari rahmat selain Tuhan,",
   "cara": "Baca dengan khusyuk dan penuh keyakinan,",
   "utama": "bisa melunasi hutang yang banyak,",
   "sumber": "H.R. Thabrani,"
 },
 {
   "no": 274,
   "doa": "Doa Setelah Baca Al Qur'an",
   "arab": "اللَّهُمَّ ارْحَمْنَابِالْقُرْأَنِ وَاجْعَلْهُ لَنَا إِمَامًا وَهُدًى وَنُوْرًا وَرَحْمَةً اللَّهُمَّ ذَكِّرْنَا مِنْهُ مَا نَسِيْىنَا وَعَلِّمْنَا مِنْهُ مَا جَهِلْنَا وَارْزُقْنَا تِلَاوَتَهُ أَنَاءَاللَّيْلِ وَالنَّهَارِ وَاجْعَلْهُ لَنَا حُجَّةً يَا رَبَّ الْعَالَمِيْنَ,",
   "latin": "Doa setelah membaca Al Qur'an ini hanyalah susunan Doa, untuk rujukan hadistnya kami belum menjumpainya. Adapun doa Setelah membaca Al Qur'an sebenarnya bisa apa aja, hanya saja untuk memenuhi permintaan doa, makannya kami sajikan doa ini.,",
   "arti": ",",
   "cara": ",",
   "utama": ",",
   "sumber": ","
 },
 {
   "no": 275,
   "doa": "",
   "arab": "",
   "latin": "",
   "arti": "",
   "cara": "",
   "utama": "",
   "sumber": ""
 },
 {
   "no": 276,
   "doa": "",
   "arab": "",
   "latin": "",
   "arti": "",
   "cara": "",
   "utama": "",
   "sumber": ""
 }
]
